using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace Store.Data.Migrations
{
    public partial class Initial : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.EnsureSchema(
                name: "dbo");

            migrationBuilder.CreateTable(
                name: "NavigationItems",
                schema: "dbo",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Path = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    Title = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    Icon = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ParentId = table.Column<int>(type: "int", nullable: true),
                    Disabled = table.Column<bool>(type: "bit", nullable: true),
                    Order = table.Column<int>(type: "int", maxLength: 55, nullable: false),
                    CreatedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    ModifiedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    CreatedDate = table.Column<DateTime>(type: "datetime2", nullable: true),
                    ModifiedDate = table.Column<DateTime>(type: "datetime2", nullable: true),
                    Deleted = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_NavigationItems", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "RuCities",
                schema: "dbo",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    CityAddress = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    Country = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    CountryIsoCode = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    PostalCode = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    FederalDistrict = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    RegionType = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    Region = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    AreaType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    Area = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    City = table.Column<string>(type: "nvarchar(50)", maxLength: 50, nullable: false),
                    CityType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    TimeZone = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_RuCities", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "UserRoles",
                schema: "dbo",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Role = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    CreatedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    ModifiedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    CreatedDate = table.Column<DateTime>(type: "datetime2", nullable: true),
                    ModifiedDate = table.Column<DateTime>(type: "datetime2", nullable: true),
                    Deleted = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_UserRoles", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Users",
                schema: "dbo",
                columns: table => new
                {
                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    Email = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    Phone = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    Status = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    PasswordHash = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    CreatedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    ModifiedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    CreatedDate = table.Column<DateTime>(type: "datetime2", maxLength: 50, nullable: false),
                    ModifiedDate = table.Column<DateTime>(type: "datetime2", maxLength: 50, nullable: false),
                    Deleted = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Users", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "UserRolesToNavigationItems",
                schema: "dbo",
                columns: table => new
                {
                    RoleId = table.Column<int>(type: "int", nullable: false),
                    NavigationItemId = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_UserRolesToNavigationItems", x => new { x.RoleId, x.NavigationItemId });
                    table.ForeignKey(
                        name: "FK_UserRolesToNavigationItems_NavigationItems_NavigationItemId",
                        column: x => x.NavigationItemId,
                        principalSchema: "dbo",
                        principalTable: "NavigationItems",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_UserRolesToNavigationItems_UserRoles_RoleId",
                        column: x => x.RoleId,
                        principalSchema: "dbo",
                        principalTable: "UserRoles",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "UserNavigations",
                schema: "dbo",
                columns: table => new
                {
                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    Title = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    IsDefault = table.Column<bool>(type: "bit", nullable: false),
                    UserId = table.Column<Guid>(type: "uniqueidentifier", nullable: true),
                    CreatedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    ModifiedBy = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    CreatedDate = table.Column<DateTime>(type: "datetime2", nullable: true),
                    ModifiedDate = table.Column<DateTime>(type: "datetime2", nullable: true),
                    Deleted = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_UserNavigations", x => x.Id);
                    table.ForeignKey(
                        name: "FK_UserNavigations_Users_UserId",
                        column: x => x.UserId,
                        principalSchema: "dbo",
                        principalTable: "Users",
                        principalColumn: "Id");
                });

            migrationBuilder.CreateTable(
                name: "UsersToRoles",
                schema: "dbo",
                columns: table => new
                {
                    UserId = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    RoleId = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_UsersToRoles", x => new { x.UserId, x.RoleId });
                    table.ForeignKey(
                        name: "FK_UsersToRoles_UserRoles_RoleId",
                        column: x => x.RoleId,
                        principalSchema: "dbo",
                        principalTable: "UserRoles",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_UsersToRoles_Users_UserId",
                        column: x => x.UserId,
                        principalSchema: "dbo",
                        principalTable: "Users",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "NavigationsToNavigationItems",
                schema: "dbo",
                columns: table => new
                {
                    NavigationId = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                    NavigationItemId = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_NavigationsToNavigationItems", x => new { x.NavigationId, x.NavigationItemId });
                    table.ForeignKey(
                        name: "FK_NavigationsToNavigationItems_NavigationItems_NavigationItemId",
                        column: x => x.NavigationItemId,
                        principalSchema: "dbo",
                        principalTable: "NavigationItems",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_NavigationsToNavigationItems_UserNavigations_NavigationId",
                        column: x => x.NavigationId,
                        principalSchema: "dbo",
                        principalTable: "UserNavigations",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "NavigationItems",
                columns: new[] { "Id", "CreatedBy", "CreatedDate", "Deleted", "Disabled", "Icon", "ModifiedBy", "ModifiedDate", "Order", "ParentId", "Path", "Title" },
                values: new object[,]
                {
                    { 1, new Guid("00000000-0000-0000-0000-000000000000"), null, null, null, "person", new Guid("00000000-0000-0000-0000-000000000000"), null, 1, null, "/private/profile", "Профиль" },
                    { 2, new Guid("00000000-0000-0000-0000-000000000000"), null, null, null, "groups", new Guid("00000000-0000-0000-0000-000000000000"), null, 2, null, "/private/team", "Команда" },
                    { 3, new Guid("00000000-0000-0000-0000-000000000000"), null, null, null, "people", new Guid("00000000-0000-0000-0000-000000000000"), null, 1, 2, "/private/team/players", "Игроки" },
                    { 4, new Guid("00000000-0000-0000-0000-000000000000"), null, null, null, "settings", new Guid("00000000-0000-0000-0000-000000000000"), null, 2, 2, "/private/team/settings", "Настройки" },
                    { 5, new Guid("00000000-0000-0000-0000-000000000000"), null, null, null, "group_add", new Guid("00000000-0000-0000-0000-000000000000"), null, 3, 2, "/private/team/requests", "Заявки" },
                    { 6, new Guid("00000000-0000-0000-0000-000000000000"), null, null, true, "calendar_view_month", new Guid("00000000-0000-0000-0000-000000000000"), null, 3, null, "/private/events", "События" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 1, "", "", "Адыгейск", "Респ Адыгея, г Адыгейск", "г", "Россия", "RUS", "Южный", "385200", "Адыгея", "Респ", "UTC+3" },
                    { 2, "", "", "Майкоп", "г Майкоп", "г", "Россия", "RUS", "Южный", "385000", "Адыгея", "Респ", "UTC+3" },
                    { 3, "", "", "Горно-Алтайск", "г Горно-Алтайск", "г", "Россия", "RUS", "Сибирский", "649000", "Алтай", "Респ", "UTC+7" },
                    { 4, "", "", "Алейск", "Алтайский край, г Алейск", "г", "Россия", "RUS", "Сибирский", "658125", "Алтайский", "край", "UTC+7" },
                    { 5, "", "", "Барнаул", "г Барнаул", "г", "Россия", "RUS", "Сибирский", "656000", "Алтайский", "край", "UTC+7" },
                    { 6, "", "", "Белокуриха", "Алтайский край, г Белокуриха", "г", "Россия", "RUS", "Сибирский", "659900", "Алтайский", "край", "UTC+7" },
                    { 7, "", "", "Бийск", "Алтайский край, г Бийск", "г", "Россия", "RUS", "Сибирский", "659300", "Алтайский", "край", "UTC+7" },
                    { 8, "Локтевский", "р-н", "Горняк", "Алтайский край, г Горняк", "г", "Россия", "RUS", "Сибирский", "658420", "Алтайский", "край", "UTC+7" },
                    { 9, "", "", "Заринск", "Алтайский край, г Заринск", "г", "Россия", "RUS", "Сибирский", "659100", "Алтайский", "край", "UTC+7" },
                    { 10, "Змеиногорский", "р-н", "Змеиногорск", "Алтайский край, г Змеиногорск", "г", "Россия", "RUS", "Сибирский", "658480", "Алтайский", "край", "UTC+7" },
                    { 11, "Каменский", "р-н", "Камень-на-Оби", "Алтайский край, г Камень-на-Оби", "г", "Россия", "RUS", "Сибирский", "658700", "Алтайский", "край", "UTC+7" },
                    { 12, "", "", "Новоалтайск", "Алтайский край, г Новоалтайск", "г", "Россия", "RUS", "Сибирский", "658041", "Алтайский", "край", "UTC+7" },
                    { 13, "", "", "Рубцовск", "Алтайский край, г Рубцовск", "г", "Россия", "RUS", "Сибирский", "658200", "Алтайский", "край", "UTC+7" },
                    { 14, "", "", "Славгород", "Алтайский край, г Славгород", "г", "Россия", "RUS", "Сибирский", "658820", "Алтайский", "край", "UTC+7" },
                    { 15, "", "", "Яровое", "Алтайский край, г Яровое", "г", "Россия", "RUS", "Сибирский", "658837", "Алтайский", "край", "UTC+7" },
                    { 16, "", "", "Белогорск", "Амурская обл, г Белогорск", "г", "Россия", "RUS", "Дальневосточный", "676805", "Амурская", "обл", "UTC+9" },
                    { 17, "", "", "Благовещенск", "г Благовещенск", "г", "Россия", "RUS", "Дальневосточный", "675000", "Амурская", "обл", "UTC+9" },
                    { 18, "Завитинский", "р-н", "Завитинск", "Амурская обл, г Завитинск", "г", "Россия", "RUS", "Дальневосточный", "676870", "Амурская", "обл", "UTC+9" },
                    { 19, "", "", "Зея", "Амурская обл, г Зея", "г", "Россия", "RUS", "Дальневосточный", "676151", "Амурская", "обл", "UTC+9" },
                    { 20, "", "", "Райчихинск", "Амурская обл, г Райчихинск", "г", "Россия", "RUS", "Дальневосточный", "676770", "Амурская", "обл", "UTC+9" },
                    { 21, "", "", "Свободный", "Амурская обл, г Свободный", "г", "Россия", "RUS", "Дальневосточный", "676450", "Амурская", "обл", "UTC+9" },
                    { 22, "Сковородинский", "р-н", "Сковородино", "Амурская обл, г Сковородино", "г", "Россия", "RUS", "Дальневосточный", "676011", "Амурская", "обл", "UTC+9" },
                    { 23, "", "", "Тында", "Амурская обл, г Тында", "г", "Россия", "RUS", "Дальневосточный", "676280", "Амурская", "обл", "UTC+9" },
                    { 24, "", "", "Циолковский", "Амурская обл, г Циолковский", "г", "Россия", "RUS", "Дальневосточный", "676470", "Амурская", "обл", "UTC+9" },
                    { 25, "", "", "Шимановск", "Амурская обл, г Шимановск", "г", "Россия", "RUS", "Дальневосточный", "676301", "Амурская", "обл", "UTC+9" },
                    { 26, "", "", "Архангельск", "г Архангельск", "г", "Россия", "RUS", "Северо-Западный", "163000", "Архангельская", "обл", "UTC+3" },
                    { 27, "Вельский", "р-н", "Вельск", "Архангельская обл, г Вельск", "г", "Россия", "RUS", "Северо-Западный", "165150", "Архангельская", "обл", "UTC+3" },
                    { 28, "Каргопольский", "р-н", "Каргополь", "Архангельская обл, г Каргополь", "г", "Россия", "RUS", "Северо-Западный", "164110", "Архангельская", "обл", "UTC+3" },
                    { 29, "", "", "Коряжма", "Архангельская обл, г Коряжма", "г", "Россия", "RUS", "Северо-Западный", "165650", "Архангельская", "обл", "UTC+3" },
                    { 30, "Котласский", "р-н", "Котлас", "Архангельская обл, г Котлас", "г", "Россия", "RUS", "Северо-Западный", "165300", "Архангельская", "обл", "UTC+3" },
                    { 31, "Мезенский", "р-н", "Мезень", "Архангельская обл, г Мезень", "г", "Россия", "RUS", "Северо-Западный", "164750", "Архангельская", "обл", "UTC+3" },
                    { 32, "", "", "Мирный", "Архангельская обл, г Мирный", "г", "Россия", "RUS", "Северо-Западный", "164170", "Архангельская", "обл", "UTC+3" },
                    { 33, "", "", "Новодвинск", "Архангельская обл, г Новодвинск", "г", "Россия", "RUS", "Северо-Западный", "164900", "Архангельская", "обл", "UTC+3" },
                    { 34, "Няндомский", "р-н", "Няндома", "Архангельская обл, г Няндома", "г", "Россия", "RUS", "Северо-Западный", "164200", "Архангельская", "обл", "UTC+3" },
                    { 35, "Онежский", "р-н", "Онега", "Архангельская обл, г Онега", "г", "Россия", "RUS", "Северо-Западный", "164840", "Архангельская", "обл", "UTC+3" },
                    { 36, "", "", "Северодвинск", "Архангельская обл, г Северодвинск", "г", "Россия", "RUS", "Северо-Западный", "164500", "Архангельская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 37, "Котласский", "р-н", "Сольвычегодск", "Архангельская обл, Котласский р-н, г Сольвычегодск", "г", "Россия", "RUS", "Северо-Западный", "165330", "Архангельская", "обл", "UTC+3" },
                    { 38, "Шенкурский", "р-н", "Шенкурск", "Архангельская обл, г Шенкурск", "г", "Россия", "RUS", "Северо-Западный", "165160", "Архангельская", "обл", "UTC+3" },
                    { 39, "", "", "Астрахань", "г Астрахань", "г", "Россия", "RUS", "Южный", "414000", "Астраханская", "обл", "UTC+4" },
                    { 40, "Ахтубинский", "р-н", "Ахтубинск", "Астраханская обл, г Ахтубинск", "г", "Россия", "RUS", "Южный", "416500", "Астраханская", "обл", "UTC+4" },
                    { 41, "", "", "Знаменск", "Астраханская обл, г Знаменск", "г", "Россия", "RUS", "Южный", "416540", "Астраханская", "обл", "UTC+4" },
                    { 42, "Камызякский", "р-н", "Камызяк", "Астраханская обл, г Камызяк", "г", "Россия", "RUS", "Южный", "416340", "Астраханская", "обл", "UTC+4" },
                    { 43, "Наримановский", "р-н", "Нариманов", "Астраханская обл, г Нариманов", "г", "Россия", "RUS", "Южный", "416111", "Астраханская", "обл", "UTC+4" },
                    { 44, "Харабалинский", "р-н", "Харабали", "Астраханская обл, г Харабали", "г", "Россия", "RUS", "Южный", "416010", "Астраханская", "обл", "UTC+4" },
                    { 45, "", "", "Агидель", "Респ Башкортостан, г Агидель", "г", "Россия", "RUS", "Приволжский", "452920", "Башкортостан", "Респ", "UTC+5" },
                    { 46, "Баймакский", "р-н", "Баймак", "Респ Башкортостан, г Баймак", "г", "Россия", "RUS", "Приволжский", "453630", "Башкортостан", "Респ", "UTC+5" },
                    { 47, "Белебеевский", "р-н", "Белебей", "Респ Башкортостан, г Белебей", "г", "Россия", "RUS", "Приволжский", "452000", "Башкортостан", "Респ", "UTC+5" },
                    { 48, "Белорецкий", "р-н", "Белорецк", "Респ Башкортостан, г Белорецк", "г", "Россия", "RUS", "Приволжский", "453500", "Башкортостан", "Респ", "UTC+5" },
                    { 49, "Бирский", "р-н", "Бирск", "Респ Башкортостан, г Бирск", "г", "Россия", "RUS", "Приволжский", "452450", "Башкортостан", "Респ", "UTC+5" },
                    { 50, "Благовещенский", "р-н", "Благовещенск", "Респ Башкортостан, г Благовещенск", "г", "Россия", "RUS", "Приволжский", "453430", "Башкортостан", "Респ", "UTC+5" },
                    { 51, "Давлекановский", "р-н", "Давлеканово", "Респ Башкортостан, г Давлеканово", "г", "Россия", "RUS", "Приволжский", "453400", "Башкортостан", "Респ", "UTC+5" },
                    { 52, "Дюртюлинский", "р-н", "Дюртюли", "Респ Башкортостан, г Дюртюли", "г", "Россия", "RUS", "Приволжский", "452320", "Башкортостан", "Респ", "UTC+5" },
                    { 53, "Ишимбайский", "р-н", "Ишимбай", "Респ Башкортостан, г Ишимбай", "г", "Россия", "RUS", "Приволжский", "453200", "Башкортостан", "Респ", "UTC+5" },
                    { 54, "", "", "Кумертау", "Респ Башкортостан, г Кумертау", "г", "Россия", "RUS", "Приволжский", "453300", "Башкортостан", "Респ", "UTC+5" },
                    { 55, "", "", "Межгорье", "Респ Башкортостан, г Межгорье", "г", "Россия", "RUS", "Приволжский", "453570", "Башкортостан", "Респ", "UTC+5" },
                    { 56, "Мелеузовский", "р-н", "Мелеуз", "Респ Башкортостан, г Мелеуз", "г", "Россия", "RUS", "Приволжский", "453853", "Башкортостан", "Респ", "UTC+5" },
                    { 57, "", "", "Нефтекамск", "Респ Башкортостан, г Нефтекамск", "г", "Россия", "RUS", "Приволжский", "452680", "Башкортостан", "Респ", "UTC+5" },
                    { 58, "", "", "Октябрьский", "Респ Башкортостан, г Октябрьский", "г", "Россия", "RUS", "Приволжский", "452601", "Башкортостан", "Респ", "UTC+5" },
                    { 59, "", "", "Салават", "Респ Башкортостан, г Салават", "г", "Россия", "RUS", "Приволжский", "453250", "Башкортостан", "Респ", "UTC+5" },
                    { 60, "", "", "Сибай", "Респ Башкортостан, г Сибай", "г", "Россия", "RUS", "Приволжский", "453830", "Башкортостан", "Респ", "UTC+5" },
                    { 61, "", "", "Стерлитамак", "Респ Башкортостан, г Стерлитамак", "г", "Россия", "RUS", "Приволжский", "453100", "Башкортостан", "Респ", "UTC+5" },
                    { 62, "Туймазинский", "р-н", "Туймазы", "Респ Башкортостан, г Туймазы", "г", "Россия", "RUS", "Приволжский", "452750", "Башкортостан", "Респ", "UTC+5" },
                    { 63, "", "", "Уфа", "г Уфа", "г", "Россия", "RUS", "Приволжский", "450000", "Башкортостан", "Респ", "UTC+5" },
                    { 64, "Учалинский", "р-н", "Учалы", "Респ Башкортостан, г Учалы", "г", "Россия", "RUS", "Приволжский", "453700", "Башкортостан", "Респ", "UTC+5" },
                    { 65, "Янаульский", "р-н", "Янаул", "Респ Башкортостан, г Янаул", "г", "Россия", "RUS", "Приволжский", "452800", "Башкортостан", "Респ", "UTC+5" },
                    { 66, "Алексеевский", "р-н", "Алексеевка", "Белгородская обл, г Алексеевка", "г", "Россия", "RUS", "Центральный", "309850", "Белгородская", "обл", "UTC+3" },
                    { 67, "", "", "Белгород", "г Белгород", "г", "Россия", "RUS", "Центральный", "308000", "Белгородская", "обл", "UTC+3" },
                    { 68, "Красногвардейский", "р-н", "Бирюч", "Белгородская обл, г Бирюч", "г", "Россия", "RUS", "Центральный", "309920", "Белгородская", "обл", "UTC+3" },
                    { 69, "Валуйский", "р-н", "Валуйки", "Белгородская обл, г Валуйки", "г", "Россия", "RUS", "Центральный", "309990", "Белгородская", "обл", "UTC+3" },
                    { 70, "Грайворонский", "р-н", "Грайворон", "Белгородская обл, г Грайворон", "г", "Россия", "RUS", "Центральный", "309370", "Белгородская", "обл", "UTC+3" },
                    { 71, "", "", "Губкин", "Белгородская обл, г Губкин", "г", "Россия", "RUS", "Центральный", "309180", "Белгородская", "обл", "UTC+3" },
                    { 72, "Корочанский", "р-н", "Короча", "Белгородская обл, г Короча", "г", "Россия", "RUS", "Центральный", "309210", "Белгородская", "обл", "UTC+3" },
                    { 73, "Новооскольский", "р-н", "Новый Оскол", "Белгородская обл, г Новый Оскол", "г", "Россия", "RUS", "Центральный", "309640", "Белгородская", "обл", "UTC+3" },
                    { 74, "", "", "Старый Оскол", "Белгородская обл, г Старый Оскол", "г", "Россия", "RUS", "Центральный", "309500", "Белгородская", "обл", "UTC+3" },
                    { 75, "Яковлевский", "р-н", "Строитель", "Белгородская обл, г Строитель", "г", "Россия", "RUS", "Центральный", "309070", "Белгородская", "обл", "UTC+3" },
                    { 76, "", "", "Шебекино", "Белгородская обл, г Шебекино", "г", "Россия", "RUS", "Центральный", "309290", "Белгородская", "обл", "UTC+3" },
                    { 77, "", "", "Брянск", "г Брянск", "г", "Россия", "RUS", "Центральный", "241000", "Брянская", "обл", "UTC+3" },
                    { 78, "Дятьковский", "р-н", "Дятьково", "Брянская обл, г Дятьково", "г", "Россия", "RUS", "Центральный", "242600", "Брянская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 79, "Жуковский", "р-н", "Жуковка", "Брянская обл, г Жуковка", "г", "Россия", "RUS", "Центральный", "242700", "Брянская", "обл", "UTC+3" },
                    { 80, "Злынковский", "р-н", "Злынка", "Брянская обл, г Злынка", "г", "Россия", "RUS", "Центральный", "243600", "Брянская", "обл", "UTC+3" },
                    { 81, "Карачевский", "р-н", "Карачев", "Брянская обл, г Карачев", "г", "Россия", "RUS", "Центральный", "242500", "Брянская", "обл", "UTC+3" },
                    { 82, "", "", "Клинцы", "Брянская обл, г Клинцы", "г", "Россия", "RUS", "Центральный", "243140", "Брянская", "обл", "UTC+3" },
                    { 83, "Мглинский", "р-н", "Мглин", "Брянская обл, г Мглин", "г", "Россия", "RUS", "Центральный", "243220", "Брянская", "обл", "UTC+3" },
                    { 84, "", "", "Новозыбков", "Брянская обл, г Новозыбков", "г", "Россия", "RUS", "Центральный", "243020", "Брянская", "обл", "UTC+3" },
                    { 85, "Почепский", "р-н", "Почеп", "Брянская обл, г Почеп", "г", "Россия", "RUS", "Центральный", "243400", "Брянская", "обл", "UTC+3" },
                    { 86, "Севский", "р-н", "Севск", "Брянская обл, г Севск", "г", "Россия", "RUS", "Центральный", "242440", "Брянская", "обл", "UTC+3" },
                    { 87, "", "", "Сельцо", "Брянская обл, г Сельцо", "г", "Россия", "RUS", "Центральный", "241550", "Брянская", "обл", "UTC+3" },
                    { 88, "", "", "Стародуб", "Брянская обл, г Стародуб", "г", "Россия", "RUS", "Центральный", "243240", "Брянская", "обл", "UTC+3" },
                    { 89, "Суражский", "р-н", "Сураж", "Брянская обл, г Сураж", "г", "Россия", "RUS", "Центральный", "243500", "Брянская", "обл", "UTC+3" },
                    { 90, "Трубчевский", "р-н", "Трубчевск", "Брянская обл, г Трубчевск", "г", "Россия", "RUS", "Центральный", "242220", "Брянская", "обл", "UTC+3" },
                    { 91, "Унечский", "р-н", "Унеча", "Брянская обл, г Унеча", "г", "Россия", "RUS", "Центральный", "243300", "Брянская", "обл", "UTC+3" },
                    { 92, "", "", "Фокино", "Брянская обл, г Фокино", "г", "Россия", "RUS", "Центральный", "242610", "Брянская", "обл", "UTC+3" },
                    { 93, "Кабанский", "р-н", "Бабушкин", "Респ Бурятия, Кабанский р-н, г Бабушкин", "г", "Россия", "RUS", "Дальневосточный", "671230", "Бурятия", "Респ", "UTC+8" },
                    { 94, "Селенгинский", "р-н", "Гусиноозерск", "Респ Бурятия, г Гусиноозерск", "г", "Россия", "RUS", "Дальневосточный", "671160", "Бурятия", "Респ", "UTC+8" },
                    { 95, "Закаменский", "р-н", "Закаменск", "Респ Бурятия, г Закаменск", "г", "Россия", "RUS", "Дальневосточный", "671950", "Бурятия", "Респ", "UTC+8" },
                    { 96, "Кяхтинский", "р-н", "Кяхта", "Респ Бурятия, г Кяхта", "г", "Россия", "RUS", "Дальневосточный", "671840", "Бурятия", "Респ", "UTC+8" },
                    { 97, "", "", "Северобайкальск", "Респ Бурятия, г Северобайкальск", "г", "Россия", "RUS", "Дальневосточный", "671700", "Бурятия", "Респ", "UTC+8" },
                    { 98, "", "", "Улан-Удэ", "г Улан-Удэ", "г", "Россия", "RUS", "Дальневосточный", "670000", "Бурятия", "Респ", "UTC+8" },
                    { 99, "Александровский", "р-н", "Александров", "Владимирская обл, г Александров", "г", "Россия", "RUS", "Центральный", "601650", "Владимирская", "обл", "UTC+3" },
                    { 100, "", "", "Владимир", "г Владимир", "г", "Россия", "RUS", "Центральный", "600000", "Владимирская", "обл", "UTC+3" },
                    { 101, "Вязниковский", "р-н", "Вязники", "Владимирская обл, г Вязники", "г", "Россия", "RUS", "Центральный", "601440", "Владимирская", "обл", "UTC+3" },
                    { 102, "Гороховецкий", "р-н", "Гороховец", "Владимирская обл, г Гороховец", "г", "Россия", "RUS", "Центральный", "601480", "Владимирская", "обл", "UTC+3" },
                    { 103, "", "", "Гусь-Хрустальный", "Владимирская обл, г Гусь-Хрустальный", "г", "Россия", "RUS", "Центральный", "601500", "Владимирская", "обл", "UTC+3" },
                    { 104, "Камешковский", "р-н", "Камешково", "Владимирская обл, г Камешково", "г", "Россия", "RUS", "Центральный", "601300", "Владимирская", "обл", "UTC+3" },
                    { 105, "Александровский", "р-н", "Карабаново", "Владимирская обл, Александровский р-н, г Карабаново", "г", "Россия", "RUS", "Центральный", "601640", "Владимирская", "обл", "UTC+3" },
                    { 106, "Киржачский", "р-н", "Киржач", "Владимирская обл, г Киржач", "г", "Россия", "RUS", "Центральный", "601010", "Владимирская", "обл", "UTC+3" },
                    { 107, "", "", "Ковров", "Владимирская обл, г Ковров", "г", "Россия", "RUS", "Центральный", "601900", "Владимирская", "обл", "UTC+3" },
                    { 108, "Кольчугинский", "р-н", "Кольчугино", "Владимирская обл, г Кольчугино", "г", "Россия", "RUS", "Центральный", "601780", "Владимирская", "обл", "UTC+3" },
                    { 109, "Петушинский", "р-н", "Костерево", "Владимирская обл, Петушинский р-н, г Костерево", "г", "Россия", "RUS", "Центральный", "601110", "Владимирская", "обл", "UTC+3" },
                    { 110, "Гусь-Хрустальный", "р-н", "Курлово", "Владимирская обл, Гусь-Хрустальный р-н, г Курлово", "г", "Россия", "RUS", "Центральный", "601570", "Владимирская", "обл", "UTC+3" },
                    { 111, "Собинский", "р-н", "Лакинск", "Владимирская обл, Собинский р-н, г Лакинск", "г", "Россия", "RUS", "Центральный", "601240", "Владимирская", "обл", "UTC+3" },
                    { 112, "Меленковский", "р-н", "Меленки", "Владимирская обл, г Меленки", "г", "Россия", "RUS", "Центральный", "602101", "Владимирская", "обл", "UTC+3" },
                    { 113, "", "", "Муром", "Владимирская обл, г Муром", "г", "Россия", "RUS", "Центральный", "602205", "Владимирская", "обл", "UTC+3" },
                    { 114, "Петушинский", "р-н", "Петушки", "Владимирская обл, г Петушки", "г", "Россия", "RUS", "Центральный", "601140", "Владимирская", "обл", "UTC+3" },
                    { 115, "Петушинский", "р-н", "Покров", "Владимирская обл, Петушинский р-н, г Покров", "г", "Россия", "RUS", "Центральный", "601120", "Владимирская", "обл", "UTC+3" },
                    { 116, "", "", "Радужный", "Владимирская обл, г Радужный", "г", "Россия", "RUS", "Центральный", "600910", "Владимирская", "обл", "UTC+3" },
                    { 117, "Собинский", "р-н", "Собинка", "Владимирская обл, г Собинка", "г", "Россия", "RUS", "Центральный", "601201", "Владимирская", "обл", "UTC+3" },
                    { 118, "Александровский", "р-н", "Струнино", "Владимирская обл, Александровский р-н, г Струнино", "г", "Россия", "RUS", "Центральный", "601670", "Владимирская", "обл", "UTC+3" },
                    { 119, "Судогодский", "р-н", "Судогда", "Владимирская обл, г Судогда", "г", "Россия", "RUS", "Центральный", "601351", "Владимирская", "обл", "UTC+3" },
                    { 120, "Суздальский", "р-н", "Суздаль", "Владимирская обл, г Суздаль", "г", "Россия", "RUS", "Центральный", "601291", "Владимирская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 121, "Юрьев-Польский", "р-н", "Юрьев-Польский", "Владимирская обл, г Юрьев-Польский", "г", "Россия", "RUS", "Центральный", "601800", "Владимирская", "обл", "UTC+3" },
                    { 122, "", "", "Волгоград", "г Волгоград", "г", "Россия", "RUS", "Южный", "400000", "Волгоградская", "обл", "UTC+3" },
                    { 123, "", "", "Волжский", "Волгоградская обл, г Волжский", "г", "Россия", "RUS", "Южный", "404100", "Волгоградская", "обл", "UTC+3" },
                    { 124, "Дубовский", "р-н", "Дубовка", "Волгоградская обл, г Дубовка", "г", "Россия", "RUS", "Южный", "404002", "Волгоградская", "обл", "UTC+3" },
                    { 125, "Жирновский", "р-н", "Жирновск", "Волгоградская обл, г Жирновск", "г", "Россия", "RUS", "Южный", "403790", "Волгоградская", "обл", "UTC+3" },
                    { 126, "Калачевский", "р-н", "Калач-на-Дону", "Волгоградская обл, г Калач-на-Дону", "г", "Россия", "RUS", "Южный", "404500", "Волгоградская", "обл", "UTC+3" },
                    { 127, "", "", "Камышин", "Волгоградская обл, г Камышин", "г", "Россия", "RUS", "Южный", "403870", "Волгоградская", "обл", "UTC+3" },
                    { 128, "Котельниковский", "р-н", "Котельниково", "Волгоградская обл, г Котельниково", "г", "Россия", "RUS", "Южный", "404350", "Волгоградская", "обл", "UTC+3" },
                    { 129, "Котовский", "р-н", "Котово", "Волгоградская обл, г Котово", "г", "Россия", "RUS", "Южный", "403801", "Волгоградская", "обл", "UTC+3" },
                    { 130, "Среднеахтубинский", "р-н", "Краснослободск", "Волгоградская обл, Среднеахтубинский р-н, г Краснослободск", "г", "Россия", "RUS", "Южный", "404160", "Волгоградская", "обл", "UTC+3" },
                    { 131, "Ленинский", "р-н", "Ленинск", "Волгоградская обл, г Ленинск", "г", "Россия", "RUS", "Южный", "404620", "Волгоградская", "обл", "UTC+3" },
                    { 132, "", "", "Михайловка", "Волгоградская обл, г Михайловка", "г", "Россия", "RUS", "Южный", "403340", "Волгоградская", "обл", "UTC+3" },
                    { 133, "Николаевский", "р-н", "Николаевск", "Волгоградская обл, г Николаевск", "г", "Россия", "RUS", "Южный", "404030", "Волгоградская", "обл", "UTC+3" },
                    { 134, "Новоаннинский", "р-н", "Новоаннинский", "Волгоградская обл, г Новоаннинский", "г", "Россия", "RUS", "Южный", "403950", "Волгоградская", "обл", "UTC+3" },
                    { 135, "Палласовский", "р-н", "Палласовка", "Волгоградская обл, г Палласовка", "г", "Россия", "RUS", "Южный", "404260", "Волгоградская", "обл", "UTC+3" },
                    { 136, "Камышинский", "р-н", "Петров Вал", "Волгоградская обл, Камышинский р-н, г Петров Вал", "г", "Россия", "RUS", "Южный", "403840", "Волгоградская", "обл", "UTC+3" },
                    { 137, "Серафимовичский", "р-н", "Серафимович", "Волгоградская обл, г Серафимович", "г", "Россия", "RUS", "Южный", "403441", "Волгоградская", "обл", "UTC+3" },
                    { 138, "Суровикинский", "р-н", "Суровикино", "Волгоградская обл, г Суровикино", "г", "Россия", "RUS", "Южный", "404410", "Волгоградская", "обл", "UTC+3" },
                    { 139, "", "", "Урюпинск", "Волгоградская обл, г Урюпинск", "г", "Россия", "RUS", "Южный", "403110", "Волгоградская", "обл", "UTC+3" },
                    { 140, "", "", "Фролово", "Волгоградская обл, г Фролово", "г", "Россия", "RUS", "Южный", "403530", "Волгоградская", "обл", "UTC+3" },
                    { 141, "Бабаевский", "р-н", "Бабаево", "Вологодская обл, г Бабаево", "г", "Россия", "RUS", "Северо-Западный", "162480", "Вологодская", "обл", "UTC+3" },
                    { 142, "Белозерский", "р-н", "Белозерск", "Вологодская обл, г Белозерск", "г", "Россия", "RUS", "Северо-Западный", "161200", "Вологодская", "обл", "UTC+3" },
                    { 143, "Великоустюгский", "р-н", "Великий Устюг", "Вологодская обл, г Великий Устюг", "г", "Россия", "RUS", "Северо-Западный", "162390", "Вологодская", "обл", "UTC+3" },
                    { 144, "", "", "Вологда", "г Вологда", "г", "Россия", "RUS", "Северо-Западный", "160000", "Вологодская", "обл", "UTC+3" },
                    { 145, "Вытегорский", "р-н", "Вытегра", "Вологодская обл, г Вытегра", "г", "Россия", "RUS", "Северо-Западный", "162900", "Вологодская", "обл", "UTC+3" },
                    { 146, "Грязовецкий", "р-н", "Грязовец", "Вологодская обл, г Грязовец", "г", "Россия", "RUS", "Северо-Западный", "162000", "Вологодская", "обл", "UTC+3" },
                    { 147, "Сокольский", "р-н", "Кадников", "Вологодская обл, Сокольский р-н, г Кадников", "г", "Россия", "RUS", "Северо-Западный", "162107", "Вологодская", "обл", "UTC+3" },
                    { 148, "Кирилловский", "р-н", "Кириллов", "Вологодская обл, г Кириллов", "г", "Россия", "RUS", "Северо-Западный", "161100", "Вологодская", "обл", "UTC+3" },
                    { 149, "Великоустюгский", "р-н", "Красавино", "Вологодская обл, Великоустюгский р-н, г Красавино", "г", "Россия", "RUS", "Северо-Западный", "162341", "Вологодская", "обл", "UTC+3" },
                    { 150, "Никольский", "р-н", "Никольск", "Вологодская обл, г Никольск", "г", "Россия", "RUS", "Северо-Западный", "161440", "Вологодская", "обл", "UTC+3" },
                    { 151, "Сокольский", "р-н", "Сокол", "Вологодская обл, г Сокол", "г", "Россия", "RUS", "Северо-Западный", "162129", "Вологодская", "обл", "UTC+3" },
                    { 152, "Тотемский", "р-н", "Тотьма", "Вологодская обл, г Тотьма", "г", "Россия", "RUS", "Северо-Западный", "161300", "Вологодская", "обл", "UTC+3" },
                    { 153, "Устюженский", "р-н", "Устюжна", "Вологодская обл, г Устюжна", "г", "Россия", "RUS", "Северо-Западный", "162840", "Вологодская", "обл", "UTC+3" },
                    { 154, "Харовский", "р-н", "Харовск", "Вологодская обл, г Харовск", "г", "Россия", "RUS", "Северо-Западный", "162250", "Вологодская", "обл", "UTC+3" },
                    { 155, "", "", "Череповец", "Вологодская обл, г Череповец", "г", "Россия", "RUS", "Северо-Западный", "162600", "Вологодская", "обл", "UTC+3" },
                    { 156, "Бобровский", "р-н", "Бобров", "Воронежская обл, г Бобров", "г", "Россия", "RUS", "Центральный", "397700", "Воронежская", "обл", "UTC+3" },
                    { 157, "Богучарский", "р-н", "Богучар", "Воронежская обл, г Богучар", "г", "Россия", "RUS", "Центральный", "396790", "Воронежская", "обл", "UTC+3" },
                    { 158, "Борисоглебский", "р-н", "Борисоглебск", "Воронежская обл, г Борисоглебск", "г", "Россия", "RUS", "Центральный", "397160", "Воронежская", "обл", "UTC+3" },
                    { 159, "Бутурлиновский", "р-н", "Бутурлиновка", "Воронежская обл, г Бутурлиновка", "г", "Россия", "RUS", "Центральный", "397500", "Воронежская", "обл", "UTC+3" },
                    { 160, "", "", "Воронеж", "г Воронеж", "г", "Россия", "RUS", "Центральный", "394000", "Воронежская", "обл", "UTC+3" },
                    { 161, "Калачеевский", "р-н", "Калач", "Воронежская обл, г Калач", "г", "Россия", "RUS", "Центральный", "397600", "Воронежская", "обл", "UTC+3" },
                    { 162, "Лискинский", "р-н", "Лиски", "Воронежская обл, г Лиски", "г", "Россия", "RUS", "Центральный", "397904", "Воронежская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 163, "", "", "Нововоронеж", "Воронежская обл, г Нововоронеж", "г", "Россия", "RUS", "Центральный", "396070", "Воронежская", "обл", "UTC+3" },
                    { 164, "Новохоперский", "р-н", "Новохоперск", "Воронежская обл, г Новохоперск", "г", "Россия", "RUS", "Центральный", "397400", "Воронежская", "обл", "UTC+3" },
                    { 165, "Острогожский", "р-н", "Острогожск", "Воронежская обл, г Острогожск", "г", "Россия", "RUS", "Центральный", "397837", "Воронежская", "обл", "UTC+3" },
                    { 166, "Павловский", "р-н", "Павловск", "Воронежская обл, г Павловск", "г", "Россия", "RUS", "Центральный", "396420", "Воронежская", "обл", "UTC+3" },
                    { 167, "Поворинский", "р-н", "Поворино", "Воронежская обл, г Поворино", "г", "Россия", "RUS", "Центральный", "397350", "Воронежская", "обл", "UTC+3" },
                    { 168, "Россошанский", "р-н", "Россошь", "Воронежская обл, г Россошь", "г", "Россия", "RUS", "Центральный", "396650", "Воронежская", "обл", "UTC+3" },
                    { 169, "Семилукский", "р-н", "Семилуки", "Воронежская обл, г Семилуки", "г", "Россия", "RUS", "Центральный", "396900", "Воронежская", "обл", "UTC+3" },
                    { 170, "Эртильский", "р-н", "Эртиль", "Воронежская обл, г Эртиль", "г", "Россия", "RUS", "Центральный", "397030", "Воронежская", "обл", "UTC+3" },
                    { 171, "", "", "Буйнакск", "Респ Дагестан, г Буйнакск", "г", "Россия", "RUS", "Северо-Кавказский", "368220", "Дагестан", "Респ", "UTC+3" },
                    { 172, "", "", "Дагестанские Огни", "Респ Дагестан, г Дагестанские Огни", "г", "Россия", "RUS", "Северо-Кавказский", "368670", "Дагестан", "Респ", "UTC+3" },
                    { 173, "", "", "Дербент", "Респ Дагестан, г Дербент", "г", "Россия", "RUS", "Северо-Кавказский", "368000", "Дагестан", "Респ", "UTC+3" },
                    { 174, "", "", "Избербаш", "Респ Дагестан, г Избербаш", "г", "Россия", "RUS", "Северо-Кавказский", "368500", "Дагестан", "Респ", "UTC+3" },
                    { 175, "", "", "Каспийск", "Респ Дагестан, г Каспийск", "г", "Россия", "RUS", "Северо-Кавказский", "368300", "Дагестан", "Респ", "UTC+3" },
                    { 176, "", "", "Кизилюрт", "Респ Дагестан, г Кизилюрт", "г", "Россия", "RUS", "Северо-Кавказский", "368120", "Дагестан", "Респ", "UTC+3" },
                    { 177, "", "", "Кизляр", "Респ Дагестан, г Кизляр", "г", "Россия", "RUS", "Северо-Кавказский", "368830", "Дагестан", "Респ", "UTC+3" },
                    { 178, "", "", "Махачкала", "г Махачкала", "г", "Россия", "RUS", "Северо-Кавказский", "367000", "Дагестан", "Респ", "UTC+3" },
                    { 179, "", "", "Хасавюрт", "Респ Дагестан, г Хасавюрт", "г", "Россия", "RUS", "Северо-Кавказский", "368000", "Дагестан", "Респ", "UTC+3" },
                    { 180, "", "", "Южно-Сухокумск", "Респ Дагестан, г Южно-Сухокумск", "г", "Россия", "RUS", "Северо-Кавказский", "368890", "Дагестан", "Респ", "UTC+3" },
                    { 181, "", "", "Биробиджан", "г Биробиджан", "г", "Россия", "RUS", "Дальневосточный", "679002", "Еврейская", "Аобл", "UTC+10" },
                    { 182, "Облученский", "р-н", "Облучье", "Еврейская Аобл, г Облучье", "г", "Россия", "RUS", "Дальневосточный", "679100", "Еврейская", "Аобл", "UTC+10" },
                    { 183, "Балейский", "р-н", "Балей", "Забайкальский край, г Балей", "г", "Россия", "RUS", "Дальневосточный", "673450", "Забайкальский", "край", "UTC+9" },
                    { 184, "Борзинский", "р-н", "Борзя", "Забайкальский край, г Борзя", "г", "Россия", "RUS", "Дальневосточный", "674600", "Забайкальский", "край", "UTC+9" },
                    { 185, "Краснокаменский", "р-н", "Краснокаменск", "Забайкальский край, г Краснокаменск", "г", "Россия", "RUS", "Дальневосточный", "674670", "Забайкальский", "край", "UTC+9" },
                    { 186, "Могочинский", "р-н", "Могоча", "Забайкальский край, г Могоча", "г", "Россия", "RUS", "Дальневосточный", "673730", "Забайкальский", "край", "UTC+9" },
                    { 187, "Нерчинский", "р-н", "Нерчинск", "Забайкальский край, г Нерчинск", "г", "Россия", "RUS", "Дальневосточный", "673400", "Забайкальский", "край", "UTC+9" },
                    { 188, "Петровск-Забайкальский", "р-н", "Петровск-Забайкальский", "Забайкальский край, г Петровск-Забайкальский", "г", "Россия", "RUS", "Дальневосточный", "673000", "Забайкальский", "край", "UTC+9" },
                    { 189, "Сретенский", "р-н", "Сретенск", "Забайкальский край, г Сретенск", "г", "Россия", "RUS", "Дальневосточный", "673500", "Забайкальский", "край", "UTC+9" },
                    { 190, "Хилокский", "р-н", "Хилок", "Забайкальский край, г Хилок", "г", "Россия", "RUS", "Дальневосточный", "673200", "Забайкальский", "край", "UTC+9" },
                    { 191, "", "", "Чита", "г Чита", "г", "Россия", "RUS", "Дальневосточный", "672000", "Забайкальский", "край", "UTC+9" },
                    { 192, "Шилкинский", "р-н", "Шилка", "Забайкальский край, г Шилка", "г", "Россия", "RUS", "Дальневосточный", "673303", "Забайкальский", "край", "UTC+9" },
                    { 193, "Вичугский", "р-н", "Вичуга", "Ивановская обл, г Вичуга", "г", "Россия", "RUS", "Центральный", "155330", "Ивановская", "обл", "UTC+3" },
                    { 194, "Гаврилово-Посадский", "р-н", "Гаврилов Посад", "Ивановская обл, г Гаврилов Посад", "г", "Россия", "RUS", "Центральный", "155000", "Ивановская", "обл", "UTC+3" },
                    { 195, "Заволжский", "р-н", "Заволжск", "Ивановская обл, г Заволжск", "г", "Россия", "RUS", "Центральный", "155410", "Ивановская", "обл", "UTC+3" },
                    { 196, "", "", "Иваново", "г Иваново", "г", "Россия", "RUS", "Центральный", "153000", "Ивановская", "обл", "UTC+3" },
                    { 197, "", "", "Кинешма", "Ивановская обл, г Кинешма", "г", "Россия", "RUS", "Центральный", "155800", "Ивановская", "обл", "UTC+3" },
                    { 198, "Комсомольский", "р-н", "Комсомольск", "Ивановская обл, г Комсомольск", "г", "Россия", "RUS", "Центральный", "155150", "Ивановская", "обл", "UTC+3" },
                    { 199, "Ивановский", "р-н", "Кохма", "Ивановская обл, г Кохма", "г", "Россия", "RUS", "Центральный", "153510", "Ивановская", "обл", "UTC+3" },
                    { 200, "Кинешемский", "р-н", "Наволоки", "Ивановская обл, Кинешемский р-н, г Наволоки", "г", "Россия", "RUS", "Центральный", "155830", "Ивановская", "обл", "UTC+3" },
                    { 201, "Приволжский", "р-н", "Плес", "Ивановская обл, Приволжский р-н, г Плес", "г", "Россия", "RUS", "Центральный", "155555", "Ивановская", "обл", "UTC+3" },
                    { 202, "Приволжский", "р-н", "Приволжск", "Ивановская обл, г Приволжск", "г", "Россия", "RUS", "Центральный", "155550", "Ивановская", "обл", "UTC+3" },
                    { 203, "Пучежский", "р-н", "Пучеж", "Ивановская обл, г Пучеж", "г", "Россия", "RUS", "Центральный", "155360", "Ивановская", "обл", "UTC+3" },
                    { 204, "Родниковский", "р-н", "Родники", "Ивановская обл, г Родники", "г", "Россия", "RUS", "Центральный", "155250", "Ивановская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 205, "Тейковский", "р-н", "Тейково", "Ивановская обл, г Тейково", "г", "Россия", "RUS", "Центральный", "155040", "Ивановская", "обл", "UTC+3" },
                    { 206, "Фурмановский", "р-н", "Фурманов", "Ивановская обл, г Фурманов", "г", "Россия", "RUS", "Центральный", "155520", "Ивановская", "обл", "UTC+3" },
                    { 207, "Шуйский", "р-н", "Шуя", "Ивановская обл, г Шуя", "г", "Россия", "RUS", "Центральный", "155900", "Ивановская", "обл", "UTC+3" },
                    { 208, "Южский", "р-н", "Южа", "Ивановская обл, г Южа", "г", "Россия", "RUS", "Центральный", "155630", "Ивановская", "обл", "UTC+3" },
                    { 209, "Юрьевецкий", "р-н", "Юрьевец", "Ивановская обл, г Юрьевец", "г", "Россия", "RUS", "Центральный", "155450", "Ивановская", "обл", "UTC+3" },
                    { 210, "", "", "Карабулак", "Респ Ингушетия, г Карабулак", "г", "Россия", "RUS", "Северо-Кавказский", "386230", "Ингушетия", "Респ", "UTC+3" },
                    { 211, "", "", "Магас", "г Магас", "г", "Россия", "RUS", "Северо-Кавказский", "386001", "Ингушетия", "Респ", "UTC+3" },
                    { 212, "", "", "Малгобек", "Респ Ингушетия, г Малгобек", "г", "Россия", "RUS", "Северо-Кавказский", "386300", "Ингушетия", "Респ", "UTC+3" },
                    { 213, "", "", "Назрань", "Респ Ингушетия, г Назрань", "г", "Россия", "RUS", "Северо-Кавказский", "386100", "Ингушетия", "Респ", "UTC+3" },
                    { 214, "", "", "Сунжа", "Респ Ингушетия, г Сунжа", "г", "Россия", "RUS", "Северо-Кавказский", "386200", "Ингушетия", "Респ", "UTC+3" },
                    { 215, "Нижнеудинский", "р-н", "Алзамай", "Иркутская обл, Нижнеудинский р-н, г Алзамай", "г", "Россия", "RUS", "Сибирский", "665160", "Иркутская", "обл", "UTC+8" },
                    { 216, "", "", "Ангарск", "Иркутская обл, г Ангарск", "г", "Россия", "RUS", "Сибирский", "665800", "Иркутская", "обл", "UTC+8" },
                    { 217, "Слюдянский", "р-н", "Байкальск", "Иркутская обл, Слюдянский р-н, г Байкальск", "г", "Россия", "RUS", "Сибирский", "665930", "Иркутская", "обл", "UTC+8" },
                    { 218, "Тайшетский", "р-н", "Бирюсинск", "Иркутская обл, Тайшетский р-н, г Бирюсинск", "г", "Россия", "RUS", "Сибирский", "665050", "Иркутская", "обл", "UTC+8" },
                    { 219, "", "", "Бодайбо", "Иркутская обл, г Бодайбо", "г", "Россия", "RUS", "Сибирский", "666901", "Иркутская", "обл", "UTC+8" },
                    { 220, "", "", "Братск", "Иркутская обл, г Братск", "г", "Россия", "RUS", "Сибирский", "665700", "Иркутская", "обл", "UTC+8" },
                    { 221, "Братский", "р-н", "Вихоревка", "Иркутская обл, Братский р-н, г Вихоревка", "г", "Россия", "RUS", "Сибирский", "665770", "Иркутская", "обл", "UTC+8" },
                    { 222, "Нижнеилимский", "р-н", "Железногорск-Илимский", "Иркутская обл, г Железногорск-Илимский", "г", "Россия", "RUS", "Сибирский", "665650", "Иркутская", "обл", "UTC+8" },
                    { 223, "", "", "Зима", "Иркутская обл, г Зима", "г", "Россия", "RUS", "Сибирский", "665382", "Иркутская", "обл", "UTC+8" },
                    { 224, "", "", "Иркутск", "г Иркутск", "г", "Россия", "RUS", "Сибирский", "664000", "Иркутская", "обл", "UTC+8" },
                    { 225, "Киренский", "р-н", "Киренск", "Иркутская обл, г Киренск", "г", "Россия", "RUS", "Сибирский", "666700", "Иркутская", "обл", "UTC+8" },
                    { 226, "", "", "Нижнеудинск", "Иркутская обл, г Нижнеудинск", "г", "Россия", "RUS", "Сибирский", "665100", "Иркутская", "обл", "UTC+8" },
                    { 227, "", "", "Саянск", "Иркутская обл, г Саянск", "г", "Россия", "RUS", "Сибирский", "666300", "Иркутская", "обл", "UTC+8" },
                    { 228, "", "", "Свирск", "Иркутская обл, г Свирск", "г", "Россия", "RUS", "Сибирский", "665420", "Иркутская", "обл", "UTC+8" },
                    { 229, "Слюдянский", "р-н", "Слюдянка", "Иркутская обл, г Слюдянка", "г", "Россия", "RUS", "Сибирский", "665902", "Иркутская", "обл", "UTC+8" },
                    { 230, "", "", "Тайшет", "Иркутская обл, г Тайшет", "г", "Россия", "RUS", "Сибирский", "665000", "Иркутская", "обл", "UTC+8" },
                    { 231, "", "", "Тулун", "Иркутская обл, г Тулун", "г", "Россия", "RUS", "Сибирский", "665250", "Иркутская", "обл", "UTC+8" },
                    { 232, "", "", "Усолье-Сибирское", "Иркутская обл, г Усолье-Сибирское", "г", "Россия", "RUS", "Сибирский", "665450", "Иркутская", "обл", "UTC+8" },
                    { 233, "", "", "Усть-Илимск", "Иркутская обл, г Усть-Илимск", "г", "Россия", "RUS", "Сибирский", "666671", "Иркутская", "обл", "UTC+8" },
                    { 234, "", "", "Усть-Кут", "Иркутская обл, г Усть-Кут", "г", "Россия", "RUS", "Сибирский", "666780", "Иркутская", "обл", "UTC+8" },
                    { 235, "", "", "Черемхово", "Иркутская обл, г Черемхово", "г", "Россия", "RUS", "Сибирский", "665400", "Иркутская", "обл", "UTC+8" },
                    { 236, "", "", "Шелехов", "Иркутская обл, г Шелехов", "г", "Россия", "RUS", "Сибирский", "666031", "Иркутская", "обл", "UTC+8" },
                    { 237, "", "", "Баксан", "Респ Кабардино-Балкарская, г Баксан", "г", "Россия", "RUS", "Северо-Кавказский", "361500", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 238, "Майский", "р-н", "Майский", "Респ Кабардино-Балкарская, г Майский", "г", "Россия", "RUS", "Северо-Кавказский", "361110", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 239, "", "", "Нальчик", "г Нальчик", "г", "Россия", "RUS", "Северо-Кавказский", "360000", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 240, "Урванский", "р-н", "Нарткала", "Респ Кабардино-Балкарская, г Нарткала", "г", "Россия", "RUS", "Северо-Кавказский", "361330", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 241, "", "", "Прохладный", "Респ Кабардино-Балкарская, г Прохладный", "г", "Россия", "RUS", "Северо-Кавказский", "361040", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 242, "Терский", "р-н", "Терек", "Респ Кабардино-Балкарская, г Терек", "г", "Россия", "RUS", "Северо-Кавказский", "361200", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 243, "Эльбрусский", "р-н", "Тырныауз", "Респ Кабардино-Балкарская, г Тырныауз", "г", "Россия", "RUS", "Северо-Кавказский", "361621", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 244, "Чегемский", "р-н", "Чегем", "Респ Кабардино-Балкарская, г Чегем", "г", "Россия", "RUS", "Северо-Кавказский", "361400", "Кабардино-Балкарская", "Респ", "UTC+3" },
                    { 245, "Багратионовский", "р-н", "Багратионовск", "Калининградская обл, г Багратионовск", "г", "Россия", "RUS", "Северо-Западный", "238420", "Калининградская", "обл", "UTC+2" },
                    { 246, "Балтийский", "р-н", "Балтийск", "Калининградская обл, г Балтийск", "г", "Россия", "RUS", "Северо-Западный", "238520", "Калининградская", "обл", "UTC+2" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 247, "Гвардейский", "р-н", "Гвардейск", "Калининградская обл, г Гвардейск", "г", "Россия", "RUS", "Северо-Западный", "238210", "Калининградская", "обл", "UTC+2" },
                    { 248, "Гурьевский", "р-н", "Гурьевск", "Калининградская обл, г Гурьевск", "г", "Россия", "RUS", "Северо-Западный", "238300", "Калининградская", "обл", "UTC+2" },
                    { 249, "Гусевский", "р-н", "Гусев", "Калининградская обл, г Гусев", "г", "Россия", "RUS", "Северо-Западный", "238050", "Калининградская", "обл", "UTC+2" },
                    { 250, "Зеленоградский", "р-н", "Зеленоградск", "Калининградская обл, г Зеленоградск", "г", "Россия", "RUS", "Северо-Западный", "238326", "Калининградская", "обл", "UTC+2" },
                    { 251, "", "", "Калининград", "г Калининград", "г", "Россия", "RUS", "Северо-Западный", "236001", "Калининградская", "обл", "UTC+2" },
                    { 252, "Краснознаменский", "р-н", "Краснознаменск", "Калининградская обл, г Краснознаменск", "г", "Россия", "RUS", "Северо-Западный", "238730", "Калининградская", "обл", "UTC+2" },
                    { 253, "", "", "Ладушкин", "Калининградская обл, г Ладушкин", "г", "Россия", "RUS", "Северо-Западный", "238460", "Калининградская", "обл", "UTC+2" },
                    { 254, "", "", "Мамоново", "Калининградская обл, г Мамоново", "г", "Россия", "RUS", "Северо-Западный", "238450", "Калининградская", "обл", "UTC+2" },
                    { 255, "Неманский", "р-н", "Неман", "Калининградская обл, г Неман", "г", "Россия", "RUS", "Северо-Западный", "238710", "Калининградская", "обл", "UTC+2" },
                    { 256, "Нестеровский", "р-н", "Нестеров", "Калининградская обл, г Нестеров", "г", "Россия", "RUS", "Северо-Западный", "238010", "Калининградская", "обл", "UTC+2" },
                    { 257, "Озерский", "р-н", "Озерск", "Калининградская обл, г Озерск", "г", "Россия", "RUS", "Северо-Западный", "238120", "Калининградская", "обл", "UTC+2" },
                    { 258, "", "", "Пионерский", "Калининградская обл, г Пионерский", "г", "Россия", "RUS", "Северо-Западный", "238590", "Калининградская", "обл", "UTC+2" },
                    { 259, "Полесский", "р-н", "Полесск", "Калининградская обл, г Полесск", "г", "Россия", "RUS", "Северо-Западный", "238630", "Калининградская", "обл", "UTC+2" },
                    { 260, "Правдинский", "р-н", "Правдинск", "Калининградская обл, г Правдинск", "г", "Россия", "RUS", "Северо-Западный", "238400", "Калининградская", "обл", "UTC+2" },
                    { 261, "Балтийский", "р-н", "Приморск", "Калининградская обл, Балтийский р-н, г Приморск", "г", "Россия", "RUS", "Северо-Западный", "238510", "Калининградская", "обл", "UTC+2" },
                    { 262, "Светлогорский", "р-н", "Светлогорск", "Калининградская обл, г Светлогорск", "г", "Россия", "RUS", "Северо-Западный", "238560", "Калининградская", "обл", "UTC+2" },
                    { 263, "", "", "Светлый", "Калининградская обл, г Светлый", "г", "Россия", "RUS", "Северо-Западный", "238340", "Калининградская", "обл", "UTC+2" },
                    { 264, "Славский", "р-н", "Славск", "Калининградская обл, г Славск", "г", "Россия", "RUS", "Северо-Западный", "238600", "Калининградская", "обл", "UTC+2" },
                    { 265, "", "", "Советск", "Калининградская обл, г Советск", "г", "Россия", "RUS", "Северо-Западный", "238750", "Калининградская", "обл", "UTC+2" },
                    { 266, "Черняховский", "р-н", "Черняховск", "Калининградская обл, г Черняховск", "г", "Россия", "RUS", "Северо-Западный", "238150", "Калининградская", "обл", "UTC+2" },
                    { 267, "Городовиковский", "р-н", "Городовиковск", "Респ Калмыкия, г Городовиковск", "г", "Россия", "RUS", "Южный", "359050", "Калмыкия", "Респ", "UTC+3" },
                    { 268, "Лаганский", "р-н", "Лагань", "Респ Калмыкия, г Лагань", "г", "Россия", "RUS", "Южный", "359220", "Калмыкия", "Респ", "UTC+3" },
                    { 269, "", "", "Элиста", "г Элиста", "г", "Россия", "RUS", "Южный", "358000", "Калмыкия", "Респ", "UTC+3" },
                    { 270, "Боровский", "р-н", "Балабаново", "Калужская обл, Боровский р-н, г Балабаново", "г", "Россия", "RUS", "Центральный", "249000", "Калужская", "обл", "UTC+3" },
                    { 271, "Жуковский", "р-н", "Белоусово", "Калужская обл, Жуковский р-н, г Белоусово", "г", "Россия", "RUS", "Центральный", "249160", "Калужская", "обл", "UTC+3" },
                    { 272, "Боровский", "р-н", "Боровск", "Калужская обл, г Боровск", "г", "Россия", "RUS", "Центральный", "249010", "Калужская", "обл", "UTC+3" },
                    { 273, "Боровский", "р-н", "Ермолино", "Калужская обл, Боровский р-н, г Ермолино", "г", "Россия", "RUS", "Центральный", "249026", "Калужская", "обл", "UTC+3" },
                    { 274, "Жиздринский", "р-н", "Жиздра", "Калужская обл, г Жиздра", "г", "Россия", "RUS", "Центральный", "249340", "Калужская", "обл", "UTC+3" },
                    { 275, "Жуковский", "р-н", "Жуков", "Калужская обл, г Жуков", "г", "Россия", "RUS", "Центральный", "249190", "Калужская", "обл", "UTC+3" },
                    { 276, "", "", "Калуга", "г Калуга", "г", "Россия", "RUS", "Центральный", "248000", "Калужская", "обл", "UTC+3" },
                    { 277, "Кировский", "р-н", "Киров", "Калужская обл, г Киров", "г", "Россия", "RUS", "Центральный", "249440", "Калужская", "обл", "UTC+3" },
                    { 278, "Козельский", "р-н", "Козельск", "Калужская обл, г Козельск", "г", "Россия", "RUS", "Центральный", "249720", "Калужская", "обл", "UTC+3" },
                    { 279, "Дзержинский", "р-н", "Кондрово", "Калужская обл, г Кондрово", "г", "Россия", "RUS", "Центральный", "249830", "Калужская", "обл", "UTC+3" },
                    { 280, "Жуковский", "р-н", "Кременки", "Калужская обл, Жуковский р-н, г Кременки", "г", "Россия", "RUS", "Центральный", "249185", "Калужская", "обл", "UTC+3" },
                    { 281, "Людиновский", "р-н", "Людиново", "Калужская обл, г Людиново", "г", "Россия", "RUS", "Центральный", "249400", "Калужская", "обл", "UTC+3" },
                    { 282, "Малоярославецкий", "р-н", "Малоярославец", "Калужская обл, г Малоярославец", "г", "Россия", "RUS", "Центральный", "249091", "Калужская", "обл", "UTC+3" },
                    { 283, "Медынский", "р-н", "Медынь", "Калужская обл, г Медынь", "г", "Россия", "RUS", "Центральный", "249950", "Калужская", "обл", "UTC+3" },
                    { 284, "Мещовский", "р-н", "Мещовск", "Калужская обл, г Мещовск", "г", "Россия", "RUS", "Центральный", "249240", "Калужская", "обл", "UTC+3" },
                    { 285, "Мосальский", "р-н", "Мосальск", "Калужская обл, г Мосальск", "г", "Россия", "RUS", "Центральный", "249930", "Калужская", "обл", "UTC+3" },
                    { 286, "", "", "Обнинск", "Калужская обл, г Обнинск", "г", "Россия", "RUS", "Центральный", "249030", "Калужская", "обл", "UTC+3" },
                    { 287, "Козельский", "р-н", "Сосенский", "Калужская обл, Козельский р-н, г Сосенский", "г", "Россия", "RUS", "Центральный", "249710", "Калужская", "обл", "UTC+3" },
                    { 288, "Спас-Деменский", "р-н", "Спас-Деменск", "Калужская обл, г Спас-Деменск", "г", "Россия", "RUS", "Центральный", "249610", "Калужская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 289, "Сухиничский", "р-н", "Сухиничи", "Калужская обл, г Сухиничи", "г", "Россия", "RUS", "Центральный", "249270", "Калужская", "обл", "UTC+3" },
                    { 290, "Тарусский", "р-н", "Таруса", "Калужская обл, Тарусский р-н, г Таруса", "г", "Россия", "RUS", "Центральный", "249100", "Калужская", "обл", "UTC+3" },
                    { 291, "Юхновский", "р-н", "Юхнов", "Калужская обл, г Юхнов", "г", "Россия", "RUS", "Центральный", "249910", "Калужская", "обл", "UTC+3" },
                    { 292, "", "", "Вилючинск", "Камчатский край, г Вилючинск", "г", "Россия", "RUS", "Дальневосточный", "684090", "Камчатский", "край", "UTC+12" },
                    { 293, "Елизовский", "р-н", "Елизово", "Камчатский край, г Елизово", "г", "Россия", "RUS", "Дальневосточный", "684000", "Камчатский", "край", "UTC+12" },
                    { 294, "", "", "Петропавловск-Камчатский", "г Петропавловск-Камчатский", "г", "Россия", "RUS", "Дальневосточный", "683000", "Камчатский", "край", "UTC+12" },
                    { 295, "", "", "Карачаевск", "Респ Карачаево-Черкесская, г Карачаевск", "г", "Россия", "RUS", "Северо-Кавказский", "369200", "Карачаево-Черкесская", "Респ", "UTC+3" },
                    { 296, "", "", "Теберда", "Респ Карачаево-Черкесская, г Теберда", "г", "Россия", "RUS", "Северо-Кавказский", "369212", "Карачаево-Черкесская", "Респ", "UTC+3" },
                    { 297, "Усть-Джегутинский", "р-н", "Усть-Джегута", "Респ Карачаево-Черкесская, г Усть-Джегута", "г", "Россия", "RUS", "Северо-Кавказский", "369300", "Карачаево-Черкесская", "Респ", "UTC+3" },
                    { 298, "", "", "Черкесск", "г Черкесск", "г", "Россия", "RUS", "Северо-Кавказский", "369000", "Карачаево-Черкесская", "Респ", "UTC+3" },
                    { 299, "Беломорский", "р-н", "Беломорск", "Респ Карелия, г Беломорск", "г", "Россия", "RUS", "Северо-Западный", "186500", "Карелия", "Респ", "UTC+3" },
                    { 300, "Кемский", "р-н", "Кемь", "Респ Карелия, Кемский р-н, г Кемь", "г", "Россия", "RUS", "Северо-Западный", "186610", "Карелия", "Респ", "UTC+3" },
                    { 301, "Кондопожский", "р-н", "Кондопога", "Респ Карелия, г Кондопога", "г", "Россия", "RUS", "Северо-Западный", "186220", "Карелия", "Респ", "UTC+3" },
                    { 302, "", "", "Костомукша", "Респ Карелия, г Костомукша", "г", "Россия", "RUS", "Северо-Западный", "186930", "Карелия", "Респ", "UTC+3" },
                    { 303, "Лахденпохский", "р-н", "Лахденпохья", "Респ Карелия, г Лахденпохья", "г", "Россия", "RUS", "Северо-Западный", "186730", "Карелия", "Респ", "UTC+3" },
                    { 304, "Медвежьегорский", "р-н", "Медвежьегорск", "Респ Карелия, г Медвежьегорск", "г", "Россия", "RUS", "Северо-Западный", "186350", "Карелия", "Респ", "UTC+3" },
                    { 305, "Олонецкий", "р-н", "Олонец", "Респ Карелия, г Олонец", "г", "Россия", "RUS", "Северо-Западный", "186000", "Карелия", "Респ", "UTC+3" },
                    { 306, "", "", "Петрозаводск", "г Петрозаводск", "г", "Россия", "RUS", "Северо-Западный", "185000", "Карелия", "Респ", "UTC+3" },
                    { 307, "Питкярантский", "р-н", "Питкяранта", "Респ Карелия, г Питкяранта", "г", "Россия", "RUS", "Северо-Западный", "186810", "Карелия", "Респ", "UTC+3" },
                    { 308, "Пудожский", "р-н", "Пудож", "Респ Карелия, г Пудож", "г", "Россия", "RUS", "Северо-Западный", "186150", "Карелия", "Респ", "UTC+3" },
                    { 309, "Сегежский", "р-н", "Сегежа", "Респ Карелия, г Сегежа", "г", "Россия", "RUS", "Северо-Западный", "186420", "Карелия", "Респ", "UTC+3" },
                    { 310, "", "", "Сортавала", "Респ Карелия, г Сортавала", "г", "Россия", "RUS", "Северо-Западный", "186790", "Карелия", "Респ", "UTC+3" },
                    { 311, "Суоярвский", "р-н", "Суоярви", "Респ Карелия, г Суоярви", "г", "Россия", "RUS", "Северо-Западный", "186870", "Карелия", "Респ", "UTC+3" },
                    { 312, "", "", "Анжеро-Судженск", "Кемеровская область - Кузбасс, г Анжеро-Судженск", "г", "Россия", "RUS", "Сибирский", "652470", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 313, "", "", "Белово", "Кемеровская область - Кузбасс, г Белово", "г", "Россия", "RUS", "Сибирский", "652600", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 314, "", "", "Березовский", "Кемеровская область - Кузбасс, г Березовский", "г", "Россия", "RUS", "Сибирский", "652420", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 315, "Гурьевский", "р-н", "Гурьевск", "Кемеровская область - Кузбасс, г Гурьевск", "г", "Россия", "RUS", "Сибирский", "652780", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 316, "", "", "Калтан", "Кемеровская область - Кузбасс, г Калтан", "г", "Россия", "RUS", "Сибирский", "652740", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 317, "", "", "Кемерово", "г Кемерово", "г", "Россия", "RUS", "Сибирский", "650000", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 318, "", "", "Киселевск", "Кемеровская область - Кузбасс, г Киселевск", "г", "Россия", "RUS", "Сибирский", "652700", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 319, "", "", "Ленинск-Кузнецкий", "Кемеровская область - Кузбасс, г Ленинск-Кузнецкий", "г", "Россия", "RUS", "Сибирский", "652500", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 320, "Мариинский", "р-н", "Мариинск", "Кемеровская область - Кузбасс, г Мариинск", "г", "Россия", "RUS", "Сибирский", "652150", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 321, "", "", "Междуреченск", "Кемеровская область - Кузбасс, г Междуреченск", "г", "Россия", "RUS", "Сибирский", "652870", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 322, "", "", "Мыски", "Кемеровская область - Кузбасс, г Мыски", "г", "Россия", "RUS", "Сибирский", "652840", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 323, "", "", "Новокузнецк", "Кемеровская область - Кузбасс, г Новокузнецк", "г", "Россия", "RUS", "Сибирский", "654000", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 324, "", "", "Осинники", "Кемеровская область - Кузбасс, г Осинники", "г", "Россия", "RUS", "Сибирский", "652800", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 325, "", "", "Полысаево", "Кемеровская область - Кузбасс, г Полысаево", "г", "Россия", "RUS", "Сибирский", "652560", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 326, "", "", "Прокопьевск", "Кемеровская область - Кузбасс, г Прокопьевск", "г", "Россия", "RUS", "Сибирский", "652701", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 327, "Гурьевский", "р-н", "Салаир", "Кемеровская область - Кузбасс, Гурьевский р-н, г Салаир", "г", "Россия", "RUS", "Сибирский", "652770", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 328, "", "", "Тайга", "Кемеровская область - Кузбасс, г Тайга", "г", "Россия", "RUS", "Сибирский", "652400", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 329, "Таштагольский", "р-н", "Таштагол", "Кемеровская область - Кузбасс, г Таштагол", "г", "Россия", "RUS", "Сибирский", "652990", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 330, "Топкинский", "р-н", "Топки", "Кемеровская область - Кузбасс, г Топки", "г", "Россия", "RUS", "Сибирский", "652300", "Кемеровская область - Кузбасс", "обл", "UTC+7" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 331, "", "", "Юрга", "Кемеровская область - Кузбасс, г Юрга", "г", "Россия", "RUS", "Сибирский", "652050", "Кемеровская область - Кузбасс", "обл", "UTC+7" },
                    { 332, "Белохолуницкий", "р-н", "Белая Холуница", "Кировская обл, г Белая Холуница", "г", "Россия", "RUS", "Приволжский", "613200", "Кировская", "обл", "UTC+3" },
                    { 333, "Вятскополянский", "р-н", "Вятские Поляны", "Кировская обл, г Вятские Поляны", "г", "Россия", "RUS", "Приволжский", "612960", "Кировская", "обл", "UTC+3" },
                    { 334, "Зуевский", "р-н", "Зуевка", "Кировская обл, г Зуевка", "г", "Россия", "RUS", "Приволжский", "612410", "Кировская", "обл", "UTC+3" },
                    { 335, "", "", "Киров", "г Киров", "г", "Россия", "RUS", "Приволжский", "610000", "Кировская", "обл", "UTC+3" },
                    { 336, "", "", "Кирово-Чепецк", "Кировская обл, г Кирово-Чепецк", "г", "Россия", "RUS", "Приволжский", "613040", "Кировская", "обл", "UTC+3" },
                    { 337, "Верхнекамский", "р-н", "Кирс", "Кировская обл, г Кирс", "г", "Россия", "RUS", "Приволжский", "612820", "Кировская", "обл", "UTC+3" },
                    { 338, "Котельничский", "р-н", "Котельнич", "Кировская обл, г Котельнич", "г", "Россия", "RUS", "Приволжский", "612600", "Кировская", "обл", "UTC+3" },
                    { 339, "Лузский", "р-н", "Луза", "Кировская обл, г Луза", "г", "Россия", "RUS", "Приволжский", "613980", "Кировская", "обл", "UTC+3" },
                    { 340, "Малмыжский", "р-н", "Малмыж", "Кировская обл, г Малмыж", "г", "Россия", "RUS", "Приволжский", "612920", "Кировская", "обл", "UTC+3" },
                    { 341, "Мурашинский", "р-н", "Мураши", "Кировская обл, г Мураши", "г", "Россия", "RUS", "Приволжский", "613710", "Кировская", "обл", "UTC+3" },
                    { 342, "Нолинский", "р-н", "Нолинск", "Кировская обл, г Нолинск", "г", "Россия", "RUS", "Приволжский", "613440", "Кировская", "обл", "UTC+3" },
                    { 343, "Омутнинский", "р-н", "Омутнинск", "Кировская обл, г Омутнинск", "г", "Россия", "RUS", "Приволжский", "612740", "Кировская", "обл", "UTC+3" },
                    { 344, "Орловский", "р-н", "Орлов", "Кировская обл, г Орлов", "г", "Россия", "RUS", "Приволжский", "612270", "Кировская", "обл", "UTC+3" },
                    { 345, "Слободской", "р-н", "Слободской", "Кировская обл, г Слободской", "г", "Россия", "RUS", "Приволжский", "613150", "Кировская", "обл", "UTC+3" },
                    { 346, "Советский", "р-н", "Советск", "Кировская обл, г Советск", "г", "Россия", "RUS", "Приволжский", "613341", "Кировская", "обл", "UTC+3" },
                    { 347, "Вятскополянский", "р-н", "Сосновка", "Кировская обл, Вятскополянский р-н, г Сосновка", "г", "Россия", "RUS", "Приволжский", "612990", "Кировская", "обл", "UTC+3" },
                    { 348, "Уржумский", "р-н", "Уржум", "Кировская обл, г Уржум", "г", "Россия", "RUS", "Приволжский", "613530", "Кировская", "обл", "UTC+3" },
                    { 349, "Яранский", "р-н", "Яранск", "Кировская обл, г Яранск", "г", "Россия", "RUS", "Приволжский", "612260", "Кировская", "обл", "UTC+3" },
                    { 350, "", "", "Воркута", "Респ Коми, г Воркута", "г", "Россия", "RUS", "Северо-Западный", "169900", "Коми", "Респ", "UTC+3" },
                    { 351, "", "", "Вуктыл", "Респ Коми, г Вуктыл", "г", "Россия", "RUS", "Северо-Западный", "169570", "Коми", "Респ", "UTC+3" },
                    { 352, "Княжпогостский", "р-н", "Емва", "Респ Коми, г Емва", "г", "Россия", "RUS", "Северо-Западный", "169200", "Коми", "Респ", "UTC+3" },
                    { 353, "", "", "Инта", "Респ Коми, г Инта", "г", "Россия", "RUS", "Северо-Западный", "169840", "Коми", "Респ", "UTC+3" },
                    { 354, "Усть-Вымский", "р-н", "Микунь", "Респ Коми, Усть-Вымский р-н, г Микунь", "г", "Россия", "RUS", "Северо-Западный", "169060", "Коми", "Респ", "UTC+3" },
                    { 355, "", "", "Печора", "Респ Коми, г Печора", "г", "Россия", "RUS", "Северо-Западный", "169600", "Коми", "Респ", "UTC+3" },
                    { 356, "", "", "Сосногорск", "Респ Коми, г Сосногорск", "г", "Россия", "RUS", "Северо-Западный", "169500", "Коми", "Респ", "UTC+3" },
                    { 357, "", "", "Сыктывкар", "г Сыктывкар", "г", "Россия", "RUS", "Северо-Западный", "167000", "Коми", "Респ", "UTC+3" },
                    { 358, "", "", "Усинск", "Респ Коми, г Усинск", "г", "Россия", "RUS", "Северо-Западный", "169710", "Коми", "Респ", "UTC+3" },
                    { 359, "", "", "Ухта", "Респ Коми, г Ухта", "г", "Россия", "RUS", "Северо-Западный", "169300", "Коми", "Респ", "UTC+3" },
                    { 360, "Буйский", "р-н", "Буй", "Костромская обл, г Буй", "г", "Россия", "RUS", "Центральный", "157000", "Костромская", "обл", "UTC+3" },
                    { 361, "", "", "Волгореченск", "Костромская обл, г Волгореченск", "г", "Россия", "RUS", "Центральный", "156901", "Костромская", "обл", "UTC+3" },
                    { 362, "Галичский", "р-н", "Галич", "Костромская обл, г Галич", "г", "Россия", "RUS", "Центральный", "157200", "Костромская", "обл", "UTC+3" },
                    { 363, "Кологривский", "р-н", "Кологрив", "Костромская обл, г Кологрив", "г", "Россия", "RUS", "Центральный", "157440", "Костромская", "обл", "UTC+3" },
                    { 364, "", "", "Кострома", "г Кострома", "г", "Россия", "RUS", "Центральный", "156000", "Костромская", "обл", "UTC+3" },
                    { 365, "Макарьевский", "р-н", "Макарьев", "Костромская обл, г Макарьев", "г", "Россия", "RUS", "Центральный", "157460", "Костромская", "обл", "UTC+3" },
                    { 366, "Мантуровский", "р-н", "Мантурово", "Костромская обл, г Мантурово", "г", "Россия", "RUS", "Центральный", "157300", "Костромская", "обл", "UTC+3" },
                    { 367, "Нерехтский", "р-н", "Нерехта", "Костромская обл, г Нерехта", "г", "Россия", "RUS", "Центральный", "157800", "Костромская", "обл", "UTC+3" },
                    { 368, "Нейский", "р-н", "Нея", "Костромская обл, г Нея", "г", "Россия", "RUS", "Центральный", "157331", "Костромская", "обл", "UTC+3" },
                    { 369, "Солигаличский", "р-н", "Солигалич", "Костромская обл, г Солигалич", "г", "Россия", "RUS", "Центральный", "157170", "Костромская", "обл", "UTC+3" },
                    { 370, "Чухломский", "р-н", "Чухлома", "Костромская обл, г Чухлома", "г", "Россия", "RUS", "Центральный", "157130", "Костромская", "обл", "UTC+3" },
                    { 371, "Шарьинский", "р-н", "Шарья", "Костромская обл, г Шарья", "г", "Россия", "RUS", "Центральный", "157500", "Костромская", "обл", "UTC+3" },
                    { 372, "Абинский", "р-н", "Абинск", "Краснодарский край, г Абинск", "г", "Россия", "RUS", "Южный", "353320", "Краснодарский", "край", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 373, "Анапский", "р-н", "Анапа", "Краснодарский край, г Анапа", "г", "Россия", "RUS", "Южный", "353440", "Краснодарский", "край", "UTC+3" },
                    { 374, "Апшеронский", "р-н", "Апшеронск", "Краснодарский край, г Апшеронск", "г", "Россия", "RUS", "Южный", "352690", "Краснодарский", "край", "UTC+3" },
                    { 375, "", "", "Армавир", "Краснодарский край, г Армавир", "г", "Россия", "RUS", "Южный", "352900", "Краснодарский", "край", "UTC+3" },
                    { 376, "Белореченский", "р-н", "Белореченск", "Краснодарский край, г Белореченск", "г", "Россия", "RUS", "Южный", "352630", "Краснодарский", "край", "UTC+3" },
                    { 377, "", "", "Геленджик", "Краснодарский край, г Геленджик", "г", "Россия", "RUS", "Южный", "353460", "Краснодарский", "край", "UTC+3" },
                    { 378, "", "", "Горячий Ключ", "Краснодарский край, г Горячий Ключ", "г", "Россия", "RUS", "Южный", "353288", "Краснодарский", "край", "UTC+3" },
                    { 379, "Гулькевичский", "р-н", "Гулькевичи", "Краснодарский край, г Гулькевичи", "г", "Россия", "RUS", "Южный", "352190", "Краснодарский", "край", "UTC+3" },
                    { 380, "Ейский", "р-н", "Ейск", "Краснодарский край, г Ейск", "г", "Россия", "RUS", "Южный", "353680", "Краснодарский", "край", "UTC+3" },
                    { 381, "Кореновский", "р-н", "Кореновск", "Краснодарский край, г Кореновск", "г", "Россия", "RUS", "Южный", "353180", "Краснодарский", "край", "UTC+3" },
                    { 382, "", "", "Краснодар", "г Краснодар", "г", "Россия", "RUS", "Южный", "350000", "Краснодарский", "край", "UTC+3" },
                    { 383, "Кавказский", "р-н", "Кропоткин", "Краснодарский край, Кавказский р-н, г Кропоткин", "г", "Россия", "RUS", "Южный", "352380", "Краснодарский", "край", "UTC+3" },
                    { 384, "Крымский", "р-н", "Крымск", "Краснодарский край, г Крымск", "г", "Россия", "RUS", "Южный", "353380", "Краснодарский", "край", "UTC+3" },
                    { 385, "Курганинский", "р-н", "Курганинск", "Краснодарский край, г Курганинск", "г", "Россия", "RUS", "Южный", "352430", "Краснодарский", "край", "UTC+3" },
                    { 386, "Лабинский", "р-н", "Лабинск", "Краснодарский край, г Лабинск", "г", "Россия", "RUS", "Южный", "352500", "Краснодарский", "край", "UTC+3" },
                    { 387, "Новокубанский", "р-н", "Новокубанск", "Краснодарский край, г Новокубанск", "г", "Россия", "RUS", "Южный", "352240", "Краснодарский", "край", "UTC+3" },
                    { 388, "", "", "Новороссийск", "Краснодарский край, г Новороссийск", "г", "Россия", "RUS", "Южный", "353900", "Краснодарский", "край", "UTC+3" },
                    { 389, "Приморско-Ахтарский", "р-н", "Приморско-Ахтарск", "Краснодарский край, г Приморско-Ахтарск", "г", "Россия", "RUS", "Южный", "353860", "Краснодарский", "край", "UTC+3" },
                    { 390, "Славянский", "р-н", "Славянск-на-Кубани", "Краснодарский край, г Славянск-на-Кубани", "г", "Россия", "RUS", "Южный", "353560", "Краснодарский", "край", "UTC+3" },
                    { 391, "", "", "Сочи", "Краснодарский край, г Сочи", "г", "Россия", "RUS", "Южный", "354000", "Краснодарский", "край", "UTC+3" },
                    { 392, "Темрюкский", "р-н", "Темрюк", "Краснодарский край, г Темрюк", "г", "Россия", "RUS", "Южный", "353500", "Краснодарский", "край", "UTC+3" },
                    { 393, "Тимашевский", "р-н", "Тимашевск", "Краснодарский край, г Тимашевск", "г", "Россия", "RUS", "Южный", "352700", "Краснодарский", "край", "UTC+3" },
                    { 394, "Тихорецкий", "р-н", "Тихорецк", "Краснодарский край, г Тихорецк", "г", "Россия", "RUS", "Южный", "352120", "Краснодарский", "край", "UTC+3" },
                    { 395, "Туапсинский", "р-н", "Туапсе", "Краснодарский край, г Туапсе", "г", "Россия", "RUS", "Южный", "352800", "Краснодарский", "край", "UTC+3" },
                    { 396, "Усть-Лабинский", "р-н", "Усть-Лабинск", "Краснодарский край, г Усть-Лабинск", "г", "Россия", "RUS", "Южный", "352330", "Краснодарский", "край", "UTC+3" },
                    { 397, "Апшеронский", "р-н", "Хадыженск", "Краснодарский край, Апшеронский р-н, г Хадыженск", "г", "Россия", "RUS", "Южный", "352680", "Краснодарский", "край", "UTC+3" },
                    { 398, "Курагинский", "р-н", "Артемовск", "Красноярский край, Курагинский р-н, г Артемовск", "г", "Россия", "RUS", "Сибирский", "662951", "Красноярский", "край", "UTC+7" },
                    { 399, "", "", "Ачинск", "Красноярский край, г Ачинск", "г", "Россия", "RUS", "Сибирский", "662150", "Красноярский", "край", "UTC+7" },
                    { 400, "", "", "Боготол", "Красноярский край, г Боготол", "г", "Россия", "RUS", "Сибирский", "662060", "Красноярский", "край", "UTC+7" },
                    { 401, "", "", "Бородино", "Красноярский край, г Бородино", "г", "Россия", "RUS", "Сибирский", "663980", "Красноярский", "край", "UTC+7" },
                    { 402, "", "", "Дивногорск", "Красноярский край, г Дивногорск", "г", "Россия", "RUS", "Сибирский", "663081", "Красноярский", "край", "UTC+7" },
                    { 403, "Таймырский Долгано-Ненецкий", "р-н", "Дудинка", "Красноярский край, г Дудинка", "г", "Россия", "RUS", "Сибирский", "647000", "Красноярский", "край", "UTC+7" },
                    { 404, "", "", "Енисейск", "Красноярский край, г Енисейск", "г", "Россия", "RUS", "Сибирский", "663150", "Красноярский", "край", "UTC+7" },
                    { 405, "", "", "Железногорск", "Красноярский край, г Железногорск", "г", "Россия", "RUS", "Сибирский", "662970", "Красноярский", "край", "UTC+7" },
                    { 406, "Рыбинский", "р-н", "Заозерный", "Красноярский край, Рыбинский р-н, г Заозерный", "г", "Россия", "RUS", "Сибирский", "663960", "Красноярский", "край", "UTC+7" },
                    { 407, "", "", "Зеленогорск", "Красноярский край, г Зеленогорск", "г", "Россия", "RUS", "Сибирский", "663690", "Красноярский", "край", "UTC+7" },
                    { 408, "Туруханский", "р-н", "Игарка", "Красноярский край, Туруханский р-н, г Игарка", "г", "Россия", "RUS", "Сибирский", "663200", "Красноярский", "край", "UTC+7" },
                    { 409, "Иланский", "р-н", "Иланский", "Красноярский край, г Иланский", "г", "Россия", "RUS", "Сибирский", "663800", "Красноярский", "край", "UTC+7" },
                    { 410, "", "", "Канск", "Красноярский край, г Канск", "г", "Россия", "RUS", "Сибирский", "663600", "Красноярский", "край", "UTC+7" },
                    { 411, "Кежемский", "р-н", "Кодинск", "Красноярский край, г Кодинск", "г", "Россия", "RUS", "Сибирский", "663491", "Красноярский", "край", "UTC+7" },
                    { 412, "", "", "Красноярск", "г Красноярск", "г", "Россия", "RUS", "Сибирский", "660000", "Красноярский", "край", "UTC+7" },
                    { 413, "", "", "Лесосибирск", "Красноярский край, г Лесосибирск", "г", "Россия", "RUS", "Сибирский", "662541", "Красноярский", "край", "UTC+7" },
                    { 414, "", "", "Минусинск", "Красноярский край, г Минусинск", "г", "Россия", "RUS", "Сибирский", "662600", "Красноярский", "край", "UTC+7" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 415, "", "", "Назарово", "Красноярский край, г Назарово", "г", "Россия", "RUS", "Сибирский", "662200", "Красноярский", "край", "UTC+7" },
                    { 416, "", "", "Норильск", "Красноярский край, г Норильск", "г", "Россия", "RUS", "Сибирский", "663300", "Красноярский", "край", "UTC+7" },
                    { 417, "", "", "Сосновоборск", "Красноярский край, г Сосновоборск", "г", "Россия", "RUS", "Сибирский", "662500", "Красноярский", "край", "UTC+7" },
                    { 418, "Ужурский", "р-н", "Ужур", "Красноярский край, г Ужур", "г", "Россия", "RUS", "Сибирский", "662251", "Красноярский", "край", "UTC+7" },
                    { 419, "Уярский", "р-н", "Уяр", "Красноярский край, г Уяр", "г", "Россия", "RUS", "Сибирский", "663920", "Красноярский", "край", "UTC+7" },
                    { 420, "", "", "Шарыпово", "Красноярский край, г Шарыпово", "г", "Россия", "RUS", "Сибирский", "662310", "Красноярский", "край", "UTC+7" },
                    { 421, "", "", "Ялта", "Респ Крым, г Ялта, г Алупка", "г", "Россия", "RUS", "Южный", "298676", "Крым", "Респ", "UTC+3" },
                    { 422, "", "", "Алушта", "Респ Крым, г Алушта", "г", "Россия", "RUS", "Южный", "298500", "Крым", "Респ", "UTC+3" },
                    { 423, "", "", "Армянск", "Респ Крым, г Армянск", "г", "Россия", "RUS", "Южный", "296012", "Крым", "Респ", "UTC+3" },
                    { 424, "Бахчисарайский", "р-н", "Бахчисарай", "Респ Крым, Бахчисарайский р-н, г Бахчисарай", "г", "Россия", "RUS", "Южный", "298400", "Крым", "Респ", "UTC+3" },
                    { 425, "Белогорский", "р-н", "Белогорск", "Респ Крым, Белогорский р-н, г Белогорск", "г", "Россия", "RUS", "Южный", "297600", "Крым", "Респ", "UTC+3" },
                    { 426, "", "", "Джанкой", "Респ Крым, г Джанкой", "г", "Россия", "RUS", "Южный", "296100", "Крым", "Респ", "UTC+3" },
                    { 427, "", "", "Евпатория", "Респ Крым, г Евпатория", "г", "Россия", "RUS", "Южный", "297402", "Крым", "Респ", "UTC+3" },
                    { 428, "", "", "Керчь", "Респ Крым, г Керчь", "г", "Россия", "RUS", "Южный", "298300", "Крым", "Респ", "UTC+3" },
                    { 429, "", "", "Красноперекопск", "Респ Крым, г Красноперекопск", "г", "Россия", "RUS", "Южный", "296000", "Крым", "Респ", "UTC+3" },
                    { 430, "", "", "Саки", "Респ Крым, г Саки", "г", "Россия", "RUS", "Южный", "296500", "Крым", "Респ", "UTC+3" },
                    { 431, "", "", "Симферополь", "Респ Крым, г Симферополь", "г", "Россия", "RUS", "Южный", "295000", "Крым", "Респ", "UTC+3" },
                    { 432, "Кировский", "р-н", "Старый Крым", "Респ Крым, Кировский р-н, г Старый Крым", "г", "Россия", "RUS", "Южный", "297345", "Крым", "Респ", "UTC+3" },
                    { 433, "", "", "Судак", "Респ Крым, г Судак", "г", "Россия", "RUS", "Южный", "298000", "Крым", "Респ", "UTC+3" },
                    { 434, "", "", "Феодосия", "Респ Крым, г Феодосия", "г", "Россия", "RUS", "Южный", "298100", "Крым", "Респ", "UTC+3" },
                    { 435, "Ленинский", "р-н", "Щелкино", "Респ Крым, Ленинский р-н, г Щелкино", "г", "Россия", "RUS", "Южный", "298213", "Крым", "Респ", "UTC+3" },
                    { 436, "", "", "Ялта", "Респ Крым, г Ялта", "г", "Россия", "RUS", "Южный", "298600", "Крым", "Респ", "UTC+3" },
                    { 437, "Далматовский", "р-н", "Далматово", "Курганская обл, г Далматово", "г", "Россия", "RUS", "Уральский", "641730", "Курганская", "обл", "UTC+5" },
                    { 438, "Катайский", "р-н", "Катайск", "Курганская обл, г Катайск", "г", "Россия", "RUS", "Уральский", "641700", "Курганская", "обл", "UTC+5" },
                    { 439, "", "", "Курган", "г Курган", "г", "Россия", "RUS", "Уральский", "640002", "Курганская", "обл", "UTC+5" },
                    { 440, "Куртамышский", "р-н", "Куртамыш", "Курганская обл, г Куртамыш", "г", "Россия", "RUS", "Уральский", "641430", "Курганская", "обл", "UTC+5" },
                    { 441, "Макушинский", "р-н", "Макушино", "Курганская обл, г Макушино", "г", "Россия", "RUS", "Уральский", "641600", "Курганская", "обл", "UTC+5" },
                    { 442, "Петуховский", "р-н", "Петухово", "Курганская обл, г Петухово", "г", "Россия", "RUS", "Уральский", "641640", "Курганская", "обл", "UTC+5" },
                    { 443, "", "", "Шадринск", "Курганская обл, г Шадринск", "г", "Россия", "RUS", "Уральский", "641870", "Курганская", "обл", "UTC+5" },
                    { 444, "Шумихинский", "р-н", "Шумиха", "Курганская обл, г Шумиха", "г", "Россия", "RUS", "Уральский", "641100", "Курганская", "обл", "UTC+5" },
                    { 445, "Щучанский", "р-н", "Щучье", "Курганская обл, г Щучье", "г", "Россия", "RUS", "Уральский", "641010", "Курганская", "обл", "UTC+5" },
                    { 446, "Дмитриевский", "р-н", "Дмитриев", "Курская обл, Дмитриевский р-н, г Дмитриев", "г", "Россия", "RUS", "Центральный", "307500", "Курская", "обл", "UTC+3" },
                    { 447, "", "", "Железногорск", "Курская обл, г Железногорск", "г", "Россия", "RUS", "Центральный", "307170", "Курская", "обл", "UTC+3" },
                    { 448, "", "", "Курск", "г Курск", "г", "Россия", "RUS", "Центральный", "305000", "Курская", "обл", "UTC+3" },
                    { 449, "", "", "Курчатов", "Курская обл, г Курчатов", "г", "Россия", "RUS", "Центральный", "307250", "Курская", "обл", "UTC+3" },
                    { 450, "", "", "Льгов", "Курская обл, г Льгов", "г", "Россия", "RUS", "Центральный", "307750", "Курская", "обл", "UTC+3" },
                    { 451, "Обоянский", "р-н", "Обоянь", "Курская обл, г Обоянь", "г", "Россия", "RUS", "Центральный", "306230", "Курская", "обл", "UTC+3" },
                    { 452, "Рыльский", "р-н", "Рыльск", "Курская обл, г Рыльск", "г", "Россия", "RUS", "Центральный", "307370", "Курская", "обл", "UTC+3" },
                    { 453, "Суджанский", "р-н", "Суджа", "Курская обл, г Суджа", "г", "Россия", "RUS", "Центральный", "307800", "Курская", "обл", "UTC+3" },
                    { 454, "Фатежский", "р-н", "Фатеж", "Курская обл, г Фатеж", "г", "Россия", "RUS", "Центральный", "307100", "Курская", "обл", "UTC+3" },
                    { 455, "", "", "Щигры", "Курская обл, г Щигры", "г", "Россия", "RUS", "Центральный", "306509", "Курская", "обл", "UTC+3" },
                    { 456, "Бокситогорский", "р-н", "Бокситогорск", "Ленинградская обл, г Бокситогорск", "г", "Россия", "RUS", "Северо-Западный", "187650", "Ленинградская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 457, "Волосовский", "р-н", "Волосово", "Ленинградская обл, г Волосово", "г", "Россия", "RUS", "Северо-Западный", "188410", "Ленинградская", "обл", "UTC+3" },
                    { 458, "Волховский", "р-н", "Волхов", "Ленинградская обл, г Волхов", "г", "Россия", "RUS", "Северо-Западный", "187401", "Ленинградская", "обл", "UTC+3" },
                    { 459, "Всеволожский", "р-н", "Всеволожск", "Ленинградская обл, г Всеволожск", "г", "Россия", "RUS", "Северо-Западный", "188640", "Ленинградская", "обл", "UTC+3" },
                    { 460, "Выборгский", "р-н", "Выборг", "Ленинградская обл, г Выборг", "г", "Россия", "RUS", "Северо-Западный", "188800", "Ленинградская", "обл", "UTC+3" },
                    { 461, "Выборгский", "р-н", "Высоцк", "Ленинградская обл, Выборгский р-н, г Высоцк", "г", "Россия", "RUS", "Северо-Западный", "188909", "Ленинградская", "обл", "UTC+3" },
                    { 462, "Гатчинский", "р-н", "Гатчина", "Ленинградская обл, г Гатчина", "г", "Россия", "RUS", "Северо-Западный", "188300", "Ленинградская", "обл", "UTC+3" },
                    { 463, "Кингисеппский", "р-н", "Ивангород", "Ленинградская обл, Кингисеппский р-н, г Ивангород", "г", "Россия", "RUS", "Северо-Западный", "188490", "Ленинградская", "обл", "UTC+3" },
                    { 464, "Выборгский", "р-н", "Каменногорск", "Ленинградская обл, Выборгский р-н, г Каменногорск", "г", "Россия", "RUS", "Северо-Западный", "188950", "Ленинградская", "обл", "UTC+3" },
                    { 465, "Кингисеппский", "р-н", "Кингисепп", "Ленинградская обл, г Кингисепп", "г", "Россия", "RUS", "Северо-Западный", "188455", "Ленинградская", "обл", "UTC+3" },
                    { 466, "Киришский", "р-н", "Кириши", "Ленинградская обл, г Кириши", "г", "Россия", "RUS", "Северо-Западный", "187110", "Ленинградская", "обл", "UTC+3" },
                    { 467, "Кировский", "р-н", "Кировск", "Ленинградская обл, г Кировск", "г", "Россия", "RUS", "Северо-Западный", "187340", "Ленинградская", "обл", "UTC+3" },
                    { 468, "Гатчинский", "р-н", "Коммунар", "Ленинградская обл, Гатчинский р-н, г Коммунар", "г", "Россия", "RUS", "Северо-Западный", "188320", "Ленинградская", "обл", "UTC+3" },
                    { 469, "Всеволожский", "р-н", "Кудрово", "Ленинградская обл, Всеволожский р-н, г Кудрово", "г", "Россия", "RUS", "Северо-Западный", "188691", "Ленинградская", "обл", "UTC+3" },
                    { 470, "Лодейнопольский", "р-н", "Лодейное Поле", "Ленинградская обл, г Лодейное Поле", "г", "Россия", "RUS", "Северо-Западный", "187700", "Ленинградская", "обл", "UTC+3" },
                    { 471, "Лужский", "р-н", "Луга", "Ленинградская обл, г Луга", "г", "Россия", "RUS", "Северо-Западный", "188230", "Ленинградская", "обл", "UTC+3" },
                    { 472, "Тосненский", "р-н", "Любань", "Ленинградская обл, Тосненский р-н, г Любань", "г", "Россия", "RUS", "Северо-Западный", "187050", "Ленинградская", "обл", "UTC+3" },
                    { 473, "Всеволожский", "р-н", "Мурино", "Ленинградская обл, Всеволожский р-н, г Мурино", "г", "Россия", "RUS", "Северо-Западный", "188662", "Ленинградская", "обл", "UTC+3" },
                    { 474, "Тосненский", "р-н", "Никольское", "Ленинградская обл, Тосненский р-н, г Никольское", "г", "Россия", "RUS", "Северо-Западный", "187026", "Ленинградская", "обл", "UTC+3" },
                    { 475, "Волховский", "р-н", "Новая Ладога", "Ленинградская обл, Волховский р-н, г Новая Ладога", "г", "Россия", "RUS", "Северо-Западный", "187450", "Ленинградская", "обл", "UTC+3" },
                    { 476, "Кировский", "р-н", "Отрадное", "Ленинградская обл, Кировский р-н, г Отрадное", "г", "Россия", "RUS", "Северо-Западный", "187330", "Ленинградская", "обл", "UTC+3" },
                    { 477, "Бокситогорский", "р-н", "Пикалево", "Ленинградская обл, Бокситогорский р-н, г Пикалево", "г", "Россия", "RUS", "Северо-Западный", "187600", "Ленинградская", "обл", "UTC+3" },
                    { 478, "Подпорожский", "р-н", "Подпорожье", "Ленинградская обл, г Подпорожье", "г", "Россия", "RUS", "Северо-Западный", "187780", "Ленинградская", "обл", "UTC+3" },
                    { 479, "Выборгский", "р-н", "Приморск", "Ленинградская обл, Выборгский р-н, г Приморск", "г", "Россия", "RUS", "Северо-Западный", "188910", "Ленинградская", "обл", "UTC+3" },
                    { 480, "Приозерский", "р-н", "Приозерск", "Ленинградская обл, г Приозерск", "г", "Россия", "RUS", "Северо-Западный", "188760", "Ленинградская", "обл", "UTC+3" },
                    { 481, "Выборгский", "р-н", "Светогорск", "Ленинградская обл, Выборгский р-н, г Светогорск", "г", "Россия", "RUS", "Северо-Западный", "188990", "Ленинградская", "обл", "UTC+3" },
                    { 482, "Всеволожский", "р-н", "Сертолово", "Ленинградская обл, Всеволожский р-н, г Сертолово", "г", "Россия", "RUS", "Северо-Западный", "188650", "Ленинградская", "обл", "UTC+3" },
                    { 483, "Сланцевский", "р-н", "Сланцы", "Ленинградская обл, г Сланцы", "г", "Россия", "RUS", "Северо-Западный", "188560", "Ленинградская", "обл", "UTC+3" },
                    { 484, "", "", "Сосновый Бор", "Ленинградская обл, г Сосновый Бор", "г", "Россия", "RUS", "Северо-Западный", "188540", "Ленинградская", "обл", "UTC+3" },
                    { 485, "Волховский", "р-н", "Сясьстрой", "Ленинградская обл, Волховский р-н, г Сясьстрой", "г", "Россия", "RUS", "Северо-Западный", "187420", "Ленинградская", "обл", "UTC+3" },
                    { 486, "Тихвинский", "р-н", "Тихвин", "Ленинградская обл, г Тихвин", "г", "Россия", "RUS", "Северо-Западный", "187550", "Ленинградская", "обл", "UTC+3" },
                    { 487, "Тосненский", "р-н", "Тосно", "Ленинградская обл, г Тосно", "г", "Россия", "RUS", "Северо-Западный", "187000", "Ленинградская", "обл", "UTC+3" },
                    { 488, "Кировский", "р-н", "Шлиссельбург", "Ленинградская обл, Кировский р-н, г Шлиссельбург", "г", "Россия", "RUS", "Северо-Западный", "187320", "Ленинградская", "обл", "UTC+3" },
                    { 489, "Грязинский", "р-н", "Грязи", "Липецкая обл, г Грязи", "г", "Россия", "RUS", "Центральный", "399050", "Липецкая", "обл", "UTC+3" },
                    { 490, "Данковский", "р-н", "Данков", "Липецкая обл, г Данков", "г", "Россия", "RUS", "Центральный", "399850", "Липецкая", "обл", "UTC+3" },
                    { 491, "", "", "Елец", "Липецкая обл, г Елец", "г", "Россия", "RUS", "Центральный", "399770", "Липецкая", "обл", "UTC+3" },
                    { 492, "Задонский", "р-н", "Задонск", "Липецкая обл, г Задонск", "г", "Россия", "RUS", "Центральный", "399200", "Липецкая", "обл", "UTC+3" },
                    { 493, "Лебедянский", "р-н", "Лебедянь", "Липецкая обл, г Лебедянь", "г", "Россия", "RUS", "Центральный", "399610", "Липецкая", "обл", "UTC+3" },
                    { 494, "", "", "Липецк", "г Липецк", "г", "Россия", "RUS", "Центральный", "398000", "Липецкая", "обл", "UTC+3" },
                    { 495, "Усманский", "р-н", "Усмань", "Липецкая обл, г Усмань", "г", "Россия", "RUS", "Центральный", "399341", "Липецкая", "обл", "UTC+3" },
                    { 496, "Чаплыгинский", "р-н", "Чаплыгин", "Липецкая обл, г Чаплыгин", "г", "Россия", "RUS", "Центральный", "399900", "Липецкая", "обл", "UTC+3" },
                    { 497, "", "", "Магадан", "г Магадан", "г", "Россия", "RUS", "Дальневосточный", "685000", "Магаданская", "обл", "UTC+11" },
                    { 498, "Сусуманский", "р-н", "Сусуман", "Магаданская обл, г Сусуман", "г", "Россия", "RUS", "Дальневосточный", "686314", "Магаданская", "обл", "UTC+11" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 499, "", "", "Волжск", "Респ Марий Эл, г Волжск", "г", "Россия", "RUS", "Приволжский", "425000", "Марий Эл", "Респ", "UTC+3" },
                    { 500, "Звениговский", "р-н", "Звенигово", "Респ Марий Эл, г Звенигово", "г", "Россия", "RUS", "Приволжский", "425060", "Марий Эл", "Респ", "UTC+3" },
                    { 501, "", "", "Йошкар-Ола", "г Йошкар-Ола", "г", "Россия", "RUS", "Приволжский", "424000", "Марий Эл", "Респ", "UTC+3" },
                    { 502, "", "", "Козьмодемьянск", "Респ Марий Эл, г Козьмодемьянск", "г", "Россия", "RUS", "Приволжский", "425350", "Марий Эл", "Респ", "UTC+3" },
                    { 503, "Ардатовский", "р-н", "Ардатов", "Респ Мордовия, г Ардатов", "г", "Россия", "RUS", "Приволжский", "431850", "Мордовия", "Респ", "UTC+3" },
                    { 504, "Инсарский", "р-н", "Инсар", "Респ Мордовия, г Инсар", "г", "Россия", "RUS", "Приволжский", "431430", "Мордовия", "Респ", "UTC+3" },
                    { 505, "", "", "Ковылкино", "Респ Мордовия, г Ковылкино", "г", "Россия", "RUS", "Приволжский", "431350", "Мордовия", "Респ", "UTC+3" },
                    { 506, "Краснослободский", "р-н", "Краснослободск", "Респ Мордовия, г Краснослободск", "г", "Россия", "RUS", "Приволжский", "431260", "Мордовия", "Респ", "UTC+3" },
                    { 507, "", "", "Рузаевка", "Респ Мордовия, г Рузаевка", "г", "Россия", "RUS", "Приволжский", "431440", "Мордовия", "Респ", "UTC+3" },
                    { 508, "", "", "Саранск", "г Саранск", "г", "Россия", "RUS", "Приволжский", "430000", "Мордовия", "Респ", "UTC+3" },
                    { 509, "Темниковский", "р-н", "Темников", "Респ Мордовия, г Темников", "г", "Россия", "RUS", "Приволжский", "431220", "Мордовия", "Респ", "UTC+3" },
                    { 510, "", "", "Москва", "г Москва", "", "Россия", "RUS", "Центральный", "101000", "Москва", "г", "UTC+3" },
                    { 511, "Наро-Фоминск", "г", "Апрелевка", "Московская обл, г Наро-Фоминск, г Апрелевка", "г", "Россия", "RUS", "Центральный", "143360", "Московская", "обл", "UTC+3" },
                    { 512, "", "", "Балашиха", "Московская обл, г Балашиха", "г", "Россия", "RUS", "Центральный", "143900", "Московская", "обл", "UTC+3" },
                    { 513, "Воскресенск", "г", "Белоозёрский", "Московская обл, г Воскресенск, г Белоозёрский", "г", "Россия", "RUS", "Центральный", "140250", "Московская", "обл", "UTC+3" },
                    { 514, "", "", "Бронницы", "Московская обл, г Бронницы", "г", "Россия", "RUS", "Центральный", "140170", "Московская", "обл", "UTC+3" },
                    { 515, "Наро-Фоминск", "г", "Верея", "Московская обл, г Наро-Фоминск, г Верея", "г", "Россия", "RUS", "Центральный", "143330", "Московская", "обл", "UTC+3" },
                    { 516, "", "", "Видное", "Московская обл, г Видное", "г", "Россия", "RUS", "Центральный", "142700", "Московская", "обл", "UTC+3" },
                    { 517, "", "", "Волоколамск", "Московская обл, г Волоколамск", "г", "Россия", "RUS", "Центральный", "143600", "Московская", "обл", "UTC+3" },
                    { 518, "Воскресенск", "г", "Воскресенск", "Московская обл, г Воскресенск", "", "Россия", "RUS", "Центральный", "140200", "Московская", "обл", "UTC+3" },
                    { 519, "Клин", "г", "Высоковск", "Московская обл, г Клин, г Высоковск", "г", "Россия", "RUS", "Центральный", "141650", "Московская", "обл", "UTC+3" },
                    { 520, "Одинцово", "г", "Голицыно", "Московская обл, г Одинцово, г Голицыно", "г", "Россия", "RUS", "Центральный", "143040", "Московская", "обл", "UTC+3" },
                    { 521, "Истра", "г", "Дедовск", "Московская обл, г Истра, г Дедовск", "г", "Россия", "RUS", "Центральный", "143530", "Московская", "обл", "UTC+3" },
                    { 522, "", "", "Дзержинский", "Московская обл, г Дзержинский", "г", "Россия", "RUS", "Центральный", "140090", "Московская", "обл", "UTC+3" },
                    { 523, "Дмитров", "г", "Дмитров", "Московская обл, г Дмитров", "", "Россия", "RUS", "Центральный", "141800", "Московская", "обл", "UTC+3" },
                    { 524, "", "", "Долгопрудный", "Московская обл, г Долгопрудный", "г", "Россия", "RUS", "Центральный", "141700", "Московская", "обл", "UTC+3" },
                    { 525, "", "", "Домодедово", "Московская обл, г Домодедово", "г", "Россия", "RUS", "Центральный", "142000", "Московская", "обл", "UTC+3" },
                    { 526, "Орехово-Зуево", "г", "Дрезна", "Московская обл, г Орехово-Зуево, г Дрезна", "г", "Россия", "RUS", "Центральный", "142660", "Московская", "обл", "UTC+3" },
                    { 527, "", "", "Дубна", "Московская обл, г Дубна", "г", "Россия", "RUS", "Центральный", "141980", "Московская", "обл", "UTC+3" },
                    { 528, "", "", "Егорьевск", "Московская обл, г Егорьевск", "г", "Россия", "RUS", "Центральный", "140300", "Московская", "обл", "UTC+3" },
                    { 529, "", "", "Жуковский", "Московская обл, г Жуковский", "г", "Россия", "RUS", "Центральный", "140180", "Московская", "обл", "UTC+3" },
                    { 530, "", "", "Зарайск", "Московская обл, г Зарайск", "г", "Россия", "RUS", "Центральный", "140600", "Московская", "обл", "UTC+3" },
                    { 531, "Одинцово", "г", "Звенигород", "Московская обл, г Одинцово, г Звенигород", "г", "Россия", "RUS", "Центральный", "143180", "Московская", "обл", "UTC+3" },
                    { 532, "", "", "Ивантеевка", "Московская обл, г Ивантеевка", "г", "Россия", "RUS", "Центральный", "141280", "Московская", "обл", "UTC+3" },
                    { 533, "Истра", "г", "Истра", "Московская обл, г Истра", "", "Россия", "RUS", "Центральный", "143500", "Московская", "обл", "UTC+3" },
                    { 534, "", "", "Кашира", "Московская обл, г Кашира", "г", "Россия", "RUS", "Центральный", "142900", "Московская", "обл", "UTC+3" },
                    { 535, "Клин", "г", "Клин", "Московская обл, г Клин", "", "Россия", "RUS", "Центральный", "141601", "Московская", "обл", "UTC+3" },
                    { 536, "", "", "Коломна", "Московская обл, г Коломна", "г", "Россия", "RUS", "Центральный", "140400", "Московская", "обл", "UTC+3" },
                    { 537, "", "", "Королёв", "Московская обл, г Королёв", "г", "Россия", "RUS", "Центральный", "141060", "Московская", "обл", "UTC+3" },
                    { 538, "", "", "Котельники", "Московская обл, г Котельники", "г", "Россия", "RUS", "Центральный", "140053", "Московская", "обл", "UTC+3" },
                    { 539, "", "", "Красноармейск", "Московская обл, г Красноармейск", "г", "Россия", "RUS", "Центральный", "141290", "Московская", "обл", "UTC+3" },
                    { 540, "", "", "Красногорск", "Московская обл, г Красногорск", "г", "Россия", "RUS", "Центральный", "143401", "Московская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 541, "Сергиев Посад", "г", "Краснозаводск", "Московская обл, г Сергиев Посад, г Краснозаводск", "г", "Россия", "RUS", "Центральный", "141321", "Московская", "обл", "UTC+3" },
                    { 542, "", "", "Краснознаменск", "Московская обл, г Краснознаменск", "г", "Россия", "RUS", "Центральный", "143090", "Московская", "обл", "UTC+3" },
                    { 543, "Одинцово", "г", "Кубинка", "Московская обл, г Одинцово, г Кубинка", "г", "Россия", "RUS", "Центральный", "143070", "Московская", "обл", "UTC+3" },
                    { 544, "Орехово-Зуево", "г", "Куровское", "Московская обл, г Орехово-Зуево, г Куровское", "г", "Россия", "RUS", "Центральный", "142620", "Московская", "обл", "UTC+3" },
                    { 545, "Орехово-Зуево", "г", "Ликино-Дулёво", "Московская обл, г Орехово-Зуево, г Ликино-Дулёво", "г", "Россия", "RUS", "Центральный", "142663", "Московская", "обл", "UTC+3" },
                    { 546, "", "", "Лобня", "Московская обл, г Лобня", "г", "Россия", "RUS", "Центральный", "141055", "Московская", "обл", "UTC+3" },
                    { 547, "", "", "Лосино-Петровский", "Московская обл, г Лосино-Петровский", "г", "Россия", "RUS", "Центральный", "141150", "Московская", "обл", "UTC+3" },
                    { 548, "", "", "Луховицы", "Московская обл, г Луховицы", "г", "Россия", "RUS", "Центральный", "140500", "Московская", "обл", "UTC+3" },
                    { 549, "", "", "Лыткарино", "Московская обл, г Лыткарино", "г", "Россия", "RUS", "Центральный", "140080", "Московская", "обл", "UTC+3" },
                    { 550, "", "", "Люберцы", "Московская обл, г Люберцы", "г", "Россия", "RUS", "Центральный", "140000", "Московская", "обл", "UTC+3" },
                    { 551, "", "", "Можайск", "Московская обл, г Можайск", "г", "Россия", "RUS", "Центральный", "143200", "Московская", "обл", "UTC+3" },
                    { 552, "", "", "Мытищи", "Московская обл, г Мытищи", "г", "Россия", "RUS", "Центральный", "141000", "Московская", "обл", "UTC+3" },
                    { 553, "Наро-Фоминск", "г", "Наро-Фоминск", "Московская обл, г Наро-Фоминск", "", "Россия", "RUS", "Центральный", "143300", "Московская", "обл", "UTC+3" },
                    { 554, "Ногинск", "г", "Ногинск", "Московская обл, г Ногинск", "", "Россия", "RUS", "Центральный", "142400", "Московская", "обл", "UTC+3" },
                    { 555, "Одинцово", "г", "Одинцово", "Московская обл, г Одинцово", "", "Россия", "RUS", "Центральный", "143000", "Московская", "обл", "UTC+3" },
                    { 556, "", "", "Озёры", "Московская обл, г Озёры", "г", "Россия", "RUS", "Центральный", "140560", "Московская", "обл", "UTC+3" },
                    { 557, "Орехово-Зуево", "г", "Орехово-Зуево", "Московская обл, г Орехово-Зуево", "", "Россия", "RUS", "Центральный", "142600", "Московская", "обл", "UTC+3" },
                    { 558, "", "", "Павловский Посад", "Московская обл, г Павловский Посад", "г", "Россия", "RUS", "Центральный", "142500", "Московская", "обл", "UTC+3" },
                    { 559, "Сергиев Посад", "г", "Пересвет", "Московская обл, г Сергиев Посад, г Пересвет", "г", "Россия", "RUS", "Центральный", "141320", "Московская", "обл", "UTC+3" },
                    { 560, "", "", "Подольск", "Московская обл, г Подольск", "г", "Россия", "RUS", "Центральный", "142100", "Московская", "обл", "UTC+3" },
                    { 561, "", "", "Протвино", "Московская обл, г Протвино", "г", "Россия", "RUS", "Центральный", "142280", "Московская", "обл", "UTC+3" },
                    { 562, "", "", "Пушкино", "Московская обл, г Пушкино", "г", "Россия", "RUS", "Центральный", "141200", "Московская", "обл", "UTC+3" },
                    { 563, "", "", "Пущино", "Московская обл, г Пущино", "г", "Россия", "RUS", "Центральный", "142290", "Московская", "обл", "UTC+3" },
                    { 564, "", "", "Раменское", "Московская обл, г Раменское", "г", "Россия", "RUS", "Центральный", "140100", "Московская", "обл", "UTC+3" },
                    { 565, "", "", "Реутов", "Московская обл, г Реутов", "г", "Россия", "RUS", "Центральный", "143960", "Московская", "обл", "UTC+3" },
                    { 566, "Шатура", "г", "Рошаль", "Московская обл, г Шатура, г Рошаль", "г", "Россия", "RUS", "Центральный", "140730", "Московская", "обл", "UTC+3" },
                    { 567, "", "", "Руза", "Московская обл, г Руза", "г", "Россия", "RUS", "Центральный", "143100", "Московская", "обл", "UTC+3" },
                    { 568, "Сергиев Посад", "г", "Сергиев Посад", "Московская обл, г Сергиев Посад", "", "Россия", "RUS", "Центральный", "141300", "Московская", "обл", "UTC+3" },
                    { 569, "", "", "Серпухов", "Московская обл, г Серпухов", "г", "Россия", "RUS", "Центральный", "142200", "Московская", "обл", "UTC+3" },
                    { 570, "", "", "Солнечногорск", "Московская обл, г Солнечногорск", "г", "Россия", "RUS", "Центральный", "141503", "Московская", "обл", "UTC+3" },
                    { 571, "Ногинск", "г", "Старая Купавна", "Московская обл, г Ногинск, г Старая Купавна", "г", "Россия", "RUS", "Центральный", "142450", "Московская", "обл", "UTC+3" },
                    { 572, "", "", "Ступино", "Московская обл, г Ступино", "г", "Россия", "RUS", "Центральный", "142800", "Московская", "обл", "UTC+3" },
                    { 573, "", "", "Талдом", "Московская обл, г Талдом", "г", "Россия", "RUS", "Центральный", "141900", "Московская", "обл", "UTC+3" },
                    { 574, "", "", "Фрязино", "Московская обл, г Фрязино", "г", "Россия", "RUS", "Центральный", "141190", "Московская", "обл", "UTC+3" },
                    { 575, "", "", "Химки", "Московская обл, г Химки", "г", "Россия", "RUS", "Центральный", "141402", "Московская", "обл", "UTC+3" },
                    { 576, "Сергиев Посад", "г", "Хотьково", "Московская обл, г Сергиев Посад, г Хотьково", "г", "Россия", "RUS", "Центральный", "141370", "Московская", "обл", "UTC+3" },
                    { 577, "", "", "Черноголовка", "Московская обл, г Черноголовка", "г", "Россия", "RUS", "Центральный", "142432", "Московская", "обл", "UTC+3" },
                    { 578, "", "", "Чехов", "Московская обл, г Чехов", "г", "Россия", "RUS", "Центральный", "142300", "Московская", "обл", "UTC+3" },
                    { 579, "Шатура", "г", "Шатура", "Московская обл, г Шатура", "", "Россия", "RUS", "Центральный", "140700", "Московская", "обл", "UTC+3" },
                    { 580, "", "", "Щёлково", "Московская обл, г Щёлково", "г", "Россия", "RUS", "Центральный", "141100", "Московская", "обл", "UTC+3" },
                    { 581, "", "", "Электрогорск", "Московская обл, г Электрогорск", "г", "Россия", "RUS", "Центральный", "142530", "Московская", "обл", "UTC+3" },
                    { 582, "", "", "Электросталь", "Московская обл, г Электросталь", "г", "Россия", "RUS", "Центральный", "144000", "Московская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 583, "Ногинск", "г", "Электроугли", "Московская обл, г Ногинск, г Электроугли", "г", "Россия", "RUS", "Центральный", "142455", "Московская", "обл", "UTC+3" },
                    { 584, "Дмитров", "г", "Яхрома", "Московская обл, г Дмитров, г Яхрома", "г", "Россия", "RUS", "Центральный", "141840", "Московская", "обл", "UTC+3" },
                    { 585, "", "", "Апатиты", "Мурманская обл, г Апатиты", "г", "Россия", "RUS", "Северо-Западный", "184200", "Мурманская", "обл", "UTC+3" },
                    { 586, "", "", "Гаджиево", "Мурманская обл, г Гаджиево", "г", "Россия", "RUS", "Северо-Западный", "184670", "Мурманская", "обл", "UTC+3" },
                    { 587, "", "", "Заозерск", "Мурманская обл, г Заозерск", "г", "Россия", "RUS", "Северо-Западный", "184310", "Мурманская", "обл", "UTC+3" },
                    { 588, "Печенгский", "р-н", "Заполярный", "Мурманская обл, Печенгский р-н, г Заполярный", "г", "Россия", "RUS", "Северо-Западный", "184430", "Мурманская", "обл", "UTC+3" },
                    { 589, "Кандалакшский", "р-н", "Кандалакша", "Мурманская обл, г Кандалакша", "г", "Россия", "RUS", "Северо-Западный", "184042", "Мурманская", "обл", "UTC+3" },
                    { 590, "", "", "Кировск", "Мурманская обл, г Кировск", "г", "Россия", "RUS", "Северо-Западный", "184250", "Мурманская", "обл", "UTC+3" },
                    { 591, "Ковдорский", "р-н", "Ковдор", "Мурманская обл, г Ковдор", "г", "Россия", "RUS", "Северо-Западный", "184144", "Мурманская", "обл", "UTC+3" },
                    { 592, "Кольский", "р-н", "Кола", "Мурманская обл, г Кола", "г", "Россия", "RUS", "Северо-Западный", "184380", "Мурманская", "обл", "UTC+3" },
                    { 593, "", "", "Мончегорск", "Мурманская обл, г Мончегорск", "г", "Россия", "RUS", "Северо-Западный", "184505", "Мурманская", "обл", "UTC+3" },
                    { 594, "", "", "Мурманск", "г Мурманск", "г", "Россия", "RUS", "Северо-Западный", "183000", "Мурманская", "обл", "UTC+3" },
                    { 595, "", "", "Оленегорск", "Мурманская обл, г Оленегорск", "г", "Россия", "RUS", "Северо-Западный", "184530", "Мурманская", "обл", "UTC+3" },
                    { 596, "", "", "Островной", "Мурманская обл, г Островной", "г", "Россия", "RUS", "Северо-Западный", "184640", "Мурманская", "обл", "UTC+3" },
                    { 597, "", "", "Полярные Зори", "Мурманская обл, г Полярные Зори", "г", "Россия", "RUS", "Северо-Западный", "184230", "Мурманская", "обл", "UTC+3" },
                    { 598, "", "", "Полярный", "Мурманская обл, г Полярный", "г", "Россия", "RUS", "Северо-Западный", "184650", "Мурманская", "обл", "UTC+3" },
                    { 599, "", "", "Североморск", "Мурманская обл, г Североморск", "г", "Россия", "RUS", "Северо-Западный", "184601", "Мурманская", "обл", "UTC+3" },
                    { 600, "", "", "Снежногорск", "Мурманская обл, г Снежногорск", "г", "Россия", "RUS", "Северо-Западный", "184682", "Мурманская", "обл", "UTC+3" },
                    { 601, "", "", "Нарьян-Мар", "г Нарьян-Мар", "г", "Россия", "RUS", "Северо-Западный", "166000", "Ненецкий", "АО", "UTC+3" },
                    { 602, "", "", "Арзамас", "Нижегородская обл, г Арзамас", "г", "Россия", "RUS", "Приволжский", "607220", "Нижегородская", "обл", "UTC+3" },
                    { 603, "Балахнинский", "р-н", "Балахна", "Нижегородская обл, г Балахна", "г", "Россия", "RUS", "Приволжский", "606407", "Нижегородская", "обл", "UTC+3" },
                    { 604, "Богородский", "р-н", "Богородск", "Нижегородская обл, г Богородск", "г", "Россия", "RUS", "Приволжский", "607600", "Нижегородская", "обл", "UTC+3" },
                    { 605, "", "", "Бор", "Нижегородская обл, г Бор", "г", "Россия", "RUS", "Приволжский", "606440", "Нижегородская", "обл", "UTC+3" },
                    { 606, "Ветлужский", "р-н", "Ветлуга", "Нижегородская обл, г Ветлуга", "г", "Россия", "RUS", "Приволжский", "606860", "Нижегородская", "обл", "UTC+3" },
                    { 607, "Володарский", "р-н", "Володарск", "Нижегородская обл, г Володарск", "г", "Россия", "RUS", "Приволжский", "606072", "Нижегородская", "обл", "UTC+3" },
                    { 608, "Павловский", "р-н", "Ворсма", "Нижегородская обл, Павловский р-н, г Ворсма", "г", "Россия", "RUS", "Приволжский", "606120", "Нижегородская", "обл", "UTC+3" },
                    { 609, "", "", "Выкса", "Нижегородская обл, г Выкса", "г", "Россия", "RUS", "Приволжский", "607060", "Нижегородская", "обл", "UTC+3" },
                    { 610, "Павловский", "р-н", "Горбатов", "Нижегородская обл, Павловский р-н, г Горбатов", "г", "Россия", "RUS", "Приволжский", "606125", "Нижегородская", "обл", "UTC+3" },
                    { 611, "Городецкий", "р-н", "Городец", "Нижегородская обл, г Городец", "г", "Россия", "RUS", "Приволжский", "606500", "Нижегородская", "обл", "UTC+3" },
                    { 612, "", "", "Дзержинск", "Нижегородская обл, г Дзержинск", "г", "Россия", "RUS", "Приволжский", "606000", "Нижегородская", "обл", "UTC+3" },
                    { 613, "Городецкий", "р-н", "Заволжье", "Нижегородская обл, Городецкий р-н, г Заволжье", "г", "Россия", "RUS", "Приволжский", "606520", "Нижегородская", "обл", "UTC+3" },
                    { 614, "Княгининский", "р-н", "Княгинино", "Нижегородская обл, г Княгинино", "г", "Россия", "RUS", "Приволжский", "606340", "Нижегородская", "обл", "UTC+3" },
                    { 615, "Кстовский", "р-н", "Кстово", "Нижегородская обл, г Кстово", "г", "Россия", "RUS", "Приволжский", "607650", "Нижегородская", "обл", "UTC+3" },
                    { 616, "", "", "Кулебаки", "Нижегородская обл, г Кулебаки", "г", "Россия", "RUS", "Приволжский", "607010", "Нижегородская", "обл", "UTC+3" },
                    { 617, "Лукояновский", "р-н", "Лукоянов", "Нижегородская обл, г Лукоянов", "г", "Россия", "RUS", "Приволжский", "607800", "Нижегородская", "обл", "UTC+3" },
                    { 618, "Лысковский", "р-н", "Лысково", "Нижегородская обл, г Лысково", "г", "Россия", "RUS", "Приволжский", "606210", "Нижегородская", "обл", "UTC+3" },
                    { 619, "", "", "Навашино", "Нижегородская обл, г Навашино", "г", "Россия", "RUS", "Приволжский", "607100", "Нижегородская", "обл", "UTC+3" },
                    { 620, "", "", "Нижний Новгород", "г Нижний Новгород", "г", "Россия", "RUS", "Приволжский", "603000", "Нижегородская", "обл", "UTC+3" },
                    { 621, "Павловский", "р-н", "Павлово", "Нижегородская обл, г Павлово", "г", "Россия", "RUS", "Приволжский", "606100", "Нижегородская", "обл", "UTC+3" },
                    { 622, "", "", "Первомайск", "Нижегородская обл, г Первомайск", "г", "Россия", "RUS", "Приволжский", "607751", "Нижегородская", "обл", "UTC+3" },
                    { 623, "", "", "Перевоз", "Нижегородская обл, г Перевоз", "г", "Россия", "RUS", "Приволжский", "607400", "Нижегородская", "обл", "UTC+3" },
                    { 624, "", "", "Саров", "Нижегородская обл, г Саров", "г", "Россия", "RUS", "Приволжский", "607180", "Нижегородская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 625, "", "", "Семенов", "Нижегородская обл, г Семенов", "г", "Россия", "RUS", "Приволжский", "606605", "Нижегородская", "обл", "UTC+3" },
                    { 626, "Сергачский", "р-н", "Сергач", "Нижегородская обл, г Сергач", "г", "Россия", "RUS", "Приволжский", "607510", "Нижегородская", "обл", "UTC+3" },
                    { 627, "Уренский", "р-н", "Урень", "Нижегородская обл, г Урень", "г", "Россия", "RUS", "Приволжский", "606803", "Нижегородская", "обл", "UTC+3" },
                    { 628, "Чкаловский", "р-н", "Чкаловск", "Нижегородская обл, г Чкаловск", "г", "Россия", "RUS", "Приволжский", "606540", "Нижегородская", "обл", "UTC+3" },
                    { 629, "", "", "Шахунья", "Нижегородская обл, г Шахунья", "г", "Россия", "RUS", "Приволжский", "606910", "Нижегородская", "обл", "UTC+3" },
                    { 630, "Боровичский", "р-н", "Боровичи", "Новгородская обл, г Боровичи", "г", "Россия", "RUS", "Северо-Западный", "174400", "Новгородская", "обл", "UTC+3" },
                    { 631, "Валдайский", "р-н", "Валдай", "Новгородская обл, г Валдай", "г", "Россия", "RUS", "Северо-Западный", "175400", "Новгородская", "обл", "UTC+3" },
                    { 632, "", "", "Великий Новгород", "г Великий Новгород", "г", "Россия", "RUS", "Северо-Западный", "173000", "Новгородская", "обл", "UTC+3" },
                    { 633, "Маловишерский", "р-н", "Малая Вишера", "Новгородская обл, г Малая Вишера", "г", "Россия", "RUS", "Северо-Западный", "174260", "Новгородская", "обл", "UTC+3" },
                    { 634, "Окуловский", "р-н", "Окуловка", "Новгородская обл, г Окуловка", "г", "Россия", "RUS", "Северо-Западный", "174350", "Новгородская", "обл", "UTC+3" },
                    { 635, "Пестовский", "р-н", "Пестово", "Новгородская обл, г Пестово", "г", "Россия", "RUS", "Северо-Западный", "174510", "Новгородская", "обл", "UTC+3" },
                    { 636, "Солецкий", "р-н", "Сольцы", "Новгородская обл, г Сольцы", "г", "Россия", "RUS", "Северо-Западный", "175040", "Новгородская", "обл", "UTC+3" },
                    { 637, "Старорусский", "р-н", "Старая Русса", "Новгородская обл, г Старая Русса", "г", "Россия", "RUS", "Северо-Западный", "175200", "Новгородская", "обл", "UTC+3" },
                    { 638, "Холмский", "р-н", "Холм", "Новгородская обл, г Холм", "г", "Россия", "RUS", "Северо-Западный", "175270", "Новгородская", "обл", "UTC+3" },
                    { 639, "Чудовский", "р-н", "Чудово", "Новгородская обл, г Чудово", "г", "Россия", "RUS", "Северо-Западный", "174210", "Новгородская", "обл", "UTC+3" },
                    { 640, "Барабинский", "р-н", "Барабинск", "Новосибирская обл, Барабинский р-н, г Барабинск", "г", "Россия", "RUS", "Сибирский", "632330", "Новосибирская", "обл", "UTC+7" },
                    { 641, "", "", "Бердск", "Новосибирская обл, г Бердск", "г", "Россия", "RUS", "Сибирский", "633000", "Новосибирская", "обл", "UTC+7" },
                    { 642, "Болотнинский", "р-н", "Болотное", "Новосибирская обл, г Болотное", "г", "Россия", "RUS", "Сибирский", "633340", "Новосибирская", "обл", "UTC+7" },
                    { 643, "", "", "Искитим", "Новосибирская обл, г Искитим", "г", "Россия", "RUS", "Сибирский", "633200", "Новосибирская", "обл", "UTC+7" },
                    { 644, "Карасукский", "р-н", "Карасук", "Новосибирская обл, г Карасук", "г", "Россия", "RUS", "Сибирский", "632860", "Новосибирская", "обл", "UTC+7" },
                    { 645, "Каргатский", "р-н", "Каргат", "Новосибирская обл, г Каргат", "г", "Россия", "RUS", "Сибирский", "632400", "Новосибирская", "обл", "UTC+7" },
                    { 646, "Куйбышевский", "р-н", "Куйбышев", "Новосибирская обл, Куйбышевский р-н, г Куйбышев", "г", "Россия", "RUS", "Сибирский", "632380", "Новосибирская", "обл", "UTC+7" },
                    { 647, "Купинский", "р-н", "Купино", "Новосибирская обл, г Купино", "г", "Россия", "RUS", "Сибирский", "632730", "Новосибирская", "обл", "UTC+7" },
                    { 648, "", "", "Новосибирск", "г Новосибирск", "г", "Россия", "RUS", "Сибирский", "630000", "Новосибирская", "обл", "UTC+7" },
                    { 649, "", "", "Обь", "Новосибирская обл, г Обь", "г", "Россия", "RUS", "Сибирский", "633100", "Новосибирская", "обл", "UTC+7" },
                    { 650, "Татарский", "р-н", "Татарск", "Новосибирская обл, Татарский р-н, г Татарск", "г", "Россия", "RUS", "Сибирский", "632120", "Новосибирская", "обл", "UTC+7" },
                    { 651, "Тогучинский", "р-н", "Тогучин", "Новосибирская обл, г Тогучин", "г", "Россия", "RUS", "Сибирский", "633450", "Новосибирская", "обл", "UTC+7" },
                    { 652, "Черепановский", "р-н", "Черепаново", "Новосибирская обл, г Черепаново", "г", "Россия", "RUS", "Сибирский", "633520", "Новосибирская", "обл", "UTC+7" },
                    { 653, "Чулымский", "р-н", "Чулым", "Новосибирская обл, г Чулым", "г", "Россия", "RUS", "Сибирский", "632550", "Новосибирская", "обл", "UTC+7" },
                    { 654, "Исилькульский", "р-н", "Исилькуль", "Омская обл, г Исилькуль", "г", "Россия", "RUS", "Сибирский", "646020", "Омская", "обл", "UTC+6" },
                    { 655, "Калачинский", "р-н", "Калачинск", "Омская обл, г Калачинск", "г", "Россия", "RUS", "Сибирский", "646900", "Омская", "обл", "UTC+6" },
                    { 656, "Называевский", "р-н", "Называевск", "Омская обл, г Называевск", "г", "Россия", "RUS", "Сибирский", "646100", "Омская", "обл", "UTC+6" },
                    { 657, "", "", "Омск", "г Омск", "г", "Россия", "RUS", "Сибирский", "644000", "Омская", "обл", "UTC+6" },
                    { 658, "Тарский", "р-н", "Тара", "Омская обл, г Тара", "г", "Россия", "RUS", "Сибирский", "646530", "Омская", "обл", "UTC+6" },
                    { 659, "Тюкалинский", "р-н", "Тюкалинск", "Омская обл, г Тюкалинск", "г", "Россия", "RUS", "Сибирский", "646330", "Омская", "обл", "UTC+6" },
                    { 660, "Абдулинский", "р-н", "Абдулино", "Оренбургская обл, г Абдулино", "г", "Россия", "RUS", "Приволжский", "461743", "Оренбургская", "обл", "UTC+5" },
                    { 661, "", "", "Бугуруслан", "Оренбургская обл, г Бугуруслан", "г", "Россия", "RUS", "Приволжский", "461630", "Оренбургская", "обл", "UTC+5" },
                    { 662, "", "", "Бузулук", "Оренбургская обл, г Бузулук", "г", "Россия", "RUS", "Приволжский", "461040", "Оренбургская", "обл", "UTC+5" },
                    { 663, "", "", "Гай", "Оренбургская обл, г Гай", "г", "Россия", "RUS", "Приволжский", "462631", "Оренбургская", "обл", "UTC+5" },
                    { 664, "", "", "Кувандык", "Оренбургская обл, г Кувандык", "г", "Россия", "RUS", "Приволжский", "462240", "Оренбургская", "обл", "UTC+5" },
                    { 665, "", "", "Медногорск", "Оренбургская обл, г Медногорск", "г", "Россия", "RUS", "Приволжский", "462271", "Оренбургская", "обл", "UTC+5" },
                    { 666, "", "", "Новотроицк", "Оренбургская обл, г Новотроицк", "г", "Россия", "RUS", "Приволжский", "462351", "Оренбургская", "обл", "UTC+5" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 667, "", "", "Оренбург", "г Оренбург", "г", "Россия", "RUS", "Приволжский", "460000", "Оренбургская", "обл", "UTC+5" },
                    { 668, "", "", "Орск", "Оренбургская обл, г Орск", "г", "Россия", "RUS", "Приволжский", "462400", "Оренбургская", "обл", "UTC+5" },
                    { 669, "Соль-Илецкий", "р-н", "Соль-Илецк", "Оренбургская обл, г Соль-Илецк", "г", "Россия", "RUS", "Приволжский", "461504", "Оренбургская", "обл", "UTC+5" },
                    { 670, "", "", "Сорочинск", "Оренбургская обл, г Сорочинск", "г", "Россия", "RUS", "Приволжский", "461900", "Оренбургская", "обл", "UTC+5" },
                    { 671, "", "", "Ясный", "Оренбургская обл, г Ясный", "г", "Россия", "RUS", "Приволжский", "462780", "Оренбургская", "обл", "UTC+5" },
                    { 672, "Болховский", "р-н", "Болхов", "Орловская обл, г Болхов", "г", "Россия", "RUS", "Центральный", "303140", "Орловская", "обл", "UTC+3" },
                    { 673, "Дмитровский", "р-н", "Дмитровск", "Орловская обл, г Дмитровск", "г", "Россия", "RUS", "Центральный", "303240", "Орловская", "обл", "UTC+3" },
                    { 674, "", "", "Ливны", "Орловская обл, г Ливны", "г", "Россия", "RUS", "Центральный", "303850", "Орловская", "обл", "UTC+3" },
                    { 675, "Малоархангельский", "р-н", "Малоархангельск", "Орловская обл, г Малоархангельск", "г", "Россия", "RUS", "Центральный", "303369", "Орловская", "обл", "UTC+3" },
                    { 676, "", "", "Мценск", "Орловская обл, г Мценск", "г", "Россия", "RUS", "Центральный", "303030", "Орловская", "обл", "UTC+3" },
                    { 677, "Новосильский", "р-н", "Новосиль", "Орловская обл, г Новосиль", "г", "Россия", "RUS", "Центральный", "303500", "Орловская", "обл", "UTC+3" },
                    { 678, "", "", "Орёл", "г Орёл", "г", "Россия", "RUS", "Центральный", "302000", "Орловская", "обл", "UTC+3" },
                    { 679, "Белинский", "р-н", "Белинский", "Пензенская обл, г Белинский", "г", "Россия", "RUS", "Приволжский", "442250", "Пензенская", "обл", "UTC+3" },
                    { 680, "Городищенский", "р-н", "Городище", "Пензенская обл, г Городище", "г", "Россия", "RUS", "Приволжский", "442310", "Пензенская", "обл", "UTC+3" },
                    { 681, "", "", "Заречный", "Пензенская обл, г Заречный", "г", "Россия", "RUS", "Приволжский", "442960", "Пензенская", "обл", "UTC+3" },
                    { 682, "Каменский", "р-н", "Каменка", "Пензенская обл, г Каменка", "г", "Россия", "RUS", "Приволжский", "442240", "Пензенская", "обл", "UTC+3" },
                    { 683, "", "", "Кузнецк", "Пензенская обл, г Кузнецк", "г", "Россия", "RUS", "Приволжский", "442530", "Пензенская", "обл", "UTC+3" },
                    { 684, "Нижнеломовский", "р-н", "Нижний Ломов", "Пензенская обл, г Нижний Ломов", "г", "Россия", "RUS", "Приволжский", "442150", "Пензенская", "обл", "UTC+3" },
                    { 685, "Никольский", "р-н", "Никольск", "Пензенская обл, г Никольск", "г", "Россия", "RUS", "Приволжский", "442680", "Пензенская", "обл", "UTC+3" },
                    { 686, "", "", "Пенза", "г Пенза", "г", "Россия", "RUS", "Приволжский", "440000", "Пензенская", "обл", "UTC+3" },
                    { 687, "Сердобский", "р-н", "Сердобск", "Пензенская обл, г Сердобск", "г", "Россия", "RUS", "Приволжский", "442890", "Пензенская", "обл", "UTC+3" },
                    { 688, "Спасский", "р-н", "Спасск", "Пензенская обл, г Спасск", "г", "Россия", "RUS", "Приволжский", "442600", "Пензенская", "обл", "UTC+3" },
                    { 689, "Городищенский", "р-н", "Сурск", "Пензенская обл, Городищенский р-н, г Сурск", "г", "Россия", "RUS", "Приволжский", "442300", "Пензенская", "обл", "UTC+3" },
                    { 690, "", "", "Александровск", "Пермский край, г Александровск", "г", "Россия", "RUS", "Приволжский", "618320", "Пермский", "край", "UTC+5" },
                    { 691, "", "", "Березники", "Пермский край, г Березники", "г", "Россия", "RUS", "Приволжский", "618400", "Пермский", "край", "UTC+5" },
                    { 692, "Верещагинский", "р-н", "Верещагино", "Пермский край, г Верещагино", "г", "Россия", "RUS", "Приволжский", "617119", "Пермский", "край", "UTC+5" },
                    { 693, "Горнозаводский", "р-н", "Горнозаводск", "Пермский край, г Горнозаводск", "г", "Россия", "RUS", "Приволжский", "618820", "Пермский", "край", "UTC+5" },
                    { 694, "", "", "Гремячинск", "Пермский край, г Гремячинск", "г", "Россия", "RUS", "Приволжский", "618270", "Пермский", "край", "UTC+5" },
                    { 695, "", "", "Губаха", "Пермский край, г Губаха", "г", "Россия", "RUS", "Приволжский", "618250", "Пермский", "край", "UTC+5" },
                    { 696, "", "", "Добрянка", "Пермский край, г Добрянка", "г", "Россия", "RUS", "Приволжский", "618730", "Пермский", "край", "UTC+5" },
                    { 697, "", "", "Кизел", "Пермский край, г Кизел", "г", "Россия", "RUS", "Приволжский", "618350", "Пермский", "край", "UTC+5" },
                    { 698, "Красновишерский", "р-н", "Красновишерск", "Пермский край, г Красновишерск", "г", "Россия", "RUS", "Приволжский", "618590", "Пермский", "край", "UTC+5" },
                    { 699, "", "", "Краснокамск", "Пермский край, г Краснокамск", "г", "Россия", "RUS", "Приволжский", "617060", "Пермский", "край", "UTC+5" },
                    { 700, "", "", "Кудымкар", "Пермский край, г Кудымкар", "г", "Россия", "RUS", "Приволжский", "619000", "Пермский", "край", "UTC+5" },
                    { 701, "", "", "Кунгур", "Пермский край, г Кунгур", "г", "Россия", "RUS", "Приволжский", "617470", "Пермский", "край", "UTC+5" },
                    { 702, "", "", "Лысьва", "Пермский край, г Лысьва", "г", "Россия", "RUS", "Приволжский", "618900", "Пермский", "край", "UTC+5" },
                    { 703, "Нытвенский", "р-н", "Нытва", "Пермский край, г Нытва", "г", "Россия", "RUS", "Приволжский", "617000", "Пермский", "край", "UTC+5" },
                    { 704, "Осинский", "р-н", "Оса", "Пермский край, г Оса", "г", "Россия", "RUS", "Приволжский", "618120", "Пермский", "край", "UTC+5" },
                    { 705, "Оханский", "р-н", "Оханск", "Пермский край, г Оханск", "г", "Россия", "RUS", "Приволжский", "618100", "Пермский", "край", "UTC+5" },
                    { 706, "Очерский", "р-н", "Очер", "Пермский край, г Очер", "г", "Россия", "RUS", "Приволжский", "617140", "Пермский", "край", "UTC+5" },
                    { 707, "", "", "Пермь", "г Пермь", "г", "Россия", "RUS", "Приволжский", "614000", "Пермский", "край", "UTC+5" },
                    { 708, "", "", "Соликамск", "Пермский край, г Соликамск", "г", "Россия", "RUS", "Приволжский", "618541", "Пермский", "край", "UTC+5" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 709, "Усольский", "р-н", "Усолье", "Пермский край, г Усолье", "г", "Россия", "RUS", "Приволжский", "618460", "Пермский", "край", "UTC+5" },
                    { 710, "", "", "Чайковский", "Пермский край, г Чайковский", "г", "Россия", "RUS", "Приволжский", "617760", "Пермский", "край", "UTC+5" },
                    { 711, "Чердынский", "р-н", "Чердынь", "Пермский край, г Чердынь", "г", "Россия", "RUS", "Приволжский", "618601", "Пермский", "край", "UTC+5" },
                    { 712, "Ильинский", "р-н", "Чермоз", "Пермский край, Ильинский р-н, г Чермоз", "г", "Россия", "RUS", "Приволжский", "617040", "Пермский", "край", "UTC+5" },
                    { 713, "Чернушинский", "р-н", "Чернушка", "Пермский край, г Чернушка", "г", "Россия", "RUS", "Приволжский", "617830", "Пермский", "край", "UTC+5" },
                    { 714, "", "", "Чусовой", "Пермский край, г Чусовой", "г", "Россия", "RUS", "Приволжский", "618200", "Пермский", "край", "UTC+5" },
                    { 715, "", "", "Арсеньев", "Приморский край, г Арсеньев", "г", "Россия", "RUS", "Дальневосточный", "692330", "Приморский", "край", "UTC+10" },
                    { 716, "", "", "Артем", "Приморский край, г Артем", "г", "Россия", "RUS", "Дальневосточный", "692486", "Приморский", "край", "UTC+10" },
                    { 717, "", "", "Большой Камень", "Приморский край, г Большой Камень", "г", "Россия", "RUS", "Дальневосточный", "692801", "Приморский", "край", "UTC+10" },
                    { 718, "", "", "Владивосток", "г Владивосток", "г", "Россия", "RUS", "Дальневосточный", "690000", "Приморский", "край", "UTC+10" },
                    { 719, "", "", "Дальнегорск", "Приморский край, г Дальнегорск", "г", "Россия", "RUS", "Дальневосточный", "692441", "Приморский", "край", "UTC+10" },
                    { 720, "", "", "Дальнереченск", "Приморский край, г Дальнереченск", "г", "Россия", "RUS", "Дальневосточный", "692130", "Приморский", "край", "UTC+10" },
                    { 721, "", "", "Лесозаводск", "Приморский край, г Лесозаводск", "г", "Россия", "RUS", "Дальневосточный", "692031", "Приморский", "край", "UTC+10" },
                    { 722, "", "", "Находка", "Приморский край, г Находка", "г", "Россия", "RUS", "Дальневосточный", "692900", "Приморский", "край", "UTC+10" },
                    { 723, "", "", "Партизанск", "Приморский край, г Партизанск", "г", "Россия", "RUS", "Дальневосточный", "692851", "Приморский", "край", "UTC+10" },
                    { 724, "", "", "Спасск-Дальний", "Приморский край, г Спасск-Дальний", "г", "Россия", "RUS", "Дальневосточный", "692230", "Приморский", "край", "UTC+10" },
                    { 725, "", "", "Уссурийск", "Приморский край, г Уссурийск", "г", "Россия", "RUS", "Дальневосточный", "692500", "Приморский", "край", "UTC+10" },
                    { 726, "", "", "Фокино", "Приморский край, г Фокино", "г", "Россия", "RUS", "Дальневосточный", "692880", "Приморский", "край", "UTC+10" },
                    { 727, "", "", "Великие Луки", "Псковская обл, г Великие Луки", "г", "Россия", "RUS", "Северо-Западный", "182100", "Псковская", "обл", "UTC+3" },
                    { 728, "Гдовский", "р-н", "Гдов", "Псковская обл, г Гдов", "г", "Россия", "RUS", "Северо-Западный", "181600", "Псковская", "обл", "UTC+3" },
                    { 729, "Дновский", "р-н", "Дно", "Псковская обл, г Дно", "г", "Россия", "RUS", "Северо-Западный", "182670", "Псковская", "обл", "UTC+3" },
                    { 730, "Невельский", "р-н", "Невель", "Псковская обл, г Невель", "г", "Россия", "RUS", "Северо-Западный", "182500", "Псковская", "обл", "UTC+3" },
                    { 731, "Новоржевский", "р-н", "Новоржев", "Псковская обл, г Новоржев", "г", "Россия", "RUS", "Северо-Западный", "182440", "Псковская", "обл", "UTC+3" },
                    { 732, "Новосокольнический", "р-н", "Новосокольники", "Псковская обл, г Новосокольники", "г", "Россия", "RUS", "Северо-Западный", "182200", "Псковская", "обл", "UTC+3" },
                    { 733, "Опочецкий", "р-н", "Опочка", "Псковская обл, г Опочка", "г", "Россия", "RUS", "Северо-Западный", "182333", "Псковская", "обл", "UTC+3" },
                    { 734, "Островский", "р-н", "Остров", "Псковская обл, г Остров", "г", "Россия", "RUS", "Северо-Западный", "181353", "Псковская", "обл", "UTC+3" },
                    { 735, "Печорский", "р-н", "Печоры", "Псковская обл, г Печоры", "г", "Россия", "RUS", "Северо-Западный", "181502", "Псковская", "обл", "UTC+3" },
                    { 736, "Порховский", "р-н", "Порхов", "Псковская обл, г Порхов", "г", "Россия", "RUS", "Северо-Западный", "182620", "Псковская", "обл", "UTC+3" },
                    { 737, "", "", "Псков", "г Псков", "г", "Россия", "RUS", "Северо-Западный", "180000", "Псковская", "обл", "UTC+3" },
                    { 738, "Пустошкинский", "р-н", "Пустошка", "Псковская обл, г Пустошка", "г", "Россия", "RUS", "Северо-Западный", "182300", "Псковская", "обл", "UTC+3" },
                    { 739, "Пыталовский", "р-н", "Пыталово", "Псковская обл, г Пыталово", "г", "Россия", "RUS", "Северо-Западный", "181410", "Псковская", "обл", "UTC+3" },
                    { 740, "Себежский", "р-н", "Себеж", "Псковская обл, г Себеж", "г", "Россия", "RUS", "Северо-Западный", "182250", "Псковская", "обл", "UTC+3" },
                    { 741, "", "", "Азов", "Ростовская обл, г Азов", "г", "Россия", "RUS", "Южный", "346780", "Ростовская", "обл", "UTC+3" },
                    { 742, "Аксайский", "р-н", "Аксай", "Ростовская обл, г Аксай", "г", "Россия", "RUS", "Южный", "346720", "Ростовская", "обл", "UTC+3" },
                    { 743, "", "", "Батайск", "Ростовская обл, г Батайск", "г", "Россия", "RUS", "Южный", "346880", "Ростовская", "обл", "UTC+3" },
                    { 744, "Белокалитвинский", "р-н", "Белая Калитва", "Ростовская обл, г Белая Калитва", "г", "Россия", "RUS", "Южный", "347040", "Ростовская", "обл", "UTC+3" },
                    { 745, "", "", "Волгодонск", "Ростовская обл, г Волгодонск", "г", "Россия", "RUS", "Южный", "347360", "Ростовская", "обл", "UTC+3" },
                    { 746, "", "", "Гуково", "Ростовская обл, г Гуково", "г", "Россия", "RUS", "Южный", "347870", "Ростовская", "обл", "UTC+3" },
                    { 747, "", "", "Донецк", "Ростовская обл, г Донецк", "г", "Россия", "RUS", "Южный", "346330", "Ростовская", "обл", "UTC+3" },
                    { 748, "", "", "Зверево", "Ростовская обл, г Зверево", "г", "Россия", "RUS", "Южный", "346310", "Ростовская", "обл", "UTC+3" },
                    { 749, "Зерноградский", "р-н", "Зерноград", "Ростовская обл, г Зерноград", "г", "Россия", "RUS", "Южный", "347740", "Ростовская", "обл", "UTC+3" },
                    { 750, "", "", "Каменск-Шахтинский", "Ростовская обл, г Каменск-Шахтинский", "г", "Россия", "RUS", "Южный", "347800", "Ростовская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 751, "Константиновский", "р-н", "Константиновск", "Ростовская обл, г Константиновск", "г", "Россия", "RUS", "Южный", "347250", "Ростовская", "обл", "UTC+3" },
                    { 752, "Красносулинский", "р-н", "Красный Сулин", "Ростовская обл, г Красный Сулин", "г", "Россия", "RUS", "Южный", "346350", "Ростовская", "обл", "UTC+3" },
                    { 753, "Миллеровский", "р-н", "Миллерово", "Ростовская обл, г Миллерово", "г", "Россия", "RUS", "Южный", "346130", "Ростовская", "обл", "UTC+3" },
                    { 754, "Морозовский", "р-н", "Морозовск", "Ростовская обл, г Морозовск", "г", "Россия", "RUS", "Южный", "347210", "Ростовская", "обл", "UTC+3" },
                    { 755, "", "", "Новочеркасск", "Ростовская обл, г Новочеркасск", "г", "Россия", "RUS", "Южный", "346400", "Ростовская", "обл", "UTC+3" },
                    { 756, "", "", "Новошахтинск", "Ростовская обл, г Новошахтинск", "г", "Россия", "RUS", "Южный", "346900", "Ростовская", "обл", "UTC+3" },
                    { 757, "Пролетарский", "р-н", "Пролетарск", "Ростовская обл, г Пролетарск", "г", "Россия", "RUS", "Южный", "347540", "Ростовская", "обл", "UTC+3" },
                    { 758, "", "", "Ростов-на-Дону", "г Ростов-на-Дону", "г", "Россия", "RUS", "Южный", "344000", "Ростовская", "обл", "UTC+3" },
                    { 759, "Сальский", "р-н", "Сальск", "Ростовская обл, г Сальск", "г", "Россия", "RUS", "Южный", "347630", "Ростовская", "обл", "UTC+3" },
                    { 760, "Семикаракорский", "р-н", "Семикаракорск", "Ростовская обл, г Семикаракорск", "г", "Россия", "RUS", "Южный", "346630", "Ростовская", "обл", "UTC+3" },
                    { 761, "", "", "Таганрог", "Ростовская обл, г Таганрог", "г", "Россия", "RUS", "Южный", "347900", "Ростовская", "обл", "UTC+3" },
                    { 762, "Цимлянский", "р-н", "Цимлянск", "Ростовская обл, г Цимлянск", "г", "Россия", "RUS", "Южный", "347320", "Ростовская", "обл", "UTC+3" },
                    { 763, "", "", "Шахты", "Ростовская обл, г Шахты", "г", "Россия", "RUS", "Южный", "346500", "Ростовская", "обл", "UTC+3" },
                    { 764, "", "", "Касимов", "Рязанская обл, г Касимов", "г", "Россия", "RUS", "Центральный", "391300", "Рязанская", "обл", "UTC+3" },
                    { 765, "Кораблинский", "р-н", "Кораблино", "Рязанская обл, г Кораблино", "г", "Россия", "RUS", "Центральный", "391200", "Рязанская", "обл", "UTC+3" },
                    { 766, "Михайловский", "р-н", "Михайлов", "Рязанская обл, г Михайлов", "г", "Россия", "RUS", "Центральный", "391710", "Рязанская", "обл", "UTC+3" },
                    { 767, "Пронский", "р-н", "Новомичуринск", "Рязанская обл, Пронский р-н, г Новомичуринск", "г", "Россия", "RUS", "Центральный", "391160", "Рязанская", "обл", "UTC+3" },
                    { 768, "Рыбновский", "р-н", "Рыбное", "Рязанская обл, г Рыбное", "г", "Россия", "RUS", "Центральный", "391110", "Рязанская", "обл", "UTC+3" },
                    { 769, "Ряжский", "р-н", "Ряжск", "Рязанская обл, г Ряжск", "г", "Россия", "RUS", "Центральный", "391960", "Рязанская", "обл", "UTC+3" },
                    { 770, "", "", "Рязань", "г Рязань", "г", "Россия", "RUS", "Центральный", "390000", "Рязанская", "обл", "UTC+3" },
                    { 771, "", "", "Сасово", "Рязанская обл, г Сасово", "г", "Россия", "RUS", "Центральный", "391430", "Рязанская", "обл", "UTC+3" },
                    { 772, "", "", "Скопин", "Рязанская обл, г Скопин", "г", "Россия", "RUS", "Центральный", "391800", "Рязанская", "обл", "UTC+3" },
                    { 773, "Клепиковский", "р-н", "Спас-Клепики", "Рязанская обл, г Спас-Клепики", "г", "Россия", "RUS", "Центральный", "391030", "Рязанская", "обл", "UTC+3" },
                    { 774, "Спасский", "р-н", "Спасск-Рязанский", "Рязанская обл, г Спасск-Рязанский", "г", "Россия", "RUS", "Центральный", "391050", "Рязанская", "обл", "UTC+3" },
                    { 775, "Шацкий", "р-н", "Шацк", "Рязанская обл, г Шацк", "г", "Россия", "RUS", "Центральный", "391550", "Рязанская", "обл", "UTC+3" },
                    { 776, "", "", "Жигулевск", "Самарская обл, г Жигулевск", "г", "Россия", "RUS", "Приволжский", "445350", "Самарская", "обл", "UTC+4" },
                    { 777, "", "", "Кинель", "Самарская обл, г Кинель", "г", "Россия", "RUS", "Приволжский", "446430", "Самарская", "обл", "UTC+4" },
                    { 778, "Нефтегорский", "р-н", "Нефтегорск", "Самарская обл, г Нефтегорск", "г", "Россия", "RUS", "Приволжский", "446600", "Самарская", "обл", "UTC+4" },
                    { 779, "", "", "Новокуйбышевск", "Самарская обл, г Новокуйбышевск", "г", "Россия", "RUS", "Приволжский", "446200", "Самарская", "обл", "UTC+4" },
                    { 780, "", "", "Октябрьск", "Самарская обл, г Октябрьск", "г", "Россия", "RUS", "Приволжский", "445240", "Самарская", "обл", "UTC+4" },
                    { 781, "", "", "Отрадный", "Самарская обл, г Отрадный", "г", "Россия", "RUS", "Приволжский", "446300", "Самарская", "обл", "UTC+4" },
                    { 782, "", "", "Похвистнево", "Самарская обл, г Похвистнево", "г", "Россия", "RUS", "Приволжский", "446450", "Самарская", "обл", "UTC+4" },
                    { 783, "", "", "Самара", "г Самара", "г", "Россия", "RUS", "Приволжский", "443000", "Самарская", "обл", "UTC+4" },
                    { 784, "", "", "Сызрань", "Самарская обл, г Сызрань", "г", "Россия", "RUS", "Приволжский", "446000", "Самарская", "обл", "UTC+4" },
                    { 785, "", "", "Тольятти", "Самарская обл, г Тольятти", "г", "Россия", "RUS", "Приволжский", "445000", "Самарская", "обл", "UTC+4" },
                    { 786, "", "", "Чапаевск", "Самарская обл, г Чапаевск", "г", "Россия", "RUS", "Приволжский", "446100", "Самарская", "обл", "UTC+4" },
                    { 787, "", "", "Санкт-Петербург", "г Санкт-Петербург", "", "Россия", "RUS", "Северо-Западный", "190000", "Санкт-Петербург", "г", "UTC+3" },
                    { 788, "Аркадакский", "р-н", "Аркадак", "Саратовская обл, г Аркадак", "г", "Россия", "RUS", "Приволжский", "412210", "Саратовская", "обл", "UTC+4" },
                    { 789, "", "", "Аткарск", "Саратовская обл, г Аткарск", "г", "Россия", "RUS", "Приволжский", "412420", "Саратовская", "обл", "UTC+4" },
                    { 790, "", "", "Балаково", "Саратовская обл, г Балаково", "г", "Россия", "RUS", "Приволжский", "413840", "Саратовская", "обл", "UTC+4" },
                    { 791, "", "", "Балашов", "Саратовская обл, г Балашов", "г", "Россия", "RUS", "Приволжский", "412300", "Саратовская", "обл", "UTC+4" },
                    { 792, "", "", "Вольск", "Саратовская обл, г Вольск", "г", "Россия", "RUS", "Приволжский", "412900", "Саратовская", "обл", "UTC+4" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 793, "Ершовский", "р-н", "Ершов", "Саратовская обл, г Ершов", "г", "Россия", "RUS", "Приволжский", "413500", "Саратовская", "обл", "UTC+4" },
                    { 794, "Калининский", "р-н", "Калининск", "Саратовская обл, г Калининск", "г", "Россия", "RUS", "Приволжский", "412480", "Саратовская", "обл", "UTC+4" },
                    { 795, "", "", "Красноармейск", "Саратовская обл, г Красноармейск", "г", "Россия", "RUS", "Приволжский", "412800", "Саратовская", "обл", "UTC+4" },
                    { 796, "Краснокутский", "р-н", "Красный Кут", "Саратовская обл, г Красный Кут", "г", "Россия", "RUS", "Приволжский", "413230", "Саратовская", "обл", "UTC+4" },
                    { 797, "", "", "Маркс", "Саратовская обл, г Маркс", "г", "Россия", "RUS", "Приволжский", "413090", "Саратовская", "обл", "UTC+4" },
                    { 798, "Новоузенский", "р-н", "Новоузенск", "Саратовская обл, г Новоузенск", "г", "Россия", "RUS", "Приволжский", "413360", "Саратовская", "обл", "UTC+4" },
                    { 799, "Петровский", "р-н", "Петровск", "Саратовская обл, г Петровск", "г", "Россия", "RUS", "Приволжский", "412540", "Саратовская", "обл", "UTC+4" },
                    { 800, "", "", "Пугачев", "Саратовская обл, г Пугачев", "г", "Россия", "RUS", "Приволжский", "413720", "Саратовская", "обл", "UTC+4" },
                    { 801, "", "", "Ртищево", "Саратовская обл, г Ртищево", "г", "Россия", "RUS", "Приволжский", "412030", "Саратовская", "обл", "UTC+4" },
                    { 802, "", "", "Саратов", "г Саратов", "г", "Россия", "RUS", "Приволжский", "410000", "Саратовская", "обл", "UTC+4" },
                    { 803, "", "", "Хвалынск", "Саратовская обл, г Хвалынск", "г", "Россия", "RUS", "Приволжский", "412780", "Саратовская", "обл", "UTC+4" },
                    { 804, "", "", "Шиханы", "Саратовская обл, г Шиханы", "г", "Россия", "RUS", "Приволжский", "412950", "Саратовская", "обл", "UTC+4" },
                    { 805, "", "", "Энгельс", "Саратовская обл, г Энгельс", "г", "Россия", "RUS", "Приволжский", "413100", "Саратовская", "обл", "UTC+4" },
                    { 806, "Александровск-Сахалинский", "р-н", "Александровск-Сахалинский", "Сахалинская обл, г Александровск-Сахалинский", "г", "Россия", "RUS", "Дальневосточный", "694420", "Сахалинская", "обл", "UTC+11" },
                    { 807, "Анивский", "р-н", "Анива", "Сахалинская обл, г Анива", "г", "Россия", "RUS", "Дальневосточный", "694030", "Сахалинская", "обл", "UTC+11" },
                    { 808, "Долинский", "р-н", "Долинск", "Сахалинская обл, г Долинск", "г", "Россия", "RUS", "Дальневосточный", "694051", "Сахалинская", "обл", "UTC+11" },
                    { 809, "Корсаковский", "р-н", "Корсаков", "Сахалинская обл, г Корсаков", "г", "Россия", "RUS", "Дальневосточный", "694020", "Сахалинская", "обл", "UTC+11" },
                    { 810, "Курильский", "р-н", "Курильск", "Сахалинская обл, г Курильск", "г", "Россия", "RUS", "Дальневосточный", "694530", "Сахалинская", "обл", "UTC+11" },
                    { 811, "Макаровский", "р-н", "Макаров", "Сахалинская обл, г Макаров", "г", "Россия", "RUS", "Дальневосточный", "694140", "Сахалинская", "обл", "UTC+11" },
                    { 812, "Невельский", "р-н", "Невельск", "Сахалинская обл, г Невельск", "г", "Россия", "RUS", "Дальневосточный", "694740", "Сахалинская", "обл", "UTC+11" },
                    { 813, "Охинский", "р-н", "Оха", "Сахалинская обл, г Оха", "г", "Россия", "RUS", "Дальневосточный", "694490", "Сахалинская", "обл", "UTC+11" },
                    { 814, "Поронайский", "р-н", "Поронайск", "Сахалинская обл, г Поронайск", "г", "Россия", "RUS", "Дальневосточный", "694240", "Сахалинская", "обл", "UTC+11" },
                    { 815, "Северо-Курильский", "р-н", "Северо-Курильск", "Сахалинская обл, г Северо-Курильск", "г", "Россия", "RUS", "Дальневосточный", "694550", "Сахалинская", "обл", "UTC+11" },
                    { 816, "Томаринский", "р-н", "Томари", "Сахалинская обл, г Томари", "г", "Россия", "RUS", "Дальневосточный", "694820", "Сахалинская", "обл", "UTC+11" },
                    { 817, "Углегорский", "р-н", "Углегорск", "Сахалинская обл, г Углегорск", "г", "Россия", "RUS", "Дальневосточный", "694920", "Сахалинская", "обл", "UTC+11" },
                    { 818, "Холмский", "р-н", "Холмск", "Сахалинская обл, г Холмск", "г", "Россия", "RUS", "Дальневосточный", "694620", "Сахалинская", "обл", "UTC+11" },
                    { 819, "", "", "Южно-Сахалинск", "г Южно-Сахалинск", "г", "Россия", "RUS", "Дальневосточный", "693000", "Сахалинская", "обл", "UTC+11" },
                    { 820, "", "", "Алапаевск", "Свердловская обл, г Алапаевск", "г", "Россия", "RUS", "Уральский", "624600", "Свердловская", "обл", "UTC+5" },
                    { 821, "Сысертский", "р-н", "Арамиль", "Свердловская обл, Сысертский р-н, г Арамиль", "г", "Россия", "RUS", "Уральский", "624000", "Свердловская", "обл", "UTC+5" },
                    { 822, "Артемовский", "р-н", "Артемовский", "Свердловская обл, г Артемовский", "г", "Россия", "RUS", "Уральский", "623780", "Свердловская", "обл", "UTC+5" },
                    { 823, "", "", "Асбест", "Свердловская обл, г Асбест", "г", "Россия", "RUS", "Уральский", "624260", "Свердловская", "обл", "UTC+5" },
                    { 824, "", "", "Березовский", "Свердловская обл, г Березовский", "г", "Россия", "RUS", "Уральский", "623700", "Свердловская", "обл", "UTC+5" },
                    { 825, "Богдановичский", "р-н", "Богданович", "Свердловская обл, Богдановичский р-н, г Богданович", "г", "Россия", "RUS", "Уральский", "623530", "Свердловская", "обл", "UTC+5" },
                    { 826, "", "", "Верхний Тагил", "Свердловская обл, г Верхний Тагил", "г", "Россия", "RUS", "Уральский", "624160", "Свердловская", "обл", "UTC+5" },
                    { 827, "", "", "Верхняя Пышма", "Свердловская обл, г Верхняя Пышма", "г", "Россия", "RUS", "Уральский", "624090", "Свердловская", "обл", "UTC+5" },
                    { 828, "", "", "Верхняя Салда", "Свердловская обл, г Верхняя Салда", "г", "Россия", "RUS", "Уральский", "624760", "Свердловская", "обл", "UTC+5" },
                    { 829, "", "", "Верхняя Тура", "Свердловская обл, г Верхняя Тура", "г", "Россия", "RUS", "Уральский", "624320", "Свердловская", "обл", "UTC+5" },
                    { 830, "Верхотурский", "р-н", "Верхотурье", "Свердловская обл, г Верхотурье", "г", "Россия", "RUS", "Уральский", "624380", "Свердловская", "обл", "UTC+5" },
                    { 831, "", "", "Волчанск", "Свердловская обл, г Волчанск", "г", "Россия", "RUS", "Уральский", "624940", "Свердловская", "обл", "UTC+5" },
                    { 832, "", "", "Дегтярск", "Свердловская обл, г Дегтярск", "г", "Россия", "RUS", "Уральский", "623270", "Свердловская", "обл", "UTC+5" },
                    { 833, "", "", "Екатеринбург", "г Екатеринбург", "г", "Россия", "RUS", "Уральский", "620000", "Свердловская", "обл", "UTC+5" },
                    { 834, "", "", "Заречный", "Свердловская обл, г Заречный", "г", "Россия", "RUS", "Уральский", "624250", "Свердловская", "обл", "UTC+5" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 835, "", "", "Ивдель", "Свердловская обл, г Ивдель", "г", "Россия", "RUS", "Уральский", "624590", "Свердловская", "обл", "UTC+5" },
                    { 836, "", "", "Ирбит", "Свердловская обл, г Ирбит", "г", "Россия", "RUS", "Уральский", "623850", "Свердловская", "обл", "UTC+5" },
                    { 837, "", "", "Каменск-Уральский", "Свердловская обл, г Каменск-Уральский", "г", "Россия", "RUS", "Уральский", "623400", "Свердловская", "обл", "UTC+5" },
                    { 838, "", "", "Камышлов", "Свердловская обл, г Камышлов", "г", "Россия", "RUS", "Уральский", "624860", "Свердловская", "обл", "UTC+5" },
                    { 839, "", "", "Карпинск", "Свердловская обл, г Карпинск", "г", "Россия", "RUS", "Уральский", "624930", "Свердловская", "обл", "UTC+5" },
                    { 840, "", "", "Качканар", "Свердловская обл, г Качканар", "г", "Россия", "RUS", "Уральский", "624350", "Свердловская", "обл", "UTC+5" },
                    { 841, "", "", "Кировград", "Свердловская обл, г Кировград", "г", "Россия", "RUS", "Уральский", "624140", "Свердловская", "обл", "UTC+5" },
                    { 842, "", "", "Краснотурьинск", "Свердловская обл, г Краснотурьинск", "г", "Россия", "RUS", "Уральский", "624440", "Свердловская", "обл", "UTC+5" },
                    { 843, "", "", "Красноуральск", "Свердловская обл, г Красноуральск", "г", "Россия", "RUS", "Уральский", "624330", "Свердловская", "обл", "UTC+5" },
                    { 844, "", "", "Красноуфимск", "Свердловская обл, г Красноуфимск", "г", "Россия", "RUS", "Уральский", "623300", "Свердловская", "обл", "UTC+5" },
                    { 845, "", "", "Кушва", "Свердловская обл, г Кушва", "г", "Россия", "RUS", "Уральский", "624300", "Свердловская", "обл", "UTC+5" },
                    { 846, "", "", "Лесной", "Свердловская обл, г Лесной", "г", "Россия", "RUS", "Уральский", "624200", "Свердловская", "обл", "UTC+5" },
                    { 847, "Нижнесергинский", "р-н", "Михайловск", "Свердловская обл, Нижнесергинский р-н, г Михайловск", "г", "Россия", "RUS", "Уральский", "623080", "Свердловская", "обл", "UTC+5" },
                    { 848, "", "", "Невьянск", "Свердловская обл, г Невьянск", "г", "Россия", "RUS", "Уральский", "624191", "Свердловская", "обл", "UTC+5" },
                    { 849, "Нижнесергинский", "р-н", "Нижние Серги", "Свердловская обл, г Нижние Серги", "г", "Россия", "RUS", "Уральский", "623090", "Свердловская", "обл", "UTC+5" },
                    { 850, "", "", "Нижний Тагил", "Свердловская обл, г Нижний Тагил", "г", "Россия", "RUS", "Уральский", "622000", "Свердловская", "обл", "UTC+5" },
                    { 851, "", "", "Нижняя Салда", "Свердловская обл, г Нижняя Салда", "г", "Россия", "RUS", "Уральский", "624740", "Свердловская", "обл", "UTC+5" },
                    { 852, "", "", "Нижняя Тура", "Свердловская обл, г Нижняя Тура", "г", "Россия", "RUS", "Уральский", "624220", "Свердловская", "обл", "UTC+5" },
                    { 853, "Новолялинский", "р-н", "Новая Ляля", "Свердловская обл, г Новая Ляля", "г", "Россия", "RUS", "Уральский", "624400", "Свердловская", "обл", "UTC+5" },
                    { 854, "", "", "Новоуральск", "Свердловская обл, г Новоуральск", "г", "Россия", "RUS", "Уральский", "624130", "Свердловская", "обл", "UTC+5" },
                    { 855, "", "", "Первоуральск", "Свердловская обл, г Первоуральск", "г", "Россия", "RUS", "Уральский", "623100", "Свердловская", "обл", "UTC+5" },
                    { 856, "", "", "Полевской", "Свердловская обл, г Полевской", "г", "Россия", "RUS", "Уральский", "623382", "Свердловская", "обл", "UTC+5" },
                    { 857, "", "", "Ревда", "Свердловская обл, г Ревда", "г", "Россия", "RUS", "Уральский", "623280", "Свердловская", "обл", "UTC+5" },
                    { 858, "Режевской", "р-н", "Реж", "Свердловская обл, г Реж", "г", "Россия", "RUS", "Уральский", "623750", "Свердловская", "обл", "UTC+5" },
                    { 859, "", "", "Североуральск", "Свердловская обл, г Североуральск", "г", "Россия", "RUS", "Уральский", "624480", "Свердловская", "обл", "UTC+5" },
                    { 860, "", "", "Серов", "Свердловская обл, г Серов", "г", "Россия", "RUS", "Уральский", "624981", "Свердловская", "обл", "UTC+5" },
                    { 861, "", "", "Среднеуральск", "Свердловская обл, г Среднеуральск", "г", "Россия", "RUS", "Уральский", "624070", "Свердловская", "обл", "UTC+5" },
                    { 862, "Сухоложский", "р-н", "Сухой Лог", "Свердловская обл, Сухоложский р-н, г Сухой Лог", "г", "Россия", "RUS", "Уральский", "624800", "Свердловская", "обл", "UTC+5" },
                    { 863, "Сысертский", "р-н", "Сысерть", "Свердловская обл, г Сысерть", "г", "Россия", "RUS", "Уральский", "624021", "Свердловская", "обл", "UTC+5" },
                    { 864, "", "", "Тавда", "Свердловская обл, г Тавда", "г", "Россия", "RUS", "Уральский", "623950", "Свердловская", "обл", "UTC+5" },
                    { 865, "Талицкий", "р-н", "Талица", "Свердловская обл, г Талица", "г", "Россия", "RUS", "Уральский", "623640", "Свердловская", "обл", "UTC+5" },
                    { 866, "Туринский", "р-н", "Туринск", "Свердловская обл, г Туринск", "г", "Россия", "RUS", "Уральский", "623900", "Свердловская", "обл", "UTC+5" },
                    { 867, "", "", "Севастополь", "г Севастополь", "", "Россия", "RUS", "Южный", "299700", "Севастополь", "г", "UTC+3" },
                    { 868, "Алагирский", "р-н", "Алагир", "Респ Северная Осетия - Алания, г Алагир", "г", "Россия", "RUS", "Северо-Кавказский", "363240", "Северная Осетия - Алания", "Респ", "UTC+3" },
                    { 869, "Ардонский", "р-н", "Ардон", "Респ Северная Осетия - Алания, г Ардон", "г", "Россия", "RUS", "Северо-Кавказский", "363331", "Северная Осетия - Алания", "Респ", "UTC+3" },
                    { 870, "Правобережный", "р-н", "Беслан", "Респ Северная Осетия - Алания, г Беслан", "г", "Россия", "RUS", "Северо-Кавказский", "363020", "Северная Осетия - Алания", "Респ", "UTC+3" },
                    { 871, "", "", "Владикавказ", "г Владикавказ", "г", "Россия", "RUS", "Северо-Кавказский", "362000", "Северная Осетия - Алания", "Респ", "UTC+3" },
                    { 872, "Дигорский", "р-н", "Дигора", "Респ Северная Осетия - Алания, г Дигора", "г", "Россия", "RUS", "Северо-Кавказский", "363410", "Северная Осетия - Алания", "Респ", "UTC+3" },
                    { 873, "Моздокский", "р-н", "Моздок", "Респ Северная Осетия - Алания, г Моздок", "г", "Россия", "RUS", "Северо-Кавказский", "363750", "Северная Осетия - Алания", "Респ", "UTC+3" },
                    { 874, "Велижский", "р-н", "Велиж", "Смоленская обл, г Велиж", "г", "Россия", "RUS", "Центральный", "216290", "Смоленская", "обл", "UTC+3" },
                    { 875, "Вяземский", "р-н", "Вязьма", "Смоленская обл, г Вязьма", "г", "Россия", "RUS", "Центральный", "215110", "Смоленская", "обл", "UTC+3" },
                    { 876, "Гагаринский", "р-н", "Гагарин", "Смоленская обл, г Гагарин", "г", "Россия", "RUS", "Центральный", "215010", "Смоленская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 877, "Демидовский", "р-н", "Демидов", "Смоленская обл, г Демидов", "г", "Россия", "RUS", "Центральный", "216240", "Смоленская", "обл", "UTC+3" },
                    { 878, "", "", "Десногорск", "Смоленская обл, г Десногорск", "г", "Россия", "RUS", "Центральный", "216400", "Смоленская", "обл", "UTC+3" },
                    { 879, "Дорогобужский", "р-н", "Дорогобуж", "Смоленская обл, г Дорогобуж", "г", "Россия", "RUS", "Центральный", "215710", "Смоленская", "обл", "UTC+3" },
                    { 880, "Духовщинский", "р-н", "Духовщина", "Смоленская обл, г Духовщина", "г", "Россия", "RUS", "Центральный", "216200", "Смоленская", "обл", "UTC+3" },
                    { 881, "Ельнинский", "р-н", "Ельня", "Смоленская обл, г Ельня", "г", "Россия", "RUS", "Центральный", "216330", "Смоленская", "обл", "UTC+3" },
                    { 882, "Починковский", "р-н", "Починок", "Смоленская обл, г Починок", "г", "Россия", "RUS", "Центральный", "216450", "Смоленская", "обл", "UTC+3" },
                    { 883, "Рославльский", "р-н", "Рославль", "Смоленская обл, г Рославль", "г", "Россия", "RUS", "Центральный", "216500", "Смоленская", "обл", "UTC+3" },
                    { 884, "Руднянский", "р-н", "Рудня", "Смоленская обл, г Рудня", "г", "Россия", "RUS", "Центральный", "216790", "Смоленская", "обл", "UTC+3" },
                    { 885, "Сафоновский", "р-н", "Сафоново", "Смоленская обл, г Сафоново", "г", "Россия", "RUS", "Центральный", "215500", "Смоленская", "обл", "UTC+3" },
                    { 886, "", "", "Смоленск", "г Смоленск", "г", "Россия", "RUS", "Центральный", "214000", "Смоленская", "обл", "UTC+3" },
                    { 887, "Сычевский", "р-н", "Сычевка", "Смоленская обл, г Сычевка", "г", "Россия", "RUS", "Центральный", "215279", "Смоленская", "обл", "UTC+3" },
                    { 888, "Ярцевский", "р-н", "Ярцево", "Смоленская обл, г Ярцево", "г", "Россия", "RUS", "Центральный", "215800", "Смоленская", "обл", "UTC+3" },
                    { 889, "Благодарненский", "р-н", "Благодарный", "Ставропольский край, г Благодарный", "г", "Россия", "RUS", "Северо-Кавказский", "356420", "Ставропольский", "край", "UTC+3" },
                    { 890, "Буденновский", "р-н", "Буденновск", "Ставропольский край, г Буденновск", "г", "Россия", "RUS", "Северо-Кавказский", "356800", "Ставропольский", "край", "UTC+3" },
                    { 891, "", "", "Георгиевск", "Ставропольский край, г Георгиевск", "г", "Россия", "RUS", "Северо-Кавказский", "357820", "Ставропольский", "край", "UTC+3" },
                    { 892, "", "", "Ессентуки", "Ставропольский край, г Ессентуки", "г", "Россия", "RUS", "Северо-Кавказский", "357600", "Ставропольский", "край", "UTC+3" },
                    { 893, "", "", "Железноводск", "Ставропольский край, г Железноводск", "г", "Россия", "RUS", "Северо-Кавказский", "357400", "Ставропольский", "край", "UTC+3" },
                    { 894, "Советский", "р-н", "Зеленокумск", "Ставропольский край, г Зеленокумск", "г", "Россия", "RUS", "Северо-Кавказский", "357910", "Ставропольский", "край", "UTC+3" },
                    { 895, "Изобильненский", "р-н", "Изобильный", "Ставропольский край, г Изобильный", "г", "Россия", "RUS", "Северо-Кавказский", "356140", "Ставропольский", "край", "UTC+3" },
                    { 896, "Ипатовский", "р-н", "Ипатово", "Ставропольский край, г Ипатово", "г", "Россия", "RUS", "Северо-Кавказский", "356630", "Ставропольский", "край", "UTC+3" },
                    { 897, "", "", "Кисловодск", "Ставропольский край, г Кисловодск", "г", "Россия", "RUS", "Северо-Кавказский", "357700", "Ставропольский", "край", "UTC+3" },
                    { 898, "", "", "Лермонтов", "Ставропольский край, г Лермонтов", "г", "Россия", "RUS", "Северо-Кавказский", "357340", "Ставропольский", "край", "UTC+3" },
                    { 899, "Минераловодский", "р-н", "Минеральные Воды", "Ставропольский край, г Минеральные Воды", "г", "Россия", "RUS", "Северо-Кавказский", "357200", "Ставропольский", "край", "UTC+3" },
                    { 900, "Шпаковский", "р-н", "Михайловск", "Ставропольский край, г Михайловск", "г", "Россия", "RUS", "Северо-Кавказский", "356240", "Ставропольский", "край", "UTC+3" },
                    { 901, "", "", "Невинномысск", "Ставропольский край, г Невинномысск", "г", "Россия", "RUS", "Северо-Кавказский", "357100", "Ставропольский", "край", "UTC+3" },
                    { 902, "Нефтекумский", "р-н", "Нефтекумск", "Ставропольский край, г Нефтекумск", "г", "Россия", "RUS", "Северо-Кавказский", "356880", "Ставропольский", "край", "UTC+3" },
                    { 903, "Новоалександровский", "р-н", "Новоалександровск", "Ставропольский край, г Новоалександровск", "г", "Россия", "RUS", "Северо-Кавказский", "356000", "Ставропольский", "край", "UTC+3" },
                    { 904, "Кировский", "р-н", "Новопавловск", "Ставропольский край, г Новопавловск", "г", "Россия", "RUS", "Северо-Кавказский", "357300", "Ставропольский", "край", "UTC+3" },
                    { 905, "", "", "Пятигорск", "Ставропольский край, г Пятигорск", "г", "Россия", "RUS", "Северо-Кавказский", "357500", "Ставропольский", "край", "UTC+3" },
                    { 906, "Петровский", "р-н", "Светлоград", "Ставропольский край, г Светлоград", "г", "Россия", "RUS", "Северо-Кавказский", "356530", "Ставропольский", "край", "UTC+3" },
                    { 907, "", "", "Ставрополь", "г Ставрополь", "г", "Россия", "RUS", "Северо-Кавказский", "355000", "Ставропольский", "край", "UTC+3" },
                    { 908, "Жердевский", "р-н", "Жердевка", "Тамбовская обл, г Жердевка", "г", "Россия", "RUS", "Центральный", "393670", "Тамбовская", "обл", "UTC+3" },
                    { 909, "", "", "Кирсанов", "Тамбовская обл, г Кирсанов", "г", "Россия", "RUS", "Центральный", "393360", "Тамбовская", "обл", "UTC+3" },
                    { 910, "", "", "Котовск", "Тамбовская обл, г Котовск", "г", "Россия", "RUS", "Центральный", "393190", "Тамбовская", "обл", "UTC+3" },
                    { 911, "", "", "Мичуринск", "Тамбовская обл, г Мичуринск", "г", "Россия", "RUS", "Центральный", "393760", "Тамбовская", "обл", "UTC+3" },
                    { 912, "", "", "Моршанск", "Тамбовская обл, г Моршанск", "г", "Россия", "RUS", "Центральный", "393950", "Тамбовская", "обл", "UTC+3" },
                    { 913, "", "", "Рассказово", "Тамбовская обл, г Рассказово", "г", "Россия", "RUS", "Центральный", "393250", "Тамбовская", "обл", "UTC+3" },
                    { 914, "", "", "Тамбов", "г Тамбов", "г", "Россия", "RUS", "Центральный", "392000", "Тамбовская", "обл", "UTC+3" },
                    { 915, "", "", "Уварово", "Тамбовская обл, г Уварово", "г", "Россия", "RUS", "Центральный", "393460", "Тамбовская", "обл", "UTC+3" },
                    { 916, "Агрызский", "р-н", "Агрыз", "Респ Татарстан, г Агрыз", "г", "Россия", "RUS", "Приволжский", "422230", "Татарстан", "Респ", "UTC+3" },
                    { 917, "Азнакаевский", "р-н", "Азнакаево", "Респ Татарстан, г Азнакаево", "г", "Россия", "RUS", "Приволжский", "423330", "Татарстан", "Респ", "UTC+3" },
                    { 918, "Альметьевский", "р-н", "Альметьевск", "Респ Татарстан, г Альметьевск", "г", "Россия", "RUS", "Приволжский", "423403", "Татарстан", "Респ", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 919, "Арский", "р-н", "Арск", "Респ Татарстан, г Арск", "г", "Россия", "RUS", "Приволжский", "422000", "Татарстан", "Респ", "UTC+3" },
                    { 920, "Бавлинский", "р-н", "Бавлы", "Респ Татарстан, г Бавлы", "г", "Россия", "RUS", "Приволжский", "423930", "Татарстан", "Респ", "UTC+3" },
                    { 921, "Спасский", "р-н", "Болгар", "Респ Татарстан, г Болгар", "г", "Россия", "RUS", "Приволжский", "422840", "Татарстан", "Респ", "UTC+3" },
                    { 922, "Бугульминский", "р-н", "Бугульма", "Респ Татарстан, г Бугульма", "г", "Россия", "RUS", "Приволжский", "423230", "Татарстан", "Респ", "UTC+3" },
                    { 923, "Буинский", "р-н", "Буинск", "Респ Татарстан, г Буинск", "г", "Россия", "RUS", "Приволжский", "422430", "Татарстан", "Респ", "UTC+3" },
                    { 924, "Елабужский", "р-н", "Елабуга", "Респ Татарстан, г Елабуга", "г", "Россия", "RUS", "Приволжский", "423600", "Татарстан", "Респ", "UTC+3" },
                    { 925, "Заинский", "р-н", "Заинск", "Респ Татарстан, г Заинск", "г", "Россия", "RUS", "Приволжский", "423520", "Татарстан", "Респ", "UTC+3" },
                    { 926, "Зеленодольский", "р-н", "Зеленодольск", "Респ Татарстан, г Зеленодольск", "г", "Россия", "RUS", "Приволжский", "422521", "Татарстан", "Респ", "UTC+3" },
                    { 927, "Верхнеуслонский", "р-н", "Иннополис", "Респ Татарстан, Верхнеуслонский р-н, г Иннополис", "г", "Россия", "RUS", "Приволжский", "420500", "Татарстан", "Респ", "UTC+3" },
                    { 928, "", "", "Казань", "г Казань", "г", "Россия", "RUS", "Приволжский", "420000", "Татарстан", "Респ", "UTC+3" },
                    { 929, "Кукморский", "р-н", "Кукмор", "Респ Татарстан, г Кукмор", "г", "Россия", "RUS", "Приволжский", "422110", "Татарстан", "Респ", "UTC+3" },
                    { 930, "Лаишевский", "р-н", "Лаишево", "Респ Татарстан, г Лаишево", "г", "Россия", "RUS", "Приволжский", "422610", "Татарстан", "Респ", "UTC+3" },
                    { 931, "Лениногорский", "р-н", "Лениногорск", "Респ Татарстан, г Лениногорск", "г", "Россия", "RUS", "Приволжский", "423250", "Татарстан", "Респ", "UTC+3" },
                    { 932, "Мамадышский", "р-н", "Мамадыш", "Респ Татарстан, г Мамадыш", "г", "Россия", "RUS", "Приволжский", "422190", "Татарстан", "Респ", "UTC+3" },
                    { 933, "Менделеевский", "р-н", "Менделеевск", "Респ Татарстан, г Менделеевск", "г", "Россия", "RUS", "Приволжский", "423650", "Татарстан", "Респ", "UTC+3" },
                    { 934, "Мензелинский", "р-н", "Мензелинск", "Респ Татарстан, г Мензелинск", "г", "Россия", "RUS", "Приволжский", "423700", "Татарстан", "Респ", "UTC+3" },
                    { 935, "", "", "Набережные Челны", "Респ Татарстан, г Набережные Челны", "г", "Россия", "RUS", "Приволжский", "423800", "Татарстан", "Респ", "UTC+3" },
                    { 936, "Нижнекамский", "р-н", "Нижнекамск", "Респ Татарстан, г Нижнекамск", "г", "Россия", "RUS", "Приволжский", "423570", "Татарстан", "Респ", "UTC+3" },
                    { 937, "Нурлатский", "р-н", "Нурлат", "Респ Татарстан, г Нурлат", "г", "Россия", "RUS", "Приволжский", "423040", "Татарстан", "Респ", "UTC+3" },
                    { 938, "Тетюшский", "р-н", "Тетюши", "Респ Татарстан, г Тетюши", "г", "Россия", "RUS", "Приволжский", "422370", "Татарстан", "Респ", "UTC+3" },
                    { 939, "Чистопольский", "р-н", "Чистополь", "Респ Татарстан, г Чистополь", "г", "Россия", "RUS", "Приволжский", "422951", "Татарстан", "Респ", "UTC+3" },
                    { 940, "", "", "Андреаполь", "Тверская обл, г Андреаполь", "г", "Россия", "RUS", "Центральный", "172800", "Тверская", "обл", "UTC+3" },
                    { 941, "Бежецкий", "р-н", "Бежецк", "Тверская обл, г Бежецк", "г", "Россия", "RUS", "Центральный", "171980", "Тверская", "обл", "UTC+3" },
                    { 942, "Бельский", "р-н", "Белый", "Тверская обл, г Белый", "г", "Россия", "RUS", "Центральный", "172530", "Тверская", "обл", "UTC+3" },
                    { 943, "Бологовский", "р-н", "Бологое", "Тверская обл, г Бологое", "г", "Россия", "RUS", "Центральный", "171070", "Тверская", "обл", "UTC+3" },
                    { 944, "", "", "Весьегонск", "Тверская обл, г Весьегонск", "г", "Россия", "RUS", "Центральный", "171720", "Тверская", "обл", "UTC+3" },
                    { 945, "", "", "Вышний Волочек", "Тверская обл, г Вышний Волочек", "г", "Россия", "RUS", "Центральный", "171150", "Тверская", "обл", "UTC+3" },
                    { 946, "", "", "Западная Двина", "Тверская обл, г Западная Двина", "г", "Россия", "RUS", "Центральный", "172610", "Тверская", "обл", "UTC+3" },
                    { 947, "Зубцовский", "р-н", "Зубцов", "Тверская обл, г Зубцов", "г", "Россия", "RUS", "Центральный", "172332", "Тверская", "обл", "UTC+3" },
                    { 948, "Калязинский", "р-н", "Калязин", "Тверская обл, г Калязин", "г", "Россия", "RUS", "Центральный", "171571", "Тверская", "обл", "UTC+3" },
                    { 949, "", "", "Кашин", "Тверская обл, г Кашин", "г", "Россия", "RUS", "Центральный", "171640", "Тверская", "обл", "UTC+3" },
                    { 950, "", "", "Кимры", "Тверская обл, г Кимры", "г", "Россия", "RUS", "Центральный", "171500", "Тверская", "обл", "UTC+3" },
                    { 951, "Конаковский", "р-н", "Конаково", "Тверская обл, г Конаково", "г", "Россия", "RUS", "Центральный", "171250", "Тверская", "обл", "UTC+3" },
                    { 952, "", "", "Красный Холм", "Тверская обл, г Красный Холм", "г", "Россия", "RUS", "Центральный", "171660", "Тверская", "обл", "UTC+3" },
                    { 953, "Кувшиновский", "р-н", "Кувшиново", "Тверская обл, г Кувшиново", "г", "Россия", "RUS", "Центральный", "172110", "Тверская", "обл", "UTC+3" },
                    { 954, "Лихославльский", "р-н", "Лихославль", "Тверская обл, г Лихославль", "г", "Россия", "RUS", "Центральный", "171210", "Тверская", "обл", "UTC+3" },
                    { 955, "", "", "Нелидово", "Тверская обл, г Нелидово", "г", "Россия", "RUS", "Центральный", "172520", "Тверская", "обл", "UTC+3" },
                    { 956, "", "", "Осташков", "Тверская обл, г Осташков", "г", "Россия", "RUS", "Центральный", "172730", "Тверская", "обл", "UTC+3" },
                    { 957, "", "", "Ржев", "Тверская обл, г Ржев", "г", "Россия", "RUS", "Центральный", "172380", "Тверская", "обл", "UTC+3" },
                    { 958, "Старицкий", "р-н", "Старица", "Тверская обл, г Старица", "г", "Россия", "RUS", "Центральный", "171360", "Тверская", "обл", "UTC+3" },
                    { 959, "", "", "Тверь", "г Тверь", "г", "Россия", "RUS", "Центральный", "170000", "Тверская", "обл", "UTC+3" },
                    { 960, "", "", "Торжок", "Тверская обл, г Торжок", "г", "Россия", "RUS", "Центральный", "172000", "Тверская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 961, "Торопецкий", "р-н", "Торопец", "Тверская обл, г Торопец", "г", "Россия", "RUS", "Центральный", "172842", "Тверская", "обл", "UTC+3" },
                    { 962, "", "", "Удомля", "Тверская обл, г Удомля", "г", "Россия", "RUS", "Центральный", "171841", "Тверская", "обл", "UTC+3" },
                    { 963, "Асиновский", "р-н", "Асино", "Томская обл, г Асино", "г", "Россия", "RUS", "Сибирский", "636840", "Томская", "обл", "UTC+7" },
                    { 964, "", "", "Кедровый", "Томская обл, г Кедровый", "г", "Россия", "RUS", "Сибирский", "636615", "Томская", "обл", "UTC+7" },
                    { 965, "Колпашевский", "р-н", "Колпашево", "Томская обл, г Колпашево", "г", "Россия", "RUS", "Сибирский", "636460", "Томская", "обл", "UTC+7" },
                    { 966, "", "", "Северск", "Томская обл, г Северск", "г", "Россия", "RUS", "Сибирский", "636000", "Томская", "обл", "UTC+7" },
                    { 967, "", "", "Стрежевой", "Томская обл, г Стрежевой", "г", "Россия", "RUS", "Сибирский", "636780", "Томская", "обл", "UTC+7" },
                    { 968, "", "", "Томск", "г Томск", "г", "Россия", "RUS", "Сибирский", "634000", "Томская", "обл", "UTC+7" },
                    { 969, "Алексинский", "р-н", "Алексин", "Тульская обл, г Алексин", "г", "Россия", "RUS", "Центральный", "301352", "Тульская", "обл", "UTC+3" },
                    { 970, "Белевский", "р-н", "Белев", "Тульская обл, г Белев", "г", "Россия", "RUS", "Центральный", "301530", "Тульская", "обл", "UTC+3" },
                    { 971, "Богородицкий", "р-н", "Богородицк", "Тульская обл, г Богородицк", "г", "Россия", "RUS", "Центральный", "301830", "Тульская", "обл", "UTC+3" },
                    { 972, "Киреевский", "р-н", "Болохово", "Тульская обл, Киреевский р-н, г Болохово", "г", "Россия", "RUS", "Центральный", "301280", "Тульская", "обл", "UTC+3" },
                    { 973, "Веневский", "р-н", "Венев", "Тульская обл, г Венев", "г", "Россия", "RUS", "Центральный", "301320", "Тульская", "обл", "UTC+3" },
                    { 974, "", "", "Донской", "Тульская обл, г Донской", "г", "Россия", "RUS", "Центральный", "301760", "Тульская", "обл", "UTC+3" },
                    { 975, "Ефремовский", "р-н", "Ефремов", "Тульская обл, г Ефремов", "г", "Россия", "RUS", "Центральный", "301840", "Тульская", "обл", "UTC+3" },
                    { 976, "Кимовский", "р-н", "Кимовск", "Тульская обл, г Кимовск", "г", "Россия", "RUS", "Центральный", "301720", "Тульская", "обл", "UTC+3" },
                    { 977, "Киреевский", "р-н", "Киреевск", "Тульская обл, г Киреевск", "г", "Россия", "RUS", "Центральный", "301260", "Тульская", "обл", "UTC+3" },
                    { 978, "Киреевский", "р-н", "Липки", "Тульская обл, Киреевский р-н, г Липки", "г", "Россия", "RUS", "Центральный", "301264", "Тульская", "обл", "UTC+3" },
                    { 979, "Новомосковский", "р-н", "Новомосковск", "Тульская обл, г Новомосковск", "г", "Россия", "RUS", "Центральный", "301650", "Тульская", "обл", "UTC+3" },
                    { 980, "Плавский", "р-н", "Плавск", "Тульская обл, г Плавск", "г", "Россия", "RUS", "Центральный", "301470", "Тульская", "обл", "UTC+3" },
                    { 981, "Щекинский", "р-н", "Советск", "Тульская обл, Щекинский р-н, г Советск", "г", "Россия", "RUS", "Центральный", "301205", "Тульская", "обл", "UTC+3" },
                    { 982, "Суворовский", "р-н", "Суворов", "Тульская обл, г Суворов", "г", "Россия", "RUS", "Центральный", "301430", "Тульская", "обл", "UTC+3" },
                    { 983, "", "", "Тула", "г Тула", "г", "Россия", "RUS", "Центральный", "300000", "Тульская", "обл", "UTC+3" },
                    { 984, "Узловский", "р-н", "Узловая", "Тульская обл, г Узловая", "г", "Россия", "RUS", "Центральный", "301600", "Тульская", "обл", "UTC+3" },
                    { 985, "Суворовский", "р-н", "Чекалин", "Тульская обл, Суворовский р-н, г Чекалин", "г", "Россия", "RUS", "Центральный", "301414", "Тульская", "обл", "UTC+3" },
                    { 986, "Щекинский", "р-н", "Щекино", "Тульская обл, г Щекино", "г", "Россия", "RUS", "Центральный", "301240", "Тульская", "обл", "UTC+3" },
                    { 987, "Ясногорский", "р-н", "Ясногорск", "Тульская обл, г Ясногорск", "г", "Россия", "RUS", "Центральный", "301030", "Тульская", "обл", "UTC+3" },
                    { 988, "", "", "Ак-Довурак", "Респ Тыва, г Ак-Довурак", "г", "Россия", "RUS", "Сибирский", "668050", "Тыва", "Респ", "UTC+7" },
                    { 989, "", "", "Кызыл", "г Кызыл", "г", "Россия", "RUS", "Сибирский", "667000", "Тыва", "Респ", "UTC+7" },
                    { 990, "Пий-Хемский", "р-н", "Туран", "Респ Тыва, г Туран", "г", "Россия", "RUS", "Сибирский", "668510", "Тыва", "Респ", "UTC+7" },
                    { 991, "Дзун-Хемчикский", "р-н", "Чадан", "Респ Тыва, г Чадан", "г", "Россия", "RUS", "Сибирский", "668110", "Тыва", "Респ", "UTC+7" },
                    { 992, "Улуг-Хемский", "р-н", "Шагонар", "Респ Тыва, г Шагонар", "г", "Россия", "RUS", "Сибирский", "668210", "Тыва", "Респ", "UTC+7" },
                    { 993, "", "", "Заводоуковск", "Тюменская обл, г Заводоуковск", "г", "Россия", "RUS", "Уральский", "627140", "Тюменская", "обл", "UTC+5" },
                    { 994, "", "", "Ишим", "Тюменская обл, г Ишим", "г", "Россия", "RUS", "Уральский", "627705", "Тюменская", "обл", "UTC+5" },
                    { 995, "", "", "Тобольск", "Тюменская обл, г Тобольск", "г", "Россия", "RUS", "Уральский", "626150", "Тюменская", "обл", "UTC+5" },
                    { 996, "", "", "Тюмень", "г Тюмень", "г", "Россия", "RUS", "Уральский", "625000", "Тюменская", "обл", "UTC+5" },
                    { 997, "", "", "Ялуторовск", "Тюменская обл, г Ялуторовск", "г", "Россия", "RUS", "Уральский", "627010", "Тюменская", "обл", "UTC+5" },
                    { 998, "", "", "Воткинск", "Респ Удмуртская, г Воткинск", "г", "Россия", "RUS", "Приволжский", "427430", "Удмуртская", "Респ", "UTC+4" },
                    { 999, "", "", "Глазов", "Респ Удмуртская, г Глазов", "г", "Россия", "RUS", "Приволжский", "427620", "Удмуртская", "Респ", "UTC+4" },
                    { 1000, "", "", "Ижевск", "г Ижевск", "г", "Россия", "RUS", "Приволжский", "426000", "Удмуртская", "Респ", "UTC+4" },
                    { 1001, "Камбарский", "р-н", "Камбарка", "Респ Удмуртская, г Камбарка", "г", "Россия", "RUS", "Приволжский", "427950", "Удмуртская", "Респ", "UTC+4" },
                    { 1002, "", "", "Можга", "Респ Удмуртская, г Можга", "г", "Россия", "RUS", "Приволжский", "427759", "Удмуртская", "Респ", "UTC+4" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 1003, "", "", "Сарапул", "Респ Удмуртская, г Сарапул", "г", "Россия", "RUS", "Приволжский", "427960", "Удмуртская", "Респ", "UTC+4" },
                    { 1004, "Барышский", "р-н", "Барыш", "Ульяновская обл, Барышский р-н, г Барыш", "г", "Россия", "RUS", "Приволжский", "433750", "Ульяновская", "обл", "UTC+4" },
                    { 1005, "", "", "Димитровград", "Ульяновская обл, г Димитровград", "г", "Россия", "RUS", "Приволжский", "433500", "Ульяновская", "обл", "UTC+4" },
                    { 1006, "Инзенский", "р-н", "Инза", "Ульяновская обл, г Инза", "г", "Россия", "RUS", "Приволжский", "433030", "Ульяновская", "обл", "UTC+4" },
                    { 1007, "", "", "Новоульяновск", "Ульяновская обл, г Новоульяновск", "г", "Россия", "RUS", "Приволжский", "433300", "Ульяновская", "обл", "UTC+4" },
                    { 1008, "Сенгилеевский", "р-н", "Сенгилей", "Ульяновская обл, г Сенгилей", "г", "Россия", "RUS", "Приволжский", "433380", "Ульяновская", "обл", "UTC+4" },
                    { 1009, "", "", "Ульяновск", "г Ульяновск", "г", "Россия", "RUS", "Приволжский", "432000", "Ульяновская", "обл", "UTC+4" },
                    { 1010, "", "", "Амурск", "Хабаровский край, г Амурск", "г", "Россия", "RUS", "Дальневосточный", "682640", "Хабаровский", "край", "UTC+10" },
                    { 1011, "", "", "Бикин", "Хабаровский край, г Бикин", "г", "Россия", "RUS", "Дальневосточный", "682970", "Хабаровский", "край", "UTC+10" },
                    { 1012, "Вяземский", "р-н", "Вяземский", "Хабаровский край, г Вяземский", "г", "Россия", "RUS", "Дальневосточный", "682950", "Хабаровский", "край", "UTC+10" },
                    { 1013, "", "", "Комсомольск-на-Амуре", "Хабаровский край, г Комсомольск-на-Амуре", "г", "Россия", "RUS", "Дальневосточный", "681000", "Хабаровский", "край", "UTC+10" },
                    { 1014, "", "", "Николаевск-на-Амуре", "Хабаровский край, г Николаевск-на-Амуре", "г", "Россия", "RUS", "Дальневосточный", "682460", "Хабаровский", "край", "UTC+10" },
                    { 1015, "", "", "Советская Гавань", "Хабаровский край, г Советская Гавань", "г", "Россия", "RUS", "Дальневосточный", "682800", "Хабаровский", "край", "UTC+10" },
                    { 1016, "", "", "Хабаровск", "г Хабаровск", "г", "Россия", "RUS", "Дальневосточный", "680000", "Хабаровский", "край", "UTC+10" },
                    { 1017, "", "", "Абаза", "Респ Хакасия, г Абаза", "г", "Россия", "RUS", "Сибирский", "655750", "Хакасия", "Респ", "UTC+7" },
                    { 1018, "", "", "Абакан", "г Абакан", "г", "Россия", "RUS", "Сибирский", "655000", "Хакасия", "Респ", "UTC+7" },
                    { 1019, "", "", "Саяногорск", "Респ Хакасия, г Саяногорск", "г", "Россия", "RUS", "Сибирский", "655602", "Хакасия", "Респ", "UTC+7" },
                    { 1020, "", "", "Сорск", "Респ Хакасия, г Сорск", "г", "Россия", "RUS", "Сибирский", "655111", "Хакасия", "Респ", "UTC+7" },
                    { 1021, "", "", "Черногорск", "Респ Хакасия, г Черногорск", "г", "Россия", "RUS", "Сибирский", "655151", "Хакасия", "Респ", "UTC+7" },
                    { 1022, "", "", "Белоярский", "Ханты-Мансийский Автономный округ - Югра АО, г Белоярский", "г", "Россия", "RUS", "Уральский", "628160", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1023, "", "", "Когалым", "Ханты-Мансийский Автономный округ - Югра АО, г Когалым", "г", "Россия", "RUS", "Уральский", "628481", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1024, "", "", "Лангепас", "Ханты-Мансийский Автономный округ - Югра АО, г Лангепас", "г", "Россия", "RUS", "Уральский", "628671", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1025, "Сургутский", "р-н", "Лянтор", "Ханты-Мансийский Автономный округ - Югра АО, Сургутский р-н, г Лянтор", "г", "Россия", "RUS", "Уральский", "628449", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1026, "", "", "Мегион", "Ханты-Мансийский Автономный округ - Югра АО, г Мегион", "г", "Россия", "RUS", "Уральский", "628680", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1027, "", "", "Нефтеюганск", "Ханты-Мансийский Автономный округ - Югра АО, г Нефтеюганск", "г", "Россия", "RUS", "Уральский", "628301", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1028, "", "", "Нижневартовск", "Ханты-Мансийский Автономный округ - Югра АО, г Нижневартовск", "г", "Россия", "RUS", "Уральский", "628600", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1029, "", "", "Нягань", "Ханты-Мансийский Автономный округ - Югра АО, г Нягань", "г", "Россия", "RUS", "Уральский", "628181", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1030, "", "", "Покачи", "Ханты-Мансийский Автономный округ - Югра АО, г Покачи", "г", "Россия", "RUS", "Уральский", "628660", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1031, "", "", "Пыть-Ях", "Ханты-Мансийский Автономный округ - Югра АО, г Пыть-Ях", "г", "Россия", "RUS", "Уральский", "628380", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1032, "", "", "Радужный", "Ханты-Мансийский Автономный округ - Югра АО, г Радужный", "г", "Россия", "RUS", "Уральский", "628461", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1033, "Советский", "р-н", "Советский", "Ханты-Мансийский Автономный округ - Югра АО, г Советский", "г", "Россия", "RUS", "Уральский", "628240", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1034, "", "", "Сургут", "Ханты-Мансийский Автономный округ - Югра АО, г Сургут", "г", "Россия", "RUS", "Уральский", "628400", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1035, "", "", "Урай", "Ханты-Мансийский Автономный округ - Югра АО, г Урай", "г", "Россия", "RUS", "Уральский", "628280", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1036, "", "", "Ханты-Мансийск", "г Ханты-Мансийск", "г", "Россия", "RUS", "Уральский", "628000", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1037, "", "", "Югорск", "Ханты-Мансийский Автономный округ - Югра АО, г Югорск", "г", "Россия", "RUS", "Уральский", "628260", "Ханты-Мансийский Автономный округ - Югра", "АО", "UTC+5" },
                    { 1038, "Ашинский", "р-н", "Аша", "Челябинская обл, г Аша", "г", "Россия", "RUS", "Уральский", "456015", "Челябинская", "обл", "UTC+5" },
                    { 1039, "Саткинский", "р-н", "Бакал", "Челябинская обл, Саткинский р-н, г Бакал", "г", "Россия", "RUS", "Уральский", "456900", "Челябинская", "обл", "UTC+5" },
                    { 1040, "Верхнеуральский", "р-н", "Верхнеуральск", "Челябинская обл, г Верхнеуральск", "г", "Россия", "RUS", "Уральский", "457670", "Челябинская", "обл", "UTC+5" },
                    { 1041, "", "", "Верхний Уфалей", "Челябинская обл, г Верхний Уфалей", "г", "Россия", "RUS", "Уральский", "456800", "Челябинская", "обл", "UTC+5" },
                    { 1042, "Еманжелинский", "р-н", "Еманжелинск", "Челябинская обл, г Еманжелинск", "г", "Россия", "RUS", "Уральский", "456580", "Челябинская", "обл", "UTC+5" },
                    { 1043, "", "", "Златоуст", "Челябинская обл, г Златоуст", "г", "Россия", "RUS", "Уральский", "456200", "Челябинская", "обл", "UTC+5" },
                    { 1044, "", "", "Карабаш", "Челябинская обл, г Карабаш", "г", "Россия", "RUS", "Уральский", "456140", "Челябинская", "обл", "UTC+5" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 1045, "Карталинский", "р-н", "Карталы", "Челябинская обл, г Карталы", "г", "Россия", "RUS", "Уральский", "457353", "Челябинская", "обл", "UTC+5" },
                    { 1046, "Каслинский", "р-н", "Касли", "Челябинская обл, г Касли", "г", "Россия", "RUS", "Уральский", "456833", "Челябинская", "обл", "UTC+5" },
                    { 1047, "Катав-Ивановский", "р-н", "Катав-Ивановск", "Челябинская обл, г Катав-Ивановск", "г", "Россия", "RUS", "Уральский", "456110", "Челябинская", "обл", "UTC+5" },
                    { 1048, "", "", "Копейск", "Челябинская обл, г Копейск", "г", "Россия", "RUS", "Уральский", "456600", "Челябинская", "обл", "UTC+5" },
                    { 1049, "Коркинский", "р-н", "Коркино", "Челябинская обл, г Коркино", "г", "Россия", "RUS", "Уральский", "456550", "Челябинская", "обл", "UTC+5" },
                    { 1050, "Кусинский", "р-н", "Куса", "Челябинская обл, г Куса", "г", "Россия", "RUS", "Уральский", "456940", "Челябинская", "обл", "UTC+5" },
                    { 1051, "", "", "Кыштым", "Челябинская обл, г Кыштым", "г", "Россия", "RUS", "Уральский", "456870", "Челябинская", "обл", "UTC+5" },
                    { 1052, "", "", "Магнитогорск", "Челябинская обл, г Магнитогорск", "г", "Россия", "RUS", "Уральский", "455000", "Челябинская", "обл", "UTC+5" },
                    { 1053, "", "", "Миасс", "Челябинская обл, г Миасс", "г", "Россия", "RUS", "Уральский", "456300", "Челябинская", "обл", "UTC+5" },
                    { 1054, "Ашинский", "р-н", "Миньяр", "Челябинская обл, Ашинский р-н, г Миньяр", "г", "Россия", "RUS", "Уральский", "456007", "Челябинская", "обл", "UTC+5" },
                    { 1055, "Нязепетровский", "р-н", "Нязепетровск", "Челябинская обл, г Нязепетровск", "г", "Россия", "RUS", "Уральский", "456971", "Челябинская", "обл", "UTC+5" },
                    { 1056, "", "", "Озерск", "Челябинская обл, г Озерск", "г", "Россия", "RUS", "Уральский", "456780", "Челябинская", "обл", "UTC+5" },
                    { 1057, "Пластовский", "р-н", "Пласт", "Челябинская обл, г Пласт", "г", "Россия", "RUS", "Уральский", "457020", "Челябинская", "обл", "UTC+5" },
                    { 1058, "Саткинский", "р-н", "Сатка", "Челябинская обл, г Сатка", "г", "Россия", "RUS", "Уральский", "456913", "Челябинская", "обл", "UTC+5" },
                    { 1059, "Ашинский", "р-н", "Сим", "Челябинская обл, Ашинский р-н, г Сим", "г", "Россия", "RUS", "Уральский", "456020", "Челябинская", "обл", "UTC+5" },
                    { 1060, "", "", "Снежинск", "Челябинская обл, г Снежинск", "г", "Россия", "RUS", "Уральский", "456770", "Челябинская", "обл", "UTC+5" },
                    { 1061, "", "", "Трехгорный", "Челябинская обл, г Трехгорный", "г", "Россия", "RUS", "Уральский", "456080", "Челябинская", "обл", "UTC+5" },
                    { 1062, "", "", "Троицк", "Челябинская обл, г Троицк", "г", "Россия", "RUS", "Уральский", "457100", "Челябинская", "обл", "UTC+5" },
                    { 1063, "", "", "Усть-Катав", "Челябинская обл, г Усть-Катав", "г", "Россия", "RUS", "Уральский", "456040", "Челябинская", "обл", "UTC+5" },
                    { 1064, "", "", "Чебаркуль", "Челябинская обл, г Чебаркуль", "г", "Россия", "RUS", "Уральский", "456439", "Челябинская", "обл", "UTC+5" },
                    { 1065, "", "", "Челябинск", "г Челябинск", "г", "Россия", "RUS", "Уральский", "454000", "Челябинская", "обл", "UTC+5" },
                    { 1066, "", "", "Южноуральск", "Челябинская обл, г Южноуральск", "г", "Россия", "RUS", "Уральский", "457040", "Челябинская", "обл", "UTC+5" },
                    { 1067, "Катав-Ивановский", "р-н", "Юрюзань", "Челябинская обл, Катав-Ивановский р-н, г Юрюзань", "г", "Россия", "RUS", "Уральский", "456120", "Челябинская", "обл", "UTC+5" },
                    { 1068, "", "", "Аргун", "Респ Чеченская, г Аргун", "г", "Россия", "RUS", "Северо-Кавказский", "", "Чеченская", "Респ", "UTC+3" },
                    { 1069, "", "", "Грозный", "г Грозный", "г", "Россия", "RUS", "Северо-Кавказский", "364000", "Чеченская", "Респ", "UTC+3" },
                    { 1070, "Гудермесский", "р-н", "Гудермес", "Респ Чеченская, г Гудермес", "г", "Россия", "RUS", "Северо-Кавказский", "366200", "Чеченская", "Респ", "UTC+3" },
                    { 1071, "Курчалоевский", "р-н", "Курчалой", "Респ Чеченская, г Курчалой", "г", "Россия", "RUS", "Северо-Кавказский", "366314", "Чеченская", "Респ", "UTC+3" },
                    { 1072, "Урус-Мартановский", "р-н", "Урус-Мартан", "Респ Чеченская, г Урус-Мартан", "", "Россия", "RUS", "Северо-Кавказский", "366500", "Чеченская", "Респ", "UTC+3" },
                    { 1073, "Шалинский", "р-н", "Шали", "Респ Чеченская, г Шали", "г", "Россия", "RUS", "Северо-Кавказский", "366300", "Чеченская", "Респ", "UTC+3" },
                    { 1074, "", "", "Алатырь", "Чувашская Республика - Чувашия, г Алатырь", "г", "Россия", "RUS", "Приволжский", "429820", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1075, "", "", "Канаш", "Чувашская Республика - Чувашия, г Канаш", "г", "Россия", "RUS", "Приволжский", "429330", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1076, "Козловский", "р-н", "Козловка", "Чувашская Республика - Чувашия, г Козловка", "г", "Россия", "RUS", "Приволжский", "429430", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1077, "Мариинско-Посадский", "р-н", "Мариинский Посад", "Чувашская Республика - Чувашия, г Мариинский Посад", "г", "Россия", "RUS", "Приволжский", "429570", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1078, "", "", "Новочебоксарск", "Чувашская Республика - Чувашия, г Новочебоксарск", "г", "Россия", "RUS", "Приволжский", "429950", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1079, "Цивильский", "р-н", "Цивильск", "Чувашская Республика - Чувашия, г Цивильск", "г", "Россия", "RUS", "Приволжский", "429900", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1080, "", "", "Чебоксары", "г Чебоксары", "г", "Россия", "RUS", "Приволжский", "428000", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1081, "", "", "Шумерля", "Чувашская Республика - Чувашия, г Шумерля", "г", "Россия", "RUS", "Приволжский", "429120", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1082, "Ядринский", "р-н", "Ядрин", "Чувашская Республика - Чувашия, г Ядрин", "г", "Россия", "RUS", "Приволжский", "429061", "Чувашская Республика", "Чувашия", "UTC+3" },
                    { 1083, "", "", "Анадырь", "г Анадырь", "г", "Россия", "RUS", "Дальневосточный", "689000", "Чукотский", "АО", "UTC+12" },
                    { 1084, "Билибинский", "р-н", "Билибино", "Чукотский АО, г Билибино", "г", "Россия", "RUS", "Дальневосточный", "689450", "Чукотский", "АО", "UTC+12" },
                    { 1085, "Чаунский", "р-н", "Певек", "Чукотский АО, г Певек", "г", "Россия", "RUS", "Дальневосточный", "689400", "Чукотский", "АО", "UTC+12" },
                    { 1086, "Алданский", "у", "Алдан", "Респ Саха /Якутия/, г Алдан", "г", "Россия", "RUS", "Дальневосточный", "678900", "Саха /Якутия/", "Респ", "UTC+9" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "RuCities",
                columns: new[] { "Id", "Area", "AreaType", "City", "CityAddress", "CityType", "Country", "CountryIsoCode", "FederalDistrict", "PostalCode", "Region", "RegionType", "TimeZone" },
                values: new object[,]
                {
                    { 1087, "Верхоянский", "у", "Верхоянск", "Респ Саха /Якутия/, у Верхоянский, г Верхоянск", "г", "Россия", "RUS", "Дальневосточный", "678530", "Саха /Якутия/", "Респ", "UTC+10" },
                    { 1088, "Вилюйский", "у", "Вилюйск", "Респ Саха /Якутия/, г Вилюйск", "г", "Россия", "RUS", "Дальневосточный", "678200", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1089, "Ленский", "у", "Ленск", "Респ Саха /Якутия/, г Ленск", "г", "Россия", "RUS", "Дальневосточный", "678141", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1090, "Мирнинский", "у", "Мирный", "Респ Саха /Якутия/, г Мирный", "г", "Россия", "RUS", "Дальневосточный", "678170", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1091, "", "", "Нерюнгри", "Респ Саха /Якутия/, г Нерюнгри", "г", "Россия", "RUS", "Дальневосточный", "678960", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1092, "Нюрбинский", "у", "Нюрба", "Респ Саха /Якутия/, г Нюрба", "г", "Россия", "RUS", "Дальневосточный", "678450", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1093, "Олекминский", "у", "Олекминск", "Респ Саха /Якутия/, г Олекминск", "г", "Россия", "RUS", "Дальневосточный", "678100", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1094, "Хангаласский", "у", "Покровск", "Респ Саха /Якутия/, г Покровск", "г", "Россия", "RUS", "Дальневосточный", "678000", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1095, "Среднеколымский", "у", "Среднеколымск", "Респ Саха /Якутия/, г Среднеколымск", "г", "Россия", "RUS", "Дальневосточный", "678790", "Саха /Якутия/", "Респ", "UTC+11" },
                    { 1096, "Алданский", "у", "Томмот", "Респ Саха /Якутия/, у Алданский, г Томмот", "г", "Россия", "RUS", "Дальневосточный", "678953", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1097, "Мирнинский", "у", "Удачный", "Респ Саха /Якутия/, у Мирнинский, г Удачный", "г", "Россия", "RUS", "Дальневосточный", "678188", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1098, "", "", "Якутск", "г Якутск", "г", "Россия", "RUS", "Дальневосточный", "677000", "Саха /Якутия/", "Респ", "UTC+9" },
                    { 1099, "", "", "Губкинский", "Ямало-Ненецкий АО, г Губкинский", "г", "Россия", "RUS", "Уральский", "629830", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1100, "", "", "Лабытнанги", "Ямало-Ненецкий АО, г Лабытнанги", "г", "Россия", "RUS", "Уральский", "629400", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1101, "", "", "Муравленко", "Ямало-Ненецкий АО, г Муравленко", "г", "Россия", "RUS", "Уральский", "629601", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1102, "", "", "Надым", "Ямало-Ненецкий АО, г Надым", "г", "Россия", "RUS", "Уральский", "629734", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1103, "", "", "Новый Уренгой", "Ямало-Ненецкий АО, г Новый Уренгой", "г", "Россия", "RUS", "Уральский", "629300", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1104, "", "", "Ноябрьск", "Ямало-Ненецкий АО, г Ноябрьск", "г", "Россия", "RUS", "Уральский", "629800", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1105, "", "", "Салехард", "г Салехард", "г", "Россия", "RUS", "Уральский", "629000", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1106, "Пуровский", "р-н", "Тарко-Сале", "Ямало-Ненецкий АО, г Тарко-Сале", "г", "Россия", "RUS", "Уральский", "629850", "Ямало-Ненецкий", "АО", "UTC+5" },
                    { 1107, "Гаврилов-Ямский", "р-н", "Гаврилов-Ям", "Ярославская обл, г Гаврилов-Ям", "г", "Россия", "RUS", "Центральный", "152240", "Ярославская", "обл", "UTC+3" },
                    { 1108, "Даниловский", "р-н", "Данилов", "Ярославская обл, г Данилов", "г", "Россия", "RUS", "Центральный", "152070", "Ярославская", "обл", "UTC+3" },
                    { 1109, "Любимский", "р-н", "Любим", "Ярославская обл, г Любим", "г", "Россия", "RUS", "Центральный", "152470", "Ярославская", "обл", "UTC+3" },
                    { 1110, "Мышкинский", "р-н", "Мышкин", "Ярославская обл, г Мышкин", "г", "Россия", "RUS", "Центральный", "152830", "Ярославская", "обл", "UTC+3" },
                    { 1111, "", "", "Переславль-Залесский", "Ярославская обл, г Переславль-Залесский", "г", "Россия", "RUS", "Центральный", "152020", "Ярославская", "обл", "UTC+3" },
                    { 1112, "Пошехонский", "р-н", "Пошехонье", "Ярославская обл, г Пошехонье", "г", "Россия", "RUS", "Центральный", "152850", "Ярославская", "обл", "UTC+3" },
                    { 1113, "Ростовский", "р-н", "Ростов", "Ярославская обл, г Ростов", "г", "Россия", "RUS", "Центральный", "152150", "Ярославская", "обл", "UTC+3" },
                    { 1114, "Рыбинский", "р-н", "Рыбинск", "Ярославская обл, г Рыбинск", "г", "Россия", "RUS", "Центральный", "152900", "Ярославская", "обл", "UTC+3" },
                    { 1115, "Тутаевский", "р-н", "Тутаев", "Ярославская обл, г Тутаев", "г", "Россия", "RUS", "Центральный", "152300", "Ярославская", "обл", "UTC+3" },
                    { 1116, "Угличский", "р-н", "Углич", "Ярославская обл, г Углич", "г", "Россия", "RUS", "Центральный", "152610", "Ярославская", "обл", "UTC+3" },
                    { 1117, "", "", "Ярославль", "г Ярославль", "г", "Россия", "RUS", "Центральный", "150000", "Ярославская", "обл", "UTC+3" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "UserRoles",
                columns: new[] { "Id", "CreatedBy", "CreatedDate", "Deleted", "ModifiedBy", "ModifiedDate", "Role" },
                values: new object[,]
                {
                    { 1, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "Creator" },
                    { 2, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "Administrator" },
                    { 3, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "Player" },
                    { 4, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "Organizer" },
                    { 5, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "TeamManager" },
                    { 6, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "Sponsor" },
                    { 7, new Guid("00000000-0000-0000-0000-000000000000"), null, null, new Guid("00000000-0000-0000-0000-000000000000"), null, "Merchant" }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "Users",
                columns: new[] { "Id", "CreatedBy", "CreatedDate", "Deleted", "Email", "ModifiedBy", "ModifiedDate", "PasswordHash", "Phone", "Status" },
                values: new object[] { new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3"), new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3"), new DateTime(2021, 12, 2, 1, 50, 0, 0, DateTimeKind.Unspecified), null, "khoruzhenko.work@gmail.com", new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3"), new DateTime(2021, 12, 2, 1, 50, 0, 0, DateTimeKind.Unspecified), "AQAAAAEAACcQAAAAEMQnvSxDqgyc+KNNzIFjcuST/qZGfHVSLT9P+Z3revJP2Q9Tctz8PIeDxj2k7aJkLg==", "89266762453", "Confirmed" });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "UserNavigations",
                columns: new[] { "Id", "CreatedBy", "CreatedDate", "Deleted", "IsDefault", "ModifiedBy", "ModifiedDate", "Title", "UserId" },
                values: new object[,]
                {
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), new Guid("00000000-0000-0000-0000-000000000000"), new DateTime(2021, 12, 24, 14, 48, 34, 557, DateTimeKind.Utc).AddTicks(1309), null, true, new Guid("00000000-0000-0000-0000-000000000000"), new DateTime(2021, 12, 24, 14, 48, 34, 557, DateTimeKind.Utc).AddTicks(1309), "Навигация менеджера команды", new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3") },
                    { new Guid("ce5f70ec-80ed-4b09-a0ff-6c80df8e93b6"), new Guid("00000000-0000-0000-0000-000000000000"), new DateTime(2021, 12, 24, 14, 48, 34, 557, DateTimeKind.Utc).AddTicks(1312), null, false, new Guid("00000000-0000-0000-0000-000000000000"), new DateTime(2021, 12, 24, 14, 48, 34, 557, DateTimeKind.Utc).AddTicks(1312), "Навигация Игрока", new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3") }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "UserRolesToNavigationItems",
                columns: new[] { "NavigationItemId", "RoleId" },
                values: new object[,]
                {
                    { 1, 3 },
                    { 2, 3 },
                    { 3, 3 },
                    { 6, 3 },
                    { 1, 5 },
                    { 2, 5 },
                    { 3, 5 },
                    { 4, 5 },
                    { 5, 5 },
                    { 6, 5 }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "UsersToRoles",
                columns: new[] { "RoleId", "UserId" },
                values: new object[,]
                {
                    { 1, new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3") },
                    { 2, new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3") },
                    { 3, new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3") },
                    { 5, new Guid("fadde9ec-7dc4-4033-b1e6-2f83a08c70f3") }
                });

            migrationBuilder.InsertData(
                schema: "dbo",
                table: "NavigationsToNavigationItems",
                columns: new[] { "NavigationId", "NavigationItemId" },
                values: new object[,]
                {
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), 1 },
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), 2 },
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), 3 },
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), 4 },
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), 5 },
                    { new Guid("325fa719-e56e-4759-814b-4f09ca5df495"), 6 },
                    { new Guid("ce5f70ec-80ed-4b09-a0ff-6c80df8e93b6"), 1 },
                    { new Guid("ce5f70ec-80ed-4b09-a0ff-6c80df8e93b6"), 2 },
                    { new Guid("ce5f70ec-80ed-4b09-a0ff-6c80df8e93b6"), 3 },
                    { new Guid("ce5f70ec-80ed-4b09-a0ff-6c80df8e93b6"), 6 }
                });

            migrationBuilder.CreateIndex(
                name: "IX_NavigationsToNavigationItems_NavigationItemId",
                schema: "dbo",
                table: "NavigationsToNavigationItems",
                column: "NavigationItemId");

            migrationBuilder.CreateIndex(
                name: "IX_UserNavigations_UserId",
                schema: "dbo",
                table: "UserNavigations",
                column: "UserId");

            migrationBuilder.CreateIndex(
                name: "IX_UserRolesToNavigationItems_NavigationItemId",
                schema: "dbo",
                table: "UserRolesToNavigationItems",
                column: "NavigationItemId");

            migrationBuilder.CreateIndex(
                name: "IX_UsersToRoles_RoleId",
                schema: "dbo",
                table: "UsersToRoles",
                column: "RoleId");
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "NavigationsToNavigationItems",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "RuCities",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "UserRolesToNavigationItems",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "UsersToRoles",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "UserNavigations",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "NavigationItems",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "UserRoles",
                schema: "dbo");

            migrationBuilder.DropTable(
                name: "Users",
                schema: "dbo");
        }
    }
}
